--
-- PostgreSQL database dump
--

\restrict 9gzRY4pjJgFgOwxeyFuFTy4cRnvHrgShKW9YKfLHkhrY0Tj5DgVmt1unkOMsqLO

-- Dumped from database version 15.17 (Debian 15.17-1.pgdg13+1)
-- Dumped by pg_dump version 15.17 (Debian 15.17-1.pgdg13+1)

SET statement_timeout = 0;
SET lock_timeout = 0;
SET idle_in_transaction_session_timeout = 0;
SET client_encoding = 'UTF8';
SET standard_conforming_strings = on;
SELECT pg_catalog.set_config('search_path', '', false);
SET check_function_bodies = false;
SET xmloption = content;
SET client_min_messages = warning;
SET row_security = off;

SET default_tablespace = '';

SET default_table_access_method = heap;

--
-- Name: dim_campus; Type: TABLE; Schema: public; Owner: admin
--

CREATE TABLE public.dim_campus (
    id integer NOT NULL,
    campus_code text NOT NULL,
    campus_name_th text
);


ALTER TABLE public.dim_campus OWNER TO admin;

--
-- Name: dim_campus_id_seq; Type: SEQUENCE; Schema: public; Owner: admin
--

CREATE SEQUENCE public.dim_campus_id_seq
    AS integer
    START WITH 1
    INCREMENT BY 1
    NO MINVALUE
    NO MAXVALUE
    CACHE 1;


ALTER TABLE public.dim_campus_id_seq OWNER TO admin;

--
-- Name: dim_campus_id_seq; Type: SEQUENCE OWNED BY; Schema: public; Owner: admin
--

ALTER SEQUENCE public.dim_campus_id_seq OWNED BY public.dim_campus.id;


--
-- Name: dim_date; Type: TABLE; Schema: public; Owner: admin
--

CREATE TABLE public.dim_date (
    id bigint NOT NULL,
    date_actual date NOT NULL,
    date_str character varying(12),
    year_ce integer,
    year_be integer,
    month_num integer,
    month_name text,
    month_short text,
    day_num integer,
    day_name text,
    day_of_week integer,
    quarter character varying(4),
    is_weekend boolean
);


ALTER TABLE public.dim_date OWNER TO admin;

--
-- Name: dim_date_id_seq; Type: SEQUENCE; Schema: public; Owner: admin
--

CREATE SEQUENCE public.dim_date_id_seq
    START WITH 1
    INCREMENT BY 1
    NO MINVALUE
    NO MAXVALUE
    CACHE 1;


ALTER TABLE public.dim_date_id_seq OWNER TO admin;

--
-- Name: dim_date_id_seq; Type: SEQUENCE OWNED BY; Schema: public; Owner: admin
--

ALTER SEQUENCE public.dim_date_id_seq OWNED BY public.dim_date.id;


--
-- Name: dim_faculty; Type: TABLE; Schema: public; Owner: admin
--

CREATE TABLE public.dim_faculty (
    id integer NOT NULL,
    faculty_code text NOT NULL,
    faculty_name_th text
);


ALTER TABLE public.dim_faculty OWNER TO admin;

--
-- Name: dim_faculty_id_seq; Type: SEQUENCE; Schema: public; Owner: admin
--

CREATE SEQUENCE public.dim_faculty_id_seq
    AS integer
    START WITH 1
    INCREMENT BY 1
    NO MINVALUE
    NO MAXVALUE
    CACHE 1;


ALTER TABLE public.dim_faculty_id_seq OWNER TO admin;

--
-- Name: dim_faculty_id_seq; Type: SEQUENCE OWNED BY; Schema: public; Owner: admin
--

ALTER SEQUENCE public.dim_faculty_id_seq OWNED BY public.dim_faculty.id;


--
-- Name: fact_academic_calendar; Type: TABLE; Schema: public; Owner: admin
--

CREATE TABLE public.fact_academic_calendar (
    id bigint NOT NULL,
    date_id bigint,
    campus_id integer,
    faculty_id integer,
    academic_year integer,
    semester integer,
    week_of_semester integer,
    is_academic_day boolean,
    is_holiday boolean,
    holiday_name text,
    day_type text
);


ALTER TABLE public.fact_academic_calendar OWNER TO admin;

--
-- Name: fact_academic_calendar_id_seq; Type: SEQUENCE; Schema: public; Owner: admin
--

CREATE SEQUENCE public.fact_academic_calendar_id_seq
    START WITH 1
    INCREMENT BY 1
    NO MINVALUE
    NO MAXVALUE
    CACHE 1;


ALTER TABLE public.fact_academic_calendar_id_seq OWNER TO admin;

--
-- Name: fact_academic_calendar_id_seq; Type: SEQUENCE OWNED BY; Schema: public; Owner: admin
--

ALTER SEQUENCE public.fact_academic_calendar_id_seq OWNED BY public.fact_academic_calendar.id;


--
-- Name: dim_campus id; Type: DEFAULT; Schema: public; Owner: admin
--

ALTER TABLE ONLY public.dim_campus ALTER COLUMN id SET DEFAULT nextval('public.dim_campus_id_seq'::regclass);


--
-- Name: dim_date id; Type: DEFAULT; Schema: public; Owner: admin
--

ALTER TABLE ONLY public.dim_date ALTER COLUMN id SET DEFAULT nextval('public.dim_date_id_seq'::regclass);


--
-- Name: dim_faculty id; Type: DEFAULT; Schema: public; Owner: admin
--

ALTER TABLE ONLY public.dim_faculty ALTER COLUMN id SET DEFAULT nextval('public.dim_faculty_id_seq'::regclass);


--
-- Name: fact_academic_calendar id; Type: DEFAULT; Schema: public; Owner: admin
--

ALTER TABLE ONLY public.fact_academic_calendar ALTER COLUMN id SET DEFAULT nextval('public.fact_academic_calendar_id_seq'::regclass);


--
-- Data for Name: dim_campus; Type: TABLE DATA; Schema: public; Owner: admin
--

COPY public.dim_campus (id, campus_code, campus_name_th) FROM stdin;
1	HatYai	วิทยาเขตหาดใหญ่
4	Pattani	วิทยาเขตปัตตานี
5	Phuket	วิทยาเขตภูเก็ต
6	Trang	วิทยาเขตตรัง
7	Suratthani	วิทยาเขตสุราษฎร์ฯ
\.


--
-- Data for Name: dim_date; Type: TABLE DATA; Schema: public; Owner: admin
--

COPY public.dim_date (id, date_actual, date_str, year_ce, year_be, month_num, month_name, month_short, day_num, day_name, day_of_week, quarter, is_weekend) FROM stdin;
1	2022-03-28	28/03/2022	2022	2565	3	มีนาคม	มี.ค.	28	จันทร์	1	Q1	f
2	2022-03-29	29/03/2022	2022	2565	3	มีนาคม	มี.ค.	29	อังคาร	2	Q1	f
3	2022-03-30	30/03/2022	2022	2565	3	มีนาคม	มี.ค.	30	พุธ	3	Q1	f
4	2022-03-31	31/03/2022	2022	2565	3	มีนาคม	มี.ค.	31	พฤหัสบดี	4	Q1	f
5	2022-04-01	01/04/2022	2022	2565	4	เมษายน	เม.ย.	1	ศุกร์	5	Q2	f
6	2022-04-02	02/04/2022	2022	2565	4	เมษายน	เม.ย.	2	เสาร์	6	Q2	t
7	2022-04-03	03/04/2022	2022	2565	4	เมษายน	เม.ย.	3	อาทิตย์	7	Q2	t
8	2022-04-04	04/04/2022	2022	2565	4	เมษายน	เม.ย.	4	จันทร์	1	Q2	f
9	2022-04-05	05/04/2022	2022	2565	4	เมษายน	เม.ย.	5	อังคาร	2	Q2	f
10	2022-04-06	06/04/2022	2022	2565	4	เมษายน	เม.ย.	6	พุธ	3	Q2	f
11	2022-04-07	07/04/2022	2022	2565	4	เมษายน	เม.ย.	7	พฤหัสบดี	4	Q2	f
12	2022-04-08	08/04/2022	2022	2565	4	เมษายน	เม.ย.	8	ศุกร์	5	Q2	f
13	2022-04-09	09/04/2022	2022	2565	4	เมษายน	เม.ย.	9	เสาร์	6	Q2	t
14	2022-04-10	10/04/2022	2022	2565	4	เมษายน	เม.ย.	10	อาทิตย์	7	Q2	t
15	2022-04-11	11/04/2022	2022	2565	4	เมษายน	เม.ย.	11	จันทร์	1	Q2	f
16	2022-04-12	12/04/2022	2022	2565	4	เมษายน	เม.ย.	12	อังคาร	2	Q2	f
17	2022-04-13	13/04/2022	2022	2565	4	เมษายน	เม.ย.	13	พุธ	3	Q2	f
18	2022-04-14	14/04/2022	2022	2565	4	เมษายน	เม.ย.	14	พฤหัสบดี	4	Q2	f
26	2022-04-22	22/04/2022	2022	2565	4	เมษายน	เม.ย.	22	ศุกร์	5	Q2	f
19	2022-04-15	15/04/2022	2022	2565	4	เมษายน	เม.ย.	15	ศุกร์	5	Q2	f
20	2022-04-16	16/04/2022	2022	2565	4	เมษายน	เม.ย.	16	เสาร์	6	Q2	t
21	2022-04-17	17/04/2022	2022	2565	4	เมษายน	เม.ย.	17	อาทิตย์	7	Q2	t
25	2022-04-21	21/04/2022	2022	2565	4	เมษายน	เม.ย.	21	พฤหัสบดี	4	Q2	f
27	2022-04-23	23/04/2022	2022	2565	4	เมษายน	เม.ย.	23	เสาร์	6	Q2	t
28	2022-04-24	24/04/2022	2022	2565	4	เมษายน	เม.ย.	24	อาทิตย์	7	Q2	t
29	2022-04-25	25/04/2022	2022	2565	4	เมษายน	เม.ย.	25	จันทร์	1	Q2	f
30	2022-04-26	26/04/2022	2022	2565	4	เมษายน	เม.ย.	26	อังคาร	2	Q2	f
31	2022-04-27	27/04/2022	2022	2565	4	เมษายน	เม.ย.	27	พุธ	3	Q2	f
32	2022-04-28	28/04/2022	2022	2565	4	เมษายน	เม.ย.	28	พฤหัสบดี	4	Q2	f
33	2022-04-29	29/04/2022	2022	2565	4	เมษายน	เม.ย.	29	ศุกร์	5	Q2	f
34	2022-04-30	30/04/2022	2022	2565	4	เมษายน	เม.ย.	30	เสาร์	6	Q2	t
35	2022-05-01	01/05/2022	2022	2565	5	พฤษภาคม	พ.ค.	1	อาทิตย์	7	Q2	t
36	2022-05-02	02/05/2022	2022	2565	5	พฤษภาคม	พ.ค.	2	จันทร์	1	Q2	f
37	2022-05-03	03/05/2022	2022	2565	5	พฤษภาคม	พ.ค.	3	อังคาร	2	Q2	f
38	2022-05-04	04/05/2022	2022	2565	5	พฤษภาคม	พ.ค.	4	พุธ	3	Q2	f
39	2022-05-05	05/05/2022	2022	2565	5	พฤษภาคม	พ.ค.	5	พฤหัสบดี	4	Q2	f
40	2022-05-06	06/05/2022	2022	2565	5	พฤษภาคม	พ.ค.	6	ศุกร์	5	Q2	f
41	2022-05-07	07/05/2022	2022	2565	5	พฤษภาคม	พ.ค.	7	เสาร์	6	Q2	t
42	2022-05-08	08/05/2022	2022	2565	5	พฤษภาคม	พ.ค.	8	อาทิตย์	7	Q2	t
43	2022-05-09	09/05/2022	2022	2565	5	พฤษภาคม	พ.ค.	9	จันทร์	1	Q2	f
44	2022-05-10	10/05/2022	2022	2565	5	พฤษภาคม	พ.ค.	10	อังคาร	2	Q2	f
45	2022-05-11	11/05/2022	2022	2565	5	พฤษภาคม	พ.ค.	11	พุธ	3	Q2	f
46	2022-05-12	12/05/2022	2022	2565	5	พฤษภาคม	พ.ค.	12	พฤหัสบดี	4	Q2	f
47	2022-05-13	13/05/2022	2022	2565	5	พฤษภาคม	พ.ค.	13	ศุกร์	5	Q2	f
48	2022-05-14	14/05/2022	2022	2565	5	พฤษภาคม	พ.ค.	14	เสาร์	6	Q2	t
49	2022-05-15	15/05/2022	2022	2565	5	พฤษภาคม	พ.ค.	15	อาทิตย์	7	Q2	t
50	2022-05-16	16/05/2022	2022	2565	5	พฤษภาคม	พ.ค.	16	จันทร์	1	Q2	f
51	2022-05-17	17/05/2022	2022	2565	5	พฤษภาคม	พ.ค.	17	อังคาร	2	Q2	f
52	2022-05-18	18/05/2022	2022	2565	5	พฤษภาคม	พ.ค.	18	พุธ	3	Q2	f
22	2022-04-18	18/04/2022	2022	2565	4	เมษายน	เม.ย.	18	จันทร์	1	Q2	f
23	2022-04-19	19/04/2022	2022	2565	4	เมษายน	เม.ย.	19	อังคาร	2	Q2	f
24	2022-04-20	20/04/2022	2022	2565	4	เมษายน	เม.ย.	20	พุธ	3	Q2	f
53	2022-05-19	19/05/2022	2022	2565	5	พฤษภาคม	พ.ค.	19	พฤหัสบดี	4	Q2	f
54	2022-05-20	20/05/2022	2022	2565	5	พฤษภาคม	พ.ค.	20	ศุกร์	5	Q2	f
379	2023-04-17	17/04/2023	2023	2566	4	เมษายน	เม.ย.	17	จันทร์	1	Q2	f
380	2023-04-18	18/04/2023	2023	2566	4	เมษายน	เม.ย.	18	อังคาร	2	Q2	f
381	2023-04-19	19/04/2023	2023	2566	4	เมษายน	เม.ย.	19	พุธ	3	Q2	f
382	2023-04-20	20/04/2023	2023	2566	4	เมษายน	เม.ย.	20	พฤหัสบดี	4	Q2	f
383	2023-04-21	21/04/2023	2023	2566	4	เมษายน	เม.ย.	21	ศุกร์	5	Q2	f
384	2023-04-22	22/04/2023	2023	2566	4	เมษายน	เม.ย.	22	เสาร์	6	Q2	t
385	2023-04-23	23/04/2023	2023	2566	4	เมษายน	เม.ย.	23	อาทิตย์	7	Q2	t
386	2023-04-24	24/04/2023	2023	2566	4	เมษายน	เม.ย.	24	จันทร์	1	Q2	f
387	2023-04-25	25/04/2023	2023	2566	4	เมษายน	เม.ย.	25	อังคาร	2	Q2	f
388	2023-04-26	26/04/2023	2023	2566	4	เมษายน	เม.ย.	26	พุธ	3	Q2	f
389	2023-04-27	27/04/2023	2023	2566	4	เมษายน	เม.ย.	27	พฤหัสบดี	4	Q2	f
390	2023-04-28	28/04/2023	2023	2566	4	เมษายน	เม.ย.	28	ศุกร์	5	Q2	f
391	2023-04-29	29/04/2023	2023	2566	4	เมษายน	เม.ย.	29	เสาร์	6	Q2	t
392	2023-04-30	30/04/2023	2023	2566	4	เมษายน	เม.ย.	30	อาทิตย์	7	Q2	t
393	2023-05-01	01/05/2023	2023	2566	5	พฤษภาคม	พ.ค.	1	จันทร์	1	Q2	f
394	2023-05-02	02/05/2023	2023	2566	5	พฤษภาคม	พ.ค.	2	อังคาร	2	Q2	f
395	2023-05-03	03/05/2023	2023	2566	5	พฤษภาคม	พ.ค.	3	พุธ	3	Q2	f
396	2023-05-04	04/05/2023	2023	2566	5	พฤษภาคม	พ.ค.	4	พฤหัสบดี	4	Q2	f
397	2023-05-05	05/05/2023	2023	2566	5	พฤษภาคม	พ.ค.	5	ศุกร์	5	Q2	f
398	2023-05-06	06/05/2023	2023	2566	5	พฤษภาคม	พ.ค.	6	เสาร์	6	Q2	t
399	2023-05-07	07/05/2023	2023	2566	5	พฤษภาคม	พ.ค.	7	อาทิตย์	7	Q2	t
400	2023-05-08	08/05/2023	2023	2566	5	พฤษภาคม	พ.ค.	8	จันทร์	1	Q2	f
401	2023-05-09	09/05/2023	2023	2566	5	พฤษภาคม	พ.ค.	9	อังคาร	2	Q2	f
402	2023-05-10	10/05/2023	2023	2566	5	พฤษภาคม	พ.ค.	10	พุธ	3	Q2	f
403	2023-05-11	11/05/2023	2023	2566	5	พฤษภาคม	พ.ค.	11	พฤหัสบดี	4	Q2	f
404	2023-05-12	12/05/2023	2023	2566	5	พฤษภาคม	พ.ค.	12	ศุกร์	5	Q2	f
405	2023-05-13	13/05/2023	2023	2566	5	พฤษภาคม	พ.ค.	13	เสาร์	6	Q2	t
406	2023-05-14	14/05/2023	2023	2566	5	พฤษภาคม	พ.ค.	14	อาทิตย์	7	Q2	t
407	2023-05-15	15/05/2023	2023	2566	5	พฤษภาคม	พ.ค.	15	จันทร์	1	Q2	f
408	2023-05-16	16/05/2023	2023	2566	5	พฤษภาคม	พ.ค.	16	อังคาร	2	Q2	f
409	2023-05-17	17/05/2023	2023	2566	5	พฤษภาคม	พ.ค.	17	พุธ	3	Q2	f
410	2023-05-18	18/05/2023	2023	2566	5	พฤษภาคม	พ.ค.	18	พฤหัสบดี	4	Q2	f
411	2023-05-19	19/05/2023	2023	2566	5	พฤษภาคม	พ.ค.	19	ศุกร์	5	Q2	f
412	2023-05-20	20/05/2023	2023	2566	5	พฤษภาคม	พ.ค.	20	เสาร์	6	Q2	t
413	2023-05-21	21/05/2023	2023	2566	5	พฤษภาคม	พ.ค.	21	อาทิตย์	7	Q2	t
414	2023-05-22	22/05/2023	2023	2566	5	พฤษภาคม	พ.ค.	22	จันทร์	1	Q2	f
415	2023-05-23	23/05/2023	2023	2566	5	พฤษภาคม	พ.ค.	23	อังคาร	2	Q2	f
416	2023-05-24	24/05/2023	2023	2566	5	พฤษภาคม	พ.ค.	24	พุธ	3	Q2	f
417	2023-05-25	25/05/2023	2023	2566	5	พฤษภาคม	พ.ค.	25	พฤหัสบดี	4	Q2	f
418	2023-05-26	26/05/2023	2023	2566	5	พฤษภาคม	พ.ค.	26	ศุกร์	5	Q2	f
419	2023-05-27	27/05/2023	2023	2566	5	พฤษภาคม	พ.ค.	27	เสาร์	6	Q2	t
420	2023-05-28	28/05/2023	2023	2566	5	พฤษภาคม	พ.ค.	28	อาทิตย์	7	Q2	t
421	2023-05-29	29/05/2023	2023	2566	5	พฤษภาคม	พ.ค.	29	จันทร์	1	Q2	f
422	2023-05-30	30/05/2023	2023	2566	5	พฤษภาคม	พ.ค.	30	อังคาร	2	Q2	f
423	2023-05-31	31/05/2023	2023	2566	5	พฤษภาคม	พ.ค.	31	พุธ	3	Q2	f
424	2023-06-01	01/06/2023	2023	2566	6	มิถุนายน	มิ.ย.	1	พฤหัสบดี	4	Q2	f
425	2023-06-02	02/06/2023	2023	2566	6	มิถุนายน	มิ.ย.	2	ศุกร์	5	Q2	f
426	2023-06-03	03/06/2023	2023	2566	6	มิถุนายน	มิ.ย.	3	เสาร์	6	Q2	t
427	2023-06-04	04/06/2023	2023	2566	6	มิถุนายน	มิ.ย.	4	อาทิตย์	7	Q2	t
428	2023-06-05	05/06/2023	2023	2566	6	มิถุนายน	มิ.ย.	5	จันทร์	1	Q2	f
429	2023-06-06	06/06/2023	2023	2566	6	มิถุนายน	มิ.ย.	6	อังคาร	2	Q2	f
430	2023-06-07	07/06/2023	2023	2566	6	มิถุนายน	มิ.ย.	7	พุธ	3	Q2	f
431	2023-06-08	08/06/2023	2023	2566	6	มิถุนายน	มิ.ย.	8	พฤหัสบดี	4	Q2	f
432	2023-06-09	09/06/2023	2023	2566	6	มิถุนายน	มิ.ย.	9	ศุกร์	5	Q2	f
433	2023-06-10	10/06/2023	2023	2566	6	มิถุนายน	มิ.ย.	10	เสาร์	6	Q2	t
803	2023-08-04	04/08/2023	2023	2566	8	สิงหาคม	ส.ค.	4	ศุกร์	5	Q3	f
804	2023-08-05	05/08/2023	2023	2566	8	สิงหาคม	ส.ค.	5	เสาร์	6	Q3	t
805	2023-08-06	06/08/2023	2023	2566	8	สิงหาคม	ส.ค.	6	อาทิตย์	7	Q3	t
806	2023-08-07	07/08/2023	2023	2566	8	สิงหาคม	ส.ค.	7	จันทร์	1	Q3	f
1076	2024-05-03	03/05/2024	2024	2567	5	พฤษภาคม	พ.ค.	3	ศุกร์	5	Q2	f
1077	2024-05-04	04/05/2024	2024	2567	5	พฤษภาคม	พ.ค.	4	เสาร์	6	Q2	t
1078	2024-05-05	05/05/2024	2024	2567	5	พฤษภาคม	พ.ค.	5	อาทิตย์	7	Q2	t
1079	2024-05-06	06/05/2024	2024	2567	5	พฤษภาคม	พ.ค.	6	จันทร์	1	Q2	f
1080	2024-05-07	07/05/2024	2024	2567	5	พฤษภาคม	พ.ค.	7	อังคาร	2	Q2	f
1081	2024-05-08	08/05/2024	2024	2567	5	พฤษภาคม	พ.ค.	8	พุธ	3	Q2	f
1082	2024-05-09	09/05/2024	2024	2567	5	พฤษภาคม	พ.ค.	9	พฤหัสบดี	4	Q2	f
1083	2024-05-10	10/05/2024	2024	2567	5	พฤษภาคม	พ.ค.	10	ศุกร์	5	Q2	f
1084	2024-05-11	11/05/2024	2024	2567	5	พฤษภาคม	พ.ค.	11	เสาร์	6	Q2	t
1085	2024-05-12	12/05/2024	2024	2567	5	พฤษภาคม	พ.ค.	12	อาทิตย์	7	Q2	t
1086	2024-05-13	13/05/2024	2024	2567	5	พฤษภาคม	พ.ค.	13	จันทร์	1	Q2	f
1087	2024-05-14	14/05/2024	2024	2567	5	พฤษภาคม	พ.ค.	14	อังคาร	2	Q2	f
1088	2024-05-15	15/05/2024	2024	2567	5	พฤษภาคม	พ.ค.	15	พุธ	3	Q2	f
1089	2024-05-16	16/05/2024	2024	2567	5	พฤษภาคม	พ.ค.	16	พฤหัสบดี	4	Q2	f
1090	2024-05-17	17/05/2024	2024	2567	5	พฤษภาคม	พ.ค.	17	ศุกร์	5	Q2	f
1091	2024-05-18	18/05/2024	2024	2567	5	พฤษภาคม	พ.ค.	18	เสาร์	6	Q2	t
1092	2024-05-19	19/05/2024	2024	2567	5	พฤษภาคม	พ.ค.	19	อาทิตย์	7	Q2	t
1093	2024-05-20	20/05/2024	2024	2567	5	พฤษภาคม	พ.ค.	20	จันทร์	1	Q2	f
870	2023-10-10	10/10/2023	2023	2566	10	ตุลาคม	ต.ค.	10	อังคาร	2	Q4	f
764	2023-06-26	26/06/2023	2023	2566	6	มิถุนายน	มิ.ย.	26	จันทร์	1	Q2	f
765	2023-06-27	27/06/2023	2023	2566	6	มิถุนายน	มิ.ย.	27	อังคาร	2	Q2	f
766	2023-06-28	28/06/2023	2023	2566	6	มิถุนายน	มิ.ย.	28	พุธ	3	Q2	f
767	2023-06-29	29/06/2023	2023	2566	6	มิถุนายน	มิ.ย.	29	พฤหัสบดี	4	Q2	f
1396	2023-06-11	11/06/2023	2023	2566	6	มิถุนายน	มิ.ย.	11	อาทิตย์	7	Q2	t
1397	2023-06-12	12/06/2023	2023	2566	6	มิถุนายน	มิ.ย.	12	จันทร์	1	Q2	f
1398	2023-06-13	13/06/2023	2023	2566	6	มิถุนายน	มิ.ย.	13	อังคาร	2	Q2	f
1399	2023-06-14	14/06/2023	2023	2566	6	มิถุนายน	มิ.ย.	14	พุธ	3	Q2	f
1400	2023-06-15	15/06/2023	2023	2566	6	มิถุนายน	มิ.ย.	15	พฤหัสบดี	4	Q2	f
1401	2023-06-16	16/06/2023	2023	2566	6	มิถุนายน	มิ.ย.	16	ศุกร์	5	Q2	f
1402	2023-06-17	17/06/2023	2023	2566	6	มิถุนายน	มิ.ย.	17	เสาร์	6	Q2	t
1403	2023-06-18	18/06/2023	2023	2566	6	มิถุนายน	มิ.ย.	18	อาทิตย์	7	Q2	t
1404	2023-06-19	19/06/2023	2023	2566	6	มิถุนายน	มิ.ย.	19	จันทร์	1	Q2	f
1405	2023-06-20	20/06/2023	2023	2566	6	มิถุนายน	มิ.ย.	20	อังคาร	2	Q2	f
1406	2023-06-21	21/06/2023	2023	2566	6	มิถุนายน	มิ.ย.	21	พุธ	3	Q2	f
1407	2023-06-22	22/06/2023	2023	2566	6	มิถุนายน	มิ.ย.	22	พฤหัสบดี	4	Q2	f
1408	2023-06-23	23/06/2023	2023	2566	6	มิถุนายน	มิ.ย.	23	ศุกร์	5	Q2	f
1409	2023-06-24	24/06/2023	2023	2566	6	มิถุนายน	มิ.ย.	24	เสาร์	6	Q2	t
1410	2023-06-25	25/06/2023	2023	2566	6	มิถุนายน	มิ.ย.	25	อาทิตย์	7	Q2	t
789	2023-07-21	21/07/2023	2023	2566	7	กรกฎาคม	ก.ค.	21	ศุกร์	5	Q3	f
768	2023-06-30	30/06/2023	2023	2566	6	มิถุนายน	มิ.ย.	30	ศุกร์	5	Q2	f
769	2023-07-01	01/07/2023	2023	2566	7	กรกฎาคม	ก.ค.	1	เสาร์	6	Q3	t
770	2023-07-02	02/07/2023	2023	2566	7	กรกฎาคม	ก.ค.	2	อาทิตย์	7	Q3	t
771	2023-07-03	03/07/2023	2023	2566	7	กรกฎาคม	ก.ค.	3	จันทร์	1	Q3	f
772	2023-07-04	04/07/2023	2023	2566	7	กรกฎาคม	ก.ค.	4	อังคาร	2	Q3	f
773	2023-07-05	05/07/2023	2023	2566	7	กรกฎาคม	ก.ค.	5	พุธ	3	Q3	f
774	2023-07-06	06/07/2023	2023	2566	7	กรกฎาคม	ก.ค.	6	พฤหัสบดี	4	Q3	f
775	2023-07-07	07/07/2023	2023	2566	7	กรกฎาคม	ก.ค.	7	ศุกร์	5	Q3	f
776	2023-07-08	08/07/2023	2023	2566	7	กรกฎาคม	ก.ค.	8	เสาร์	6	Q3	t
777	2023-07-09	09/07/2023	2023	2566	7	กรกฎาคม	ก.ค.	9	อาทิตย์	7	Q3	t
778	2023-07-10	10/07/2023	2023	2566	7	กรกฎาคม	ก.ค.	10	จันทร์	1	Q3	f
779	2023-07-11	11/07/2023	2023	2566	7	กรกฎาคม	ก.ค.	11	อังคาร	2	Q3	f
780	2023-07-12	12/07/2023	2023	2566	7	กรกฎาคม	ก.ค.	12	พุธ	3	Q3	f
781	2023-07-13	13/07/2023	2023	2566	7	กรกฎาคม	ก.ค.	13	พฤหัสบดี	4	Q3	f
782	2023-07-14	14/07/2023	2023	2566	7	กรกฎาคม	ก.ค.	14	ศุกร์	5	Q3	f
783	2023-07-15	15/07/2023	2023	2566	7	กรกฎาคม	ก.ค.	15	เสาร์	6	Q3	t
784	2023-07-16	16/07/2023	2023	2566	7	กรกฎาคม	ก.ค.	16	อาทิตย์	7	Q3	t
785	2023-07-17	17/07/2023	2023	2566	7	กรกฎาคม	ก.ค.	17	จันทร์	1	Q3	f
786	2023-07-18	18/07/2023	2023	2566	7	กรกฎาคม	ก.ค.	18	อังคาร	2	Q3	f
787	2023-07-19	19/07/2023	2023	2566	7	กรกฎาคม	ก.ค.	19	พุธ	3	Q3	f
788	2023-07-20	20/07/2023	2023	2566	7	กรกฎาคม	ก.ค.	20	พฤหัสบดี	4	Q3	f
790	2023-07-22	22/07/2023	2023	2566	7	กรกฎาคม	ก.ค.	22	เสาร์	6	Q3	t
791	2023-07-23	23/07/2023	2023	2566	7	กรกฎาคม	ก.ค.	23	อาทิตย์	7	Q3	t
792	2023-07-24	24/07/2023	2023	2566	7	กรกฎาคม	ก.ค.	24	จันทร์	1	Q3	f
793	2023-07-25	25/07/2023	2023	2566	7	กรกฎาคม	ก.ค.	25	อังคาร	2	Q3	f
794	2023-07-26	26/07/2023	2023	2566	7	กรกฎาคม	ก.ค.	26	พุธ	3	Q3	f
795	2023-07-27	27/07/2023	2023	2566	7	กรกฎาคม	ก.ค.	27	พฤหัสบดี	4	Q3	f
796	2023-07-28	28/07/2023	2023	2566	7	กรกฎาคม	ก.ค.	28	ศุกร์	5	Q3	f
797	2023-07-29	29/07/2023	2023	2566	7	กรกฎาคม	ก.ค.	29	เสาร์	6	Q3	t
798	2023-07-30	30/07/2023	2023	2566	7	กรกฎาคม	ก.ค.	30	อาทิตย์	7	Q3	t
799	2023-07-31	31/07/2023	2023	2566	7	กรกฎาคม	ก.ค.	31	จันทร์	1	Q3	f
871	2023-10-11	11/10/2023	2023	2566	10	ตุลาคม	ต.ค.	11	พุธ	3	Q4	f
800	2023-08-01	01/08/2023	2023	2566	8	สิงหาคม	ส.ค.	1	อังคาร	2	Q3	f
801	2023-08-02	02/08/2023	2023	2566	8	สิงหาคม	ส.ค.	2	พุธ	3	Q3	f
802	2023-08-03	03/08/2023	2023	2566	8	สิงหาคม	ส.ค.	3	พฤหัสบดี	4	Q3	f
807	2023-08-08	08/08/2023	2023	2566	8	สิงหาคม	ส.ค.	8	อังคาร	2	Q3	f
808	2023-08-09	09/08/2023	2023	2566	8	สิงหาคม	ส.ค.	9	พุธ	3	Q3	f
809	2023-08-10	10/08/2023	2023	2566	8	สิงหาคม	ส.ค.	10	พฤหัสบดี	4	Q3	f
810	2023-08-11	11/08/2023	2023	2566	8	สิงหาคม	ส.ค.	11	ศุกร์	5	Q3	f
811	2023-08-12	12/08/2023	2023	2566	8	สิงหาคม	ส.ค.	12	เสาร์	6	Q3	t
812	2023-08-13	13/08/2023	2023	2566	8	สิงหาคม	ส.ค.	13	อาทิตย์	7	Q3	t
813	2023-08-14	14/08/2023	2023	2566	8	สิงหาคม	ส.ค.	14	จันทร์	1	Q3	f
814	2023-08-15	15/08/2023	2023	2566	8	สิงหาคม	ส.ค.	15	อังคาร	2	Q3	f
815	2023-08-16	16/08/2023	2023	2566	8	สิงหาคม	ส.ค.	16	พุธ	3	Q3	f
816	2023-08-17	17/08/2023	2023	2566	8	สิงหาคม	ส.ค.	17	พฤหัสบดี	4	Q3	f
817	2023-08-18	18/08/2023	2023	2566	8	สิงหาคม	ส.ค.	18	ศุกร์	5	Q3	f
818	2023-08-19	19/08/2023	2023	2566	8	สิงหาคม	ส.ค.	19	เสาร์	6	Q3	t
819	2023-08-20	20/08/2023	2023	2566	8	สิงหาคม	ส.ค.	20	อาทิตย์	7	Q3	t
820	2023-08-21	21/08/2023	2023	2566	8	สิงหาคม	ส.ค.	21	จันทร์	1	Q3	f
826	2023-08-27	27/08/2023	2023	2566	8	สิงหาคม	ส.ค.	27	อาทิตย์	7	Q3	t
827	2023-08-28	28/08/2023	2023	2566	8	สิงหาคม	ส.ค.	28	จันทร์	1	Q3	f
828	2023-08-29	29/08/2023	2023	2566	8	สิงหาคม	ส.ค.	29	อังคาร	2	Q3	f
829	2023-08-30	30/08/2023	2023	2566	8	สิงหาคม	ส.ค.	30	พุธ	3	Q3	f
830	2023-08-31	31/08/2023	2023	2566	8	สิงหาคม	ส.ค.	31	พฤหัสบดี	4	Q3	f
831	2023-09-01	01/09/2023	2023	2566	9	กันยายน	ก.ย.	1	ศุกร์	5	Q3	f
832	2023-09-02	02/09/2023	2023	2566	9	กันยายน	ก.ย.	2	เสาร์	6	Q3	t
833	2023-09-03	03/09/2023	2023	2566	9	กันยายน	ก.ย.	3	อาทิตย์	7	Q3	t
834	2023-09-04	04/09/2023	2023	2566	9	กันยายน	ก.ย.	4	จันทร์	1	Q3	f
835	2023-09-05	05/09/2023	2023	2566	9	กันยายน	ก.ย.	5	อังคาร	2	Q3	f
836	2023-09-06	06/09/2023	2023	2566	9	กันยายน	ก.ย.	6	พุธ	3	Q3	f
837	2023-09-07	07/09/2023	2023	2566	9	กันยายน	ก.ย.	7	พฤหัสบดี	4	Q3	f
838	2023-09-08	08/09/2023	2023	2566	9	กันยายน	ก.ย.	8	ศุกร์	5	Q3	f
839	2023-09-09	09/09/2023	2023	2566	9	กันยายน	ก.ย.	9	เสาร์	6	Q3	t
840	2023-09-10	10/09/2023	2023	2566	9	กันยายน	ก.ย.	10	อาทิตย์	7	Q3	t
841	2023-09-11	11/09/2023	2023	2566	9	กันยายน	ก.ย.	11	จันทร์	1	Q3	f
842	2023-09-12	12/09/2023	2023	2566	9	กันยายน	ก.ย.	12	อังคาร	2	Q3	f
843	2023-09-13	13/09/2023	2023	2566	9	กันยายน	ก.ย.	13	พุธ	3	Q3	f
844	2023-09-14	14/09/2023	2023	2566	9	กันยายน	ก.ย.	14	พฤหัสบดี	4	Q3	f
821	2023-08-22	22/08/2023	2023	2566	8	สิงหาคม	ส.ค.	22	อังคาร	2	Q3	f
822	2023-08-23	23/08/2023	2023	2566	8	สิงหาคม	ส.ค.	23	พุธ	3	Q3	f
823	2023-08-24	24/08/2023	2023	2566	8	สิงหาคม	ส.ค.	24	พฤหัสบดี	4	Q3	f
824	2023-08-25	25/08/2023	2023	2566	8	สิงหาคม	ส.ค.	25	ศุกร์	5	Q3	f
825	2023-08-26	26/08/2023	2023	2566	8	สิงหาคม	ส.ค.	26	เสาร์	6	Q3	t
845	2023-09-15	15/09/2023	2023	2566	9	กันยายน	ก.ย.	15	ศุกร์	5	Q3	f
846	2023-09-16	16/09/2023	2023	2566	9	กันยายน	ก.ย.	16	เสาร์	6	Q3	t
847	2023-09-17	17/09/2023	2023	2566	9	กันยายน	ก.ย.	17	อาทิตย์	7	Q3	t
848	2023-09-18	18/09/2023	2023	2566	9	กันยายน	ก.ย.	18	จันทร์	1	Q3	f
849	2023-09-19	19/09/2023	2023	2566	9	กันยายน	ก.ย.	19	อังคาร	2	Q3	f
850	2023-09-20	20/09/2023	2023	2566	9	กันยายน	ก.ย.	20	พุธ	3	Q3	f
851	2023-09-21	21/09/2023	2023	2566	9	กันยายน	ก.ย.	21	พฤหัสบดี	4	Q3	f
852	2023-09-22	22/09/2023	2023	2566	9	กันยายน	ก.ย.	22	ศุกร์	5	Q3	f
853	2023-09-23	23/09/2023	2023	2566	9	กันยายน	ก.ย.	23	เสาร์	6	Q3	t
854	2023-09-24	24/09/2023	2023	2566	9	กันยายน	ก.ย.	24	อาทิตย์	7	Q3	t
855	2023-09-25	25/09/2023	2023	2566	9	กันยายน	ก.ย.	25	จันทร์	1	Q3	f
856	2023-09-26	26/09/2023	2023	2566	9	กันยายน	ก.ย.	26	อังคาร	2	Q3	f
857	2023-09-27	27/09/2023	2023	2566	9	กันยายน	ก.ย.	27	พุธ	3	Q3	f
858	2023-09-28	28/09/2023	2023	2566	9	กันยายน	ก.ย.	28	พฤหัสบดี	4	Q3	f
859	2023-09-29	29/09/2023	2023	2566	9	กันยายน	ก.ย.	29	ศุกร์	5	Q3	f
860	2023-09-30	30/09/2023	2023	2566	9	กันยายน	ก.ย.	30	เสาร์	6	Q3	t
861	2023-10-01	01/10/2023	2023	2566	10	ตุลาคม	ต.ค.	1	อาทิตย์	7	Q4	t
862	2023-10-02	02/10/2023	2023	2566	10	ตุลาคม	ต.ค.	2	จันทร์	1	Q4	f
863	2023-10-03	03/10/2023	2023	2566	10	ตุลาคม	ต.ค.	3	อังคาร	2	Q4	f
864	2023-10-04	04/10/2023	2023	2566	10	ตุลาคม	ต.ค.	4	พุธ	3	Q4	f
865	2023-10-05	05/10/2023	2023	2566	10	ตุลาคม	ต.ค.	5	พฤหัสบดี	4	Q4	f
866	2023-10-06	06/10/2023	2023	2566	10	ตุลาคม	ต.ค.	6	ศุกร์	5	Q4	f
867	2023-10-07	07/10/2023	2023	2566	10	ตุลาคม	ต.ค.	7	เสาร์	6	Q4	t
868	2023-10-08	08/10/2023	2023	2566	10	ตุลาคม	ต.ค.	8	อาทิตย์	7	Q4	t
869	2023-10-09	09/10/2023	2023	2566	10	ตุลาคม	ต.ค.	9	จันทร์	1	Q4	f
872	2023-10-12	12/10/2023	2023	2566	10	ตุลาคม	ต.ค.	12	พฤหัสบดี	4	Q4	f
873	2023-10-13	13/10/2023	2023	2566	10	ตุลาคม	ต.ค.	13	ศุกร์	5	Q4	f
874	2023-10-14	14/10/2023	2023	2566	10	ตุลาคม	ต.ค.	14	เสาร์	6	Q4	t
875	2023-10-15	15/10/2023	2023	2566	10	ตุลาคม	ต.ค.	15	อาทิตย์	7	Q4	t
876	2023-10-16	16/10/2023	2023	2566	10	ตุลาคม	ต.ค.	16	จันทร์	1	Q4	f
877	2023-10-17	17/10/2023	2023	2566	10	ตุลาคม	ต.ค.	17	อังคาร	2	Q4	f
878	2023-10-18	18/10/2023	2023	2566	10	ตุลาคม	ต.ค.	18	พุธ	3	Q4	f
879	2023-10-19	19/10/2023	2023	2566	10	ตุลาคม	ต.ค.	19	พฤหัสบดี	4	Q4	f
880	2023-10-20	20/10/2023	2023	2566	10	ตุลาคม	ต.ค.	20	ศุกร์	5	Q4	f
881	2023-10-21	21/10/2023	2023	2566	10	ตุลาคม	ต.ค.	21	เสาร์	6	Q4	t
882	2023-10-22	22/10/2023	2023	2566	10	ตุลาคม	ต.ค.	22	อาทิตย์	7	Q4	t
883	2023-10-23	23/10/2023	2023	2566	10	ตุลาคม	ต.ค.	23	จันทร์	1	Q4	f
884	2023-10-24	24/10/2023	2023	2566	10	ตุลาคม	ต.ค.	24	อังคาร	2	Q4	f
885	2023-10-25	25/10/2023	2023	2566	10	ตุลาคม	ต.ค.	25	พุธ	3	Q4	f
886	2023-10-26	26/10/2023	2023	2566	10	ตุลาคม	ต.ค.	26	พฤหัสบดี	4	Q4	f
887	2023-10-27	27/10/2023	2023	2566	10	ตุลาคม	ต.ค.	27	ศุกร์	5	Q4	f
888	2023-10-28	28/10/2023	2023	2566	10	ตุลาคม	ต.ค.	28	เสาร์	6	Q4	t
889	2023-10-29	29/10/2023	2023	2566	10	ตุลาคม	ต.ค.	29	อาทิตย์	7	Q4	t
890	2023-10-30	30/10/2023	2023	2566	10	ตุลาคม	ต.ค.	30	จันทร์	1	Q4	f
891	2023-10-31	31/10/2023	2023	2566	10	ตุลาคม	ต.ค.	31	อังคาร	2	Q4	f
892	2023-11-01	01/11/2023	2023	2566	11	พฤศจิกายน	พ.ย.	1	พุธ	3	Q4	f
893	2023-11-02	02/11/2023	2023	2566	11	พฤศจิกายน	พ.ย.	2	พฤหัสบดี	4	Q4	f
894	2023-11-03	03/11/2023	2023	2566	11	พฤศจิกายน	พ.ย.	3	ศุกร์	5	Q4	f
895	2023-11-04	04/11/2023	2023	2566	11	พฤศจิกายน	พ.ย.	4	เสาร์	6	Q4	t
896	2023-11-05	05/11/2023	2023	2566	11	พฤศจิกายน	พ.ย.	5	อาทิตย์	7	Q4	t
897	2023-11-06	06/11/2023	2023	2566	11	พฤศจิกายน	พ.ย.	6	จันทร์	1	Q4	f
898	2023-11-07	07/11/2023	2023	2566	11	พฤศจิกายน	พ.ย.	7	อังคาร	2	Q4	f
899	2023-11-08	08/11/2023	2023	2566	11	พฤศจิกายน	พ.ย.	8	พุธ	3	Q4	f
900	2023-11-09	09/11/2023	2023	2566	11	พฤศจิกายน	พ.ย.	9	พฤหัสบดี	4	Q4	f
901	2023-11-10	10/11/2023	2023	2566	11	พฤศจิกายน	พ.ย.	10	ศุกร์	5	Q4	f
902	2023-11-11	11/11/2023	2023	2566	11	พฤศจิกายน	พ.ย.	11	เสาร์	6	Q4	t
903	2023-11-12	12/11/2023	2023	2566	11	พฤศจิกายน	พ.ย.	12	อาทิตย์	7	Q4	t
904	2023-11-13	13/11/2023	2023	2566	11	พฤศจิกายน	พ.ย.	13	จันทร์	1	Q4	f
905	2023-11-14	14/11/2023	2023	2566	11	พฤศจิกายน	พ.ย.	14	อังคาร	2	Q4	f
906	2023-11-15	15/11/2023	2023	2566	11	พฤศจิกายน	พ.ย.	15	พุธ	3	Q4	f
907	2023-11-16	16/11/2023	2023	2566	11	พฤศจิกายน	พ.ย.	16	พฤหัสบดี	4	Q4	f
908	2023-11-17	17/11/2023	2023	2566	11	พฤศจิกายน	พ.ย.	17	ศุกร์	5	Q4	f
909	2023-11-18	18/11/2023	2023	2566	11	พฤศจิกายน	พ.ย.	18	เสาร์	6	Q4	t
910	2023-11-19	19/11/2023	2023	2566	11	พฤศจิกายน	พ.ย.	19	อาทิตย์	7	Q4	t
911	2023-11-20	20/11/2023	2023	2566	11	พฤศจิกายน	พ.ย.	20	จันทร์	1	Q4	f
912	2023-11-21	21/11/2023	2023	2566	11	พฤศจิกายน	พ.ย.	21	อังคาร	2	Q4	f
913	2023-11-22	22/11/2023	2023	2566	11	พฤศจิกายน	พ.ย.	22	พุธ	3	Q4	f
914	2023-11-23	23/11/2023	2023	2566	11	พฤศจิกายน	พ.ย.	23	พฤหัสบดี	4	Q4	f
915	2023-11-24	24/11/2023	2023	2566	11	พฤศจิกายน	พ.ย.	24	ศุกร์	5	Q4	f
916	2023-11-25	25/11/2023	2023	2566	11	พฤศจิกายน	พ.ย.	25	เสาร์	6	Q4	t
917	2023-11-26	26/11/2023	2023	2566	11	พฤศจิกายน	พ.ย.	26	อาทิตย์	7	Q4	t
918	2023-11-27	27/11/2023	2023	2566	11	พฤศจิกายน	พ.ย.	27	จันทร์	1	Q4	f
919	2023-11-28	28/11/2023	2023	2566	11	พฤศจิกายน	พ.ย.	28	อังคาร	2	Q4	f
920	2023-11-29	29/11/2023	2023	2566	11	พฤศจิกายน	พ.ย.	29	พุธ	3	Q4	f
921	2023-11-30	30/11/2023	2023	2566	11	พฤศจิกายน	พ.ย.	30	พฤหัสบดี	4	Q4	f
922	2023-12-01	01/12/2023	2023	2566	12	ธันวาคม	ธ.ค.	1	ศุกร์	5	Q4	f
923	2023-12-02	02/12/2023	2023	2566	12	ธันวาคม	ธ.ค.	2	เสาร์	6	Q4	t
924	2023-12-03	03/12/2023	2023	2566	12	ธันวาคม	ธ.ค.	3	อาทิตย์	7	Q4	t
925	2023-12-04	04/12/2023	2023	2566	12	ธันวาคม	ธ.ค.	4	จันทร์	1	Q4	f
926	2023-12-05	05/12/2023	2023	2566	12	ธันวาคม	ธ.ค.	5	อังคาร	2	Q4	f
927	2023-12-06	06/12/2023	2023	2566	12	ธันวาคม	ธ.ค.	6	พุธ	3	Q4	f
928	2023-12-07	07/12/2023	2023	2566	12	ธันวาคม	ธ.ค.	7	พฤหัสบดี	4	Q4	f
929	2023-12-08	08/12/2023	2023	2566	12	ธันวาคม	ธ.ค.	8	ศุกร์	5	Q4	f
930	2023-12-09	09/12/2023	2023	2566	12	ธันวาคม	ธ.ค.	9	เสาร์	6	Q4	t
931	2023-12-10	10/12/2023	2023	2566	12	ธันวาคม	ธ.ค.	10	อาทิตย์	7	Q4	t
932	2023-12-11	11/12/2023	2023	2566	12	ธันวาคม	ธ.ค.	11	จันทร์	1	Q4	f
933	2023-12-12	12/12/2023	2023	2566	12	ธันวาคม	ธ.ค.	12	อังคาร	2	Q4	f
934	2023-12-13	13/12/2023	2023	2566	12	ธันวาคม	ธ.ค.	13	พุธ	3	Q4	f
935	2023-12-14	14/12/2023	2023	2566	12	ธันวาคม	ธ.ค.	14	พฤหัสบดี	4	Q4	f
936	2023-12-15	15/12/2023	2023	2566	12	ธันวาคม	ธ.ค.	15	ศุกร์	5	Q4	f
937	2023-12-16	16/12/2023	2023	2566	12	ธันวาคม	ธ.ค.	16	เสาร์	6	Q4	t
938	2023-12-17	17/12/2023	2023	2566	12	ธันวาคม	ธ.ค.	17	อาทิตย์	7	Q4	t
939	2023-12-18	18/12/2023	2023	2566	12	ธันวาคม	ธ.ค.	18	จันทร์	1	Q4	f
940	2023-12-19	19/12/2023	2023	2566	12	ธันวาคม	ธ.ค.	19	อังคาร	2	Q4	f
941	2023-12-20	20/12/2023	2023	2566	12	ธันวาคม	ธ.ค.	20	พุธ	3	Q4	f
942	2023-12-21	21/12/2023	2023	2566	12	ธันวาคม	ธ.ค.	21	พฤหัสบดี	4	Q4	f
943	2023-12-22	22/12/2023	2023	2566	12	ธันวาคม	ธ.ค.	22	ศุกร์	5	Q4	f
944	2023-12-23	23/12/2023	2023	2566	12	ธันวาคม	ธ.ค.	23	เสาร์	6	Q4	t
945	2023-12-24	24/12/2023	2023	2566	12	ธันวาคม	ธ.ค.	24	อาทิตย์	7	Q4	t
946	2023-12-25	25/12/2023	2023	2566	12	ธันวาคม	ธ.ค.	25	จันทร์	1	Q4	f
947	2023-12-26	26/12/2023	2023	2566	12	ธันวาคม	ธ.ค.	26	อังคาร	2	Q4	f
948	2023-12-27	27/12/2023	2023	2566	12	ธันวาคม	ธ.ค.	27	พุธ	3	Q4	f
949	2023-12-28	28/12/2023	2023	2566	12	ธันวาคม	ธ.ค.	28	พฤหัสบดี	4	Q4	f
950	2023-12-29	29/12/2023	2023	2566	12	ธันวาคม	ธ.ค.	29	ศุกร์	5	Q4	f
951	2023-12-30	30/12/2023	2023	2566	12	ธันวาคม	ธ.ค.	30	เสาร์	6	Q4	t
952	2023-12-31	31/12/2023	2023	2566	12	ธันวาคม	ธ.ค.	31	อาทิตย์	7	Q4	t
953	2024-01-01	01/01/2024	2024	2567	1	มกราคม	ม.ค.	1	จันทร์	1	Q1	f
954	2024-01-02	02/01/2024	2024	2567	1	มกราคม	ม.ค.	2	อังคาร	2	Q1	f
955	2024-01-03	03/01/2024	2024	2567	1	มกราคม	ม.ค.	3	พุธ	3	Q1	f
956	2024-01-04	04/01/2024	2024	2567	1	มกราคม	ม.ค.	4	พฤหัสบดี	4	Q1	f
957	2024-01-05	05/01/2024	2024	2567	1	มกราคม	ม.ค.	5	ศุกร์	5	Q1	f
958	2024-01-06	06/01/2024	2024	2567	1	มกราคม	ม.ค.	6	เสาร์	6	Q1	t
959	2024-01-07	07/01/2024	2024	2567	1	มกราคม	ม.ค.	7	อาทิตย์	7	Q1	t
960	2024-01-08	08/01/2024	2024	2567	1	มกราคม	ม.ค.	8	จันทร์	1	Q1	f
961	2024-01-09	09/01/2024	2024	2567	1	มกราคม	ม.ค.	9	อังคาร	2	Q1	f
962	2024-01-10	10/01/2024	2024	2567	1	มกราคม	ม.ค.	10	พุธ	3	Q1	f
963	2024-01-11	11/01/2024	2024	2567	1	มกราคม	ม.ค.	11	พฤหัสบดี	4	Q1	f
964	2024-01-12	12/01/2024	2024	2567	1	มกราคม	ม.ค.	12	ศุกร์	5	Q1	f
965	2024-01-13	13/01/2024	2024	2567	1	มกราคม	ม.ค.	13	เสาร์	6	Q1	t
966	2024-01-14	14/01/2024	2024	2567	1	มกราคม	ม.ค.	14	อาทิตย์	7	Q1	t
967	2024-01-15	15/01/2024	2024	2567	1	มกราคม	ม.ค.	15	จันทร์	1	Q1	f
968	2024-01-16	16/01/2024	2024	2567	1	มกราคม	ม.ค.	16	อังคาร	2	Q1	f
969	2024-01-17	17/01/2024	2024	2567	1	มกราคม	ม.ค.	17	พุธ	3	Q1	f
970	2024-01-18	18/01/2024	2024	2567	1	มกราคม	ม.ค.	18	พฤหัสบดี	4	Q1	f
971	2024-01-19	19/01/2024	2024	2567	1	มกราคม	ม.ค.	19	ศุกร์	5	Q1	f
972	2024-01-20	20/01/2024	2024	2567	1	มกราคม	ม.ค.	20	เสาร์	6	Q1	t
973	2024-01-21	21/01/2024	2024	2567	1	มกราคม	ม.ค.	21	อาทิตย์	7	Q1	t
974	2024-01-22	22/01/2024	2024	2567	1	มกราคม	ม.ค.	22	จันทร์	1	Q1	f
975	2024-01-23	23/01/2024	2024	2567	1	มกราคม	ม.ค.	23	อังคาร	2	Q1	f
976	2024-01-24	24/01/2024	2024	2567	1	มกราคม	ม.ค.	24	พุธ	3	Q1	f
977	2024-01-25	25/01/2024	2024	2567	1	มกราคม	ม.ค.	25	พฤหัสบดี	4	Q1	f
978	2024-01-26	26/01/2024	2024	2567	1	มกราคม	ม.ค.	26	ศุกร์	5	Q1	f
979	2024-01-27	27/01/2024	2024	2567	1	มกราคม	ม.ค.	27	เสาร์	6	Q1	t
980	2024-01-28	28/01/2024	2024	2567	1	มกราคม	ม.ค.	28	อาทิตย์	7	Q1	t
981	2024-01-29	29/01/2024	2024	2567	1	มกราคม	ม.ค.	29	จันทร์	1	Q1	f
982	2024-01-30	30/01/2024	2024	2567	1	มกราคม	ม.ค.	30	อังคาร	2	Q1	f
983	2024-01-31	31/01/2024	2024	2567	1	มกราคม	ม.ค.	31	พุธ	3	Q1	f
984	2024-02-01	01/02/2024	2024	2567	2	กุมภาพันธ์	ก.พ.	1	พฤหัสบดี	4	Q1	f
985	2024-02-02	02/02/2024	2024	2567	2	กุมภาพันธ์	ก.พ.	2	ศุกร์	5	Q1	f
986	2024-02-03	03/02/2024	2024	2567	2	กุมภาพันธ์	ก.พ.	3	เสาร์	6	Q1	t
987	2024-02-04	04/02/2024	2024	2567	2	กุมภาพันธ์	ก.พ.	4	อาทิตย์	7	Q1	t
988	2024-02-05	05/02/2024	2024	2567	2	กุมภาพันธ์	ก.พ.	5	จันทร์	1	Q1	f
989	2024-02-06	06/02/2024	2024	2567	2	กุมภาพันธ์	ก.พ.	6	อังคาร	2	Q1	f
990	2024-02-07	07/02/2024	2024	2567	2	กุมภาพันธ์	ก.พ.	7	พุธ	3	Q1	f
991	2024-02-08	08/02/2024	2024	2567	2	กุมภาพันธ์	ก.พ.	8	พฤหัสบดี	4	Q1	f
992	2024-02-09	09/02/2024	2024	2567	2	กุมภาพันธ์	ก.พ.	9	ศุกร์	5	Q1	f
993	2024-02-10	10/02/2024	2024	2567	2	กุมภาพันธ์	ก.พ.	10	เสาร์	6	Q1	t
994	2024-02-11	11/02/2024	2024	2567	2	กุมภาพันธ์	ก.พ.	11	อาทิตย์	7	Q1	t
995	2024-02-12	12/02/2024	2024	2567	2	กุมภาพันธ์	ก.พ.	12	จันทร์	1	Q1	f
996	2024-02-13	13/02/2024	2024	2567	2	กุมภาพันธ์	ก.พ.	13	อังคาร	2	Q1	f
997	2024-02-14	14/02/2024	2024	2567	2	กุมภาพันธ์	ก.พ.	14	พุธ	3	Q1	f
998	2024-02-15	15/02/2024	2024	2567	2	กุมภาพันธ์	ก.พ.	15	พฤหัสบดี	4	Q1	f
999	2024-02-16	16/02/2024	2024	2567	2	กุมภาพันธ์	ก.พ.	16	ศุกร์	5	Q1	f
1000	2024-02-17	17/02/2024	2024	2567	2	กุมภาพันธ์	ก.พ.	17	เสาร์	6	Q1	t
1001	2024-02-18	18/02/2024	2024	2567	2	กุมภาพันธ์	ก.พ.	18	อาทิตย์	7	Q1	t
1002	2024-02-19	19/02/2024	2024	2567	2	กุมภาพันธ์	ก.พ.	19	จันทร์	1	Q1	f
1003	2024-02-20	20/02/2024	2024	2567	2	กุมภาพันธ์	ก.พ.	20	อังคาร	2	Q1	f
1004	2024-02-21	21/02/2024	2024	2567	2	กุมภาพันธ์	ก.พ.	21	พุธ	3	Q1	f
1005	2024-02-22	22/02/2024	2024	2567	2	กุมภาพันธ์	ก.พ.	22	พฤหัสบดี	4	Q1	f
1006	2024-02-23	23/02/2024	2024	2567	2	กุมภาพันธ์	ก.พ.	23	ศุกร์	5	Q1	f
1007	2024-02-24	24/02/2024	2024	2567	2	กุมภาพันธ์	ก.พ.	24	เสาร์	6	Q1	t
1008	2024-02-25	25/02/2024	2024	2567	2	กุมภาพันธ์	ก.พ.	25	อาทิตย์	7	Q1	t
1009	2024-02-26	26/02/2024	2024	2567	2	กุมภาพันธ์	ก.พ.	26	จันทร์	1	Q1	f
1010	2024-02-27	27/02/2024	2024	2567	2	กุมภาพันธ์	ก.พ.	27	อังคาร	2	Q1	f
1011	2024-02-28	28/02/2024	2024	2567	2	กุมภาพันธ์	ก.พ.	28	พุธ	3	Q1	f
1012	2024-02-29	29/02/2024	2024	2567	2	กุมภาพันธ์	ก.พ.	29	พฤหัสบดี	4	Q1	f
1013	2024-03-01	01/03/2024	2024	2567	3	มีนาคม	มี.ค.	1	ศุกร์	5	Q1	f
1014	2024-03-02	02/03/2024	2024	2567	3	มีนาคม	มี.ค.	2	เสาร์	6	Q1	t
1015	2024-03-03	03/03/2024	2024	2567	3	มีนาคม	มี.ค.	3	อาทิตย์	7	Q1	t
1016	2024-03-04	04/03/2024	2024	2567	3	มีนาคม	มี.ค.	4	จันทร์	1	Q1	f
1017	2024-03-05	05/03/2024	2024	2567	3	มีนาคม	มี.ค.	5	อังคาร	2	Q1	f
1018	2024-03-06	06/03/2024	2024	2567	3	มีนาคม	มี.ค.	6	พุธ	3	Q1	f
1019	2024-03-07	07/03/2024	2024	2567	3	มีนาคม	มี.ค.	7	พฤหัสบดี	4	Q1	f
1020	2024-03-08	08/03/2024	2024	2567	3	มีนาคม	มี.ค.	8	ศุกร์	5	Q1	f
1021	2024-03-09	09/03/2024	2024	2567	3	มีนาคม	มี.ค.	9	เสาร์	6	Q1	t
1022	2024-03-10	10/03/2024	2024	2567	3	มีนาคม	มี.ค.	10	อาทิตย์	7	Q1	t
1023	2024-03-11	11/03/2024	2024	2567	3	มีนาคม	มี.ค.	11	จันทร์	1	Q1	f
1024	2024-03-12	12/03/2024	2024	2567	3	มีนาคม	มี.ค.	12	อังคาร	2	Q1	f
1025	2024-03-13	13/03/2024	2024	2567	3	มีนาคม	มี.ค.	13	พุธ	3	Q1	f
1026	2024-03-14	14/03/2024	2024	2567	3	มีนาคม	มี.ค.	14	พฤหัสบดี	4	Q1	f
1027	2024-03-15	15/03/2024	2024	2567	3	มีนาคม	มี.ค.	15	ศุกร์	5	Q1	f
1028	2024-03-16	16/03/2024	2024	2567	3	มีนาคม	มี.ค.	16	เสาร์	6	Q1	t
1029	2024-03-17	17/03/2024	2024	2567	3	มีนาคม	มี.ค.	17	อาทิตย์	7	Q1	t
1030	2024-03-18	18/03/2024	2024	2567	3	มีนาคม	มี.ค.	18	จันทร์	1	Q1	f
1031	2024-03-19	19/03/2024	2024	2567	3	มีนาคม	มี.ค.	19	อังคาร	2	Q1	f
1032	2024-03-20	20/03/2024	2024	2567	3	มีนาคม	มี.ค.	20	พุธ	3	Q1	f
1033	2024-03-21	21/03/2024	2024	2567	3	มีนาคม	มี.ค.	21	พฤหัสบดี	4	Q1	f
1034	2024-03-22	22/03/2024	2024	2567	3	มีนาคม	มี.ค.	22	ศุกร์	5	Q1	f
1035	2024-03-23	23/03/2024	2024	2567	3	มีนาคม	มี.ค.	23	เสาร์	6	Q1	t
1036	2024-03-24	24/03/2024	2024	2567	3	มีนาคม	มี.ค.	24	อาทิตย์	7	Q1	t
1037	2024-03-25	25/03/2024	2024	2567	3	มีนาคม	มี.ค.	25	จันทร์	1	Q1	f
1038	2024-03-26	26/03/2024	2024	2567	3	มีนาคม	มี.ค.	26	อังคาร	2	Q1	f
1039	2024-03-27	27/03/2024	2024	2567	3	มีนาคม	มี.ค.	27	พุธ	3	Q1	f
1040	2024-03-28	28/03/2024	2024	2567	3	มีนาคม	มี.ค.	28	พฤหัสบดี	4	Q1	f
1041	2024-03-29	29/03/2024	2024	2567	3	มีนาคม	มี.ค.	29	ศุกร์	5	Q1	f
1042	2024-03-30	30/03/2024	2024	2567	3	มีนาคม	มี.ค.	30	เสาร์	6	Q1	t
1043	2024-03-31	31/03/2024	2024	2567	3	มีนาคม	มี.ค.	31	อาทิตย์	7	Q1	t
1044	2024-04-01	01/04/2024	2024	2567	4	เมษายน	เม.ย.	1	จันทร์	1	Q2	f
1045	2024-04-02	02/04/2024	2024	2567	4	เมษายน	เม.ย.	2	อังคาร	2	Q2	f
1046	2024-04-03	03/04/2024	2024	2567	4	เมษายน	เม.ย.	3	พุธ	3	Q2	f
1047	2024-04-04	04/04/2024	2024	2567	4	เมษายน	เม.ย.	4	พฤหัสบดี	4	Q2	f
1048	2024-04-05	05/04/2024	2024	2567	4	เมษายน	เม.ย.	5	ศุกร์	5	Q2	f
1049	2024-04-06	06/04/2024	2024	2567	4	เมษายน	เม.ย.	6	เสาร์	6	Q2	t
1050	2024-04-07	07/04/2024	2024	2567	4	เมษายน	เม.ย.	7	อาทิตย์	7	Q2	t
1051	2024-04-08	08/04/2024	2024	2567	4	เมษายน	เม.ย.	8	จันทร์	1	Q2	f
1052	2024-04-09	09/04/2024	2024	2567	4	เมษายน	เม.ย.	9	อังคาร	2	Q2	f
1053	2024-04-10	10/04/2024	2024	2567	4	เมษายน	เม.ย.	10	พุธ	3	Q2	f
1054	2024-04-11	11/04/2024	2024	2567	4	เมษายน	เม.ย.	11	พฤหัสบดี	4	Q2	f
1055	2024-04-12	12/04/2024	2024	2567	4	เมษายน	เม.ย.	12	ศุกร์	5	Q2	f
1056	2024-04-13	13/04/2024	2024	2567	4	เมษายน	เม.ย.	13	เสาร์	6	Q2	t
1057	2024-04-14	14/04/2024	2024	2567	4	เมษายน	เม.ย.	14	อาทิตย์	7	Q2	t
1058	2024-04-15	15/04/2024	2024	2567	4	เมษายน	เม.ย.	15	จันทร์	1	Q2	f
1059	2024-04-16	16/04/2024	2024	2567	4	เมษายน	เม.ย.	16	อังคาร	2	Q2	f
1060	2024-04-17	17/04/2024	2024	2567	4	เมษายน	เม.ย.	17	พุธ	3	Q2	f
1061	2024-04-18	18/04/2024	2024	2567	4	เมษายน	เม.ย.	18	พฤหัสบดี	4	Q2	f
1062	2024-04-19	19/04/2024	2024	2567	4	เมษายน	เม.ย.	19	ศุกร์	5	Q2	f
1063	2024-04-20	20/04/2024	2024	2567	4	เมษายน	เม.ย.	20	เสาร์	6	Q2	t
1064	2024-04-21	21/04/2024	2024	2567	4	เมษายน	เม.ย.	21	อาทิตย์	7	Q2	t
1065	2024-04-22	22/04/2024	2024	2567	4	เมษายน	เม.ย.	22	จันทร์	1	Q2	f
1066	2024-04-23	23/04/2024	2024	2567	4	เมษายน	เม.ย.	23	อังคาร	2	Q2	f
1067	2024-04-24	24/04/2024	2024	2567	4	เมษายน	เม.ย.	24	พุธ	3	Q2	f
1068	2024-04-25	25/04/2024	2024	2567	4	เมษายน	เม.ย.	25	พฤหัสบดี	4	Q2	f
1069	2024-04-26	26/04/2024	2024	2567	4	เมษายน	เม.ย.	26	ศุกร์	5	Q2	f
1070	2024-04-27	27/04/2024	2024	2567	4	เมษายน	เม.ย.	27	เสาร์	6	Q2	t
1071	2024-04-28	28/04/2024	2024	2567	4	เมษายน	เม.ย.	28	อาทิตย์	7	Q2	t
1072	2024-04-29	29/04/2024	2024	2567	4	เมษายน	เม.ย.	29	จันทร์	1	Q2	f
1073	2024-04-30	30/04/2024	2024	2567	4	เมษายน	เม.ย.	30	อังคาร	2	Q2	f
1074	2024-05-01	01/05/2024	2024	2567	5	พฤษภาคม	พ.ค.	1	พุธ	3	Q2	f
1075	2024-05-02	02/05/2024	2024	2567	5	พฤษภาคม	พ.ค.	2	พฤหัสบดี	4	Q2	f
1094	2024-05-21	21/05/2024	2024	2567	5	พฤษภาคม	พ.ค.	21	อังคาร	2	Q2	f
1095	2024-05-22	22/05/2024	2024	2567	5	พฤษภาคม	พ.ค.	22	พุธ	3	Q2	f
1096	2024-05-23	23/05/2024	2024	2567	5	พฤษภาคม	พ.ค.	23	พฤหัสบดี	4	Q2	f
1097	2024-05-24	24/05/2024	2024	2567	5	พฤษภาคม	พ.ค.	24	ศุกร์	5	Q2	f
1098	2024-05-25	25/05/2024	2024	2567	5	พฤษภาคม	พ.ค.	25	เสาร์	6	Q2	t
1099	2024-05-26	26/05/2024	2024	2567	5	พฤษภาคม	พ.ค.	26	อาทิตย์	7	Q2	t
4207	2024-07-30	30/07/2024	2024	2567	7	กรกฎาคม	ก.ค.	30	อังคาร	2	Q3	f
4208	2024-07-31	31/07/2024	2024	2567	7	กรกฎาคม	ก.ค.	31	พุธ	3	Q3	f
4209	2024-08-01	01/08/2024	2024	2567	8	สิงหาคม	ส.ค.	1	พฤหัสบดี	4	Q3	f
4210	2024-08-02	02/08/2024	2024	2567	8	สิงหาคม	ส.ค.	2	ศุกร์	5	Q3	f
4211	2024-08-03	03/08/2024	2024	2567	8	สิงหาคม	ส.ค.	3	เสาร์	6	Q3	t
4212	2024-08-04	04/08/2024	2024	2567	8	สิงหาคม	ส.ค.	4	อาทิตย์	7	Q3	t
4213	2024-08-05	05/08/2024	2024	2567	8	สิงหาคม	ส.ค.	5	จันทร์	1	Q3	f
4214	2024-08-06	06/08/2024	2024	2567	8	สิงหาคม	ส.ค.	6	อังคาร	2	Q3	f
4215	2024-08-07	07/08/2024	2024	2567	8	สิงหาคม	ส.ค.	7	พุธ	3	Q3	f
4216	2024-08-08	08/08/2024	2024	2567	8	สิงหาคม	ส.ค.	8	พฤหัสบดี	4	Q3	f
4217	2024-08-09	09/08/2024	2024	2567	8	สิงหาคม	ส.ค.	9	ศุกร์	5	Q3	f
4218	2024-08-10	10/08/2024	2024	2567	8	สิงหาคม	ส.ค.	10	เสาร์	6	Q3	t
4219	2024-08-11	11/08/2024	2024	2567	8	สิงหาคม	ส.ค.	11	อาทิตย์	7	Q3	t
4220	2024-08-12	12/08/2024	2024	2567	8	สิงหาคม	ส.ค.	12	จันทร์	1	Q3	f
4222	2024-08-14	14/08/2024	2024	2567	8	สิงหาคม	ส.ค.	14	พุธ	3	Q3	f
4492	2025-05-11	11/05/2025	2025	2568	5	พฤษภาคม	พ.ค.	11	อาทิตย์	7	Q2	t
4493	2025-05-12	12/05/2025	2025	2568	5	พฤษภาคม	พ.ค.	12	จันทร์	1	Q2	f
4494	2025-05-13	13/05/2025	2025	2568	5	พฤษภาคม	พ.ค.	13	อังคาร	2	Q2	f
4495	2025-05-14	14/05/2025	2025	2568	5	พฤษภาคม	พ.ค.	14	พุธ	3	Q2	f
4496	2025-05-15	15/05/2025	2025	2568	5	พฤษภาคม	พ.ค.	15	พฤหัสบดี	4	Q2	f
4497	2025-05-16	16/05/2025	2025	2568	5	พฤษภาคม	พ.ค.	16	ศุกร์	5	Q2	f
4498	2025-05-17	17/05/2025	2025	2568	5	พฤษภาคม	พ.ค.	17	เสาร์	6	Q2	t
4518	2025-06-06	06/06/2025	2025	2568	6	มิถุนายน	มิ.ย.	6	ศุกร์	5	Q2	f
4519	2025-06-07	07/06/2025	2025	2568	6	มิถุนายน	มิ.ย.	7	เสาร์	6	Q2	t
4520	2025-06-08	08/06/2025	2025	2568	6	มิถุนายน	มิ.ย.	8	อาทิตย์	7	Q2	t
4482	2025-05-01	01/05/2025	2025	2568	5	พฤษภาคม	พ.ค.	1	พฤหัสบดี	4	Q2	f
4483	2025-05-02	02/05/2025	2025	2568	5	พฤษภาคม	พ.ค.	2	ศุกร์	5	Q2	f
4484	2025-05-03	03/05/2025	2025	2568	5	พฤษภาคม	พ.ค.	3	เสาร์	6	Q2	t
4485	2025-05-04	04/05/2025	2025	2568	5	พฤษภาคม	พ.ค.	4	อาทิตย์	7	Q2	t
4486	2025-05-05	05/05/2025	2025	2568	5	พฤษภาคม	พ.ค.	5	จันทร์	1	Q2	f
4487	2025-05-06	06/05/2025	2025	2568	5	พฤษภาคม	พ.ค.	6	อังคาร	2	Q2	f
4488	2025-05-07	07/05/2025	2025	2568	5	พฤษภาคม	พ.ค.	7	พุธ	3	Q2	f
1100	2024-05-27	27/05/2024	2024	2567	5	พฤษภาคม	พ.ค.	27	จันทร์	1	Q2	f
1101	2024-05-28	28/05/2024	2024	2567	5	พฤษภาคม	พ.ค.	28	อังคาร	2	Q2	f
1102	2024-05-29	29/05/2024	2024	2567	5	พฤษภาคม	พ.ค.	29	พุธ	3	Q2	f
1103	2024-05-30	30/05/2024	2024	2567	5	พฤษภาคม	พ.ค.	30	พฤหัสบดี	4	Q2	f
1104	2024-05-31	31/05/2024	2024	2567	5	พฤษภาคม	พ.ค.	31	ศุกร์	5	Q2	f
1105	2024-06-01	01/06/2024	2024	2567	6	มิถุนายน	มิ.ย.	1	เสาร์	6	Q2	t
1106	2024-06-02	02/06/2024	2024	2567	6	มิถุนายน	มิ.ย.	2	อาทิตย์	7	Q2	t
1107	2024-06-03	03/06/2024	2024	2567	6	มิถุนายน	มิ.ย.	3	จันทร์	1	Q2	f
1108	2024-06-04	04/06/2024	2024	2567	6	มิถุนายน	มิ.ย.	4	อังคาร	2	Q2	f
1109	2024-06-05	05/06/2024	2024	2567	6	มิถุนายน	มิ.ย.	5	พุธ	3	Q2	f
1110	2024-06-06	06/06/2024	2024	2567	6	มิถุนายน	มิ.ย.	6	พฤหัสบดี	4	Q2	f
1111	2024-06-07	07/06/2024	2024	2567	6	มิถุนายน	มิ.ย.	7	ศุกร์	5	Q2	f
1112	2024-06-08	08/06/2024	2024	2567	6	มิถุนายน	มิ.ย.	8	เสาร์	6	Q2	t
4477	2025-04-26	26/04/2025	2025	2568	4	เมษายน	เม.ย.	26	เสาร์	6	Q2	t
4478	2025-04-27	27/04/2025	2025	2568	4	เมษายน	เม.ย.	27	อาทิตย์	7	Q2	t
4479	2025-04-28	28/04/2025	2025	2568	4	เมษายน	เม.ย.	28	จันทร์	1	Q2	f
4480	2025-04-29	29/04/2025	2025	2568	4	เมษายน	เม.ย.	29	อังคาร	2	Q2	f
4481	2025-04-30	30/04/2025	2025	2568	4	เมษายน	เม.ย.	30	พุธ	3	Q2	f
4805	2024-06-09	09/06/2024	2024	2567	6	มิถุนายน	มิ.ย.	9	อาทิตย์	7	Q2	t
4806	2024-06-10	10/06/2024	2024	2567	6	มิถุนายน	มิ.ย.	10	จันทร์	1	Q2	f
4807	2024-06-11	11/06/2024	2024	2567	6	มิถุนายน	มิ.ย.	11	อังคาร	2	Q2	f
4808	2024-06-12	12/06/2024	2024	2567	6	มิถุนายน	มิ.ย.	12	พุธ	3	Q2	f
4809	2024-06-13	13/06/2024	2024	2567	6	มิถุนายน	มิ.ย.	13	พฤหัสบดี	4	Q2	f
4810	2024-06-14	14/06/2024	2024	2567	6	มิถุนายน	มิ.ย.	14	ศุกร์	5	Q2	f
4811	2024-06-15	15/06/2024	2024	2567	6	มิถุนายน	มิ.ย.	15	เสาร์	6	Q2	t
4812	2024-06-16	16/06/2024	2024	2567	6	มิถุนายน	มิ.ย.	16	อาทิตย์	7	Q2	t
4813	2024-06-17	17/06/2024	2024	2567	6	มิถุนายน	มิ.ย.	17	จันทร์	1	Q2	f
4814	2024-06-18	18/06/2024	2024	2567	6	มิถุนายน	มิ.ย.	18	อังคาร	2	Q2	f
4815	2024-06-19	19/06/2024	2024	2567	6	มิถุนายน	มิ.ย.	19	พุธ	3	Q2	f
4816	2024-06-20	20/06/2024	2024	2567	6	มิถุนายน	มิ.ย.	20	พฤหัสบดี	4	Q2	f
4817	2024-06-21	21/06/2024	2024	2567	6	มิถุนายน	มิ.ย.	21	ศุกร์	5	Q2	f
4818	2024-06-22	22/06/2024	2024	2567	6	มิถุนายน	มิ.ย.	22	เสาร์	6	Q2	t
4819	2024-06-23	23/06/2024	2024	2567	6	มิถุนายน	มิ.ย.	23	อาทิตย์	7	Q2	t
4171	2024-06-24	24/06/2024	2024	2567	6	มิถุนายน	มิ.ย.	24	จันทร์	1	Q2	f
4172	2024-06-25	25/06/2024	2024	2567	6	มิถุนายน	มิ.ย.	25	อังคาร	2	Q2	f
4173	2024-06-26	26/06/2024	2024	2567	6	มิถุนายน	มิ.ย.	26	พุธ	3	Q2	f
4174	2024-06-27	27/06/2024	2024	2567	6	มิถุนายน	มิ.ย.	27	พฤหัสบดี	4	Q2	f
4175	2024-06-28	28/06/2024	2024	2567	6	มิถุนายน	มิ.ย.	28	ศุกร์	5	Q2	f
4176	2024-06-29	29/06/2024	2024	2567	6	มิถุนายน	มิ.ย.	29	เสาร์	6	Q2	t
4177	2024-06-30	30/06/2024	2024	2567	6	มิถุนายน	มิ.ย.	30	อาทิตย์	7	Q2	t
4178	2024-07-01	01/07/2024	2024	2567	7	กรกฎาคม	ก.ค.	1	จันทร์	1	Q3	f
4179	2024-07-02	02/07/2024	2024	2567	7	กรกฎาคม	ก.ค.	2	อังคาร	2	Q3	f
4180	2024-07-03	03/07/2024	2024	2567	7	กรกฎาคม	ก.ค.	3	พุธ	3	Q3	f
4181	2024-07-04	04/07/2024	2024	2567	7	กรกฎาคม	ก.ค.	4	พฤหัสบดี	4	Q3	f
4182	2024-07-05	05/07/2024	2024	2567	7	กรกฎาคม	ก.ค.	5	ศุกร์	5	Q3	f
4183	2024-07-06	06/07/2024	2024	2567	7	กรกฎาคม	ก.ค.	6	เสาร์	6	Q3	t
4184	2024-07-07	07/07/2024	2024	2567	7	กรกฎาคม	ก.ค.	7	อาทิตย์	7	Q3	t
4205	2024-07-28	28/07/2024	2024	2567	7	กรกฎาคม	ก.ค.	28	อาทิตย์	7	Q3	t
4206	2024-07-29	29/07/2024	2024	2567	7	กรกฎาคม	ก.ค.	29	จันทร์	1	Q3	f
4221	2024-08-13	13/08/2024	2024	2567	8	สิงหาคม	ส.ค.	13	อังคาร	2	Q3	f
4223	2024-08-15	15/08/2024	2024	2567	8	สิงหาคม	ส.ค.	15	พฤหัสบดี	4	Q3	f
4224	2024-08-16	16/08/2024	2024	2567	8	สิงหาคม	ส.ค.	16	ศุกร์	5	Q3	f
4225	2024-08-17	17/08/2024	2024	2567	8	สิงหาคม	ส.ค.	17	เสาร์	6	Q3	t
4226	2024-08-18	18/08/2024	2024	2567	8	สิงหาคม	ส.ค.	18	อาทิตย์	7	Q3	t
4185	2024-07-08	08/07/2024	2024	2567	7	กรกฎาคม	ก.ค.	8	จันทร์	1	Q3	f
4186	2024-07-09	09/07/2024	2024	2567	7	กรกฎาคม	ก.ค.	9	อังคาร	2	Q3	f
4187	2024-07-10	10/07/2024	2024	2567	7	กรกฎาคม	ก.ค.	10	พุธ	3	Q3	f
4188	2024-07-11	11/07/2024	2024	2567	7	กรกฎาคม	ก.ค.	11	พฤหัสบดี	4	Q3	f
4189	2024-07-12	12/07/2024	2024	2567	7	กรกฎาคม	ก.ค.	12	ศุกร์	5	Q3	f
4190	2024-07-13	13/07/2024	2024	2567	7	กรกฎาคม	ก.ค.	13	เสาร์	6	Q3	t
4191	2024-07-14	14/07/2024	2024	2567	7	กรกฎาคม	ก.ค.	14	อาทิตย์	7	Q3	t
4192	2024-07-15	15/07/2024	2024	2567	7	กรกฎาคม	ก.ค.	15	จันทร์	1	Q3	f
4193	2024-07-16	16/07/2024	2024	2567	7	กรกฎาคม	ก.ค.	16	อังคาร	2	Q3	f
4194	2024-07-17	17/07/2024	2024	2567	7	กรกฎาคม	ก.ค.	17	พุธ	3	Q3	f
4195	2024-07-18	18/07/2024	2024	2567	7	กรกฎาคม	ก.ค.	18	พฤหัสบดี	4	Q3	f
4196	2024-07-19	19/07/2024	2024	2567	7	กรกฎาคม	ก.ค.	19	ศุกร์	5	Q3	f
4197	2024-07-20	20/07/2024	2024	2567	7	กรกฎาคม	ก.ค.	20	เสาร์	6	Q3	t
4198	2024-07-21	21/07/2024	2024	2567	7	กรกฎาคม	ก.ค.	21	อาทิตย์	7	Q3	t
4199	2024-07-22	22/07/2024	2024	2567	7	กรกฎาคม	ก.ค.	22	จันทร์	1	Q3	f
4200	2024-07-23	23/07/2024	2024	2567	7	กรกฎาคม	ก.ค.	23	อังคาร	2	Q3	f
4201	2024-07-24	24/07/2024	2024	2567	7	กรกฎาคม	ก.ค.	24	พุธ	3	Q3	f
4202	2024-07-25	25/07/2024	2024	2567	7	กรกฎาคม	ก.ค.	25	พฤหัสบดี	4	Q3	f
4203	2024-07-26	26/07/2024	2024	2567	7	กรกฎาคม	ก.ค.	26	ศุกร์	5	Q3	f
4204	2024-07-27	27/07/2024	2024	2567	7	กรกฎาคม	ก.ค.	27	เสาร์	6	Q3	t
4227	2024-08-19	19/08/2024	2024	2567	8	สิงหาคม	ส.ค.	19	จันทร์	1	Q3	f
4228	2024-08-20	20/08/2024	2024	2567	8	สิงหาคม	ส.ค.	20	อังคาร	2	Q3	f
4229	2024-08-21	21/08/2024	2024	2567	8	สิงหาคม	ส.ค.	21	พุธ	3	Q3	f
4230	2024-08-22	22/08/2024	2024	2567	8	สิงหาคม	ส.ค.	22	พฤหัสบดี	4	Q3	f
4231	2024-08-23	23/08/2024	2024	2567	8	สิงหาคม	ส.ค.	23	ศุกร์	5	Q3	f
4232	2024-08-24	24/08/2024	2024	2567	8	สิงหาคม	ส.ค.	24	เสาร์	6	Q3	t
4233	2024-08-25	25/08/2024	2024	2567	8	สิงหาคม	ส.ค.	25	อาทิตย์	7	Q3	t
4234	2024-08-26	26/08/2024	2024	2567	8	สิงหาคม	ส.ค.	26	จันทร์	1	Q3	f
4235	2024-08-27	27/08/2024	2024	2567	8	สิงหาคม	ส.ค.	27	อังคาร	2	Q3	f
4236	2024-08-28	28/08/2024	2024	2567	8	สิงหาคม	ส.ค.	28	พุธ	3	Q3	f
4237	2024-08-29	29/08/2024	2024	2567	8	สิงหาคม	ส.ค.	29	พฤหัสบดี	4	Q3	f
4238	2024-08-30	30/08/2024	2024	2567	8	สิงหาคม	ส.ค.	30	ศุกร์	5	Q3	f
4239	2024-08-31	31/08/2024	2024	2567	8	สิงหาคม	ส.ค.	31	เสาร์	6	Q3	t
4240	2024-09-01	01/09/2024	2024	2567	9	กันยายน	ก.ย.	1	อาทิตย์	7	Q3	t
4241	2024-09-02	02/09/2024	2024	2567	9	กันยายน	ก.ย.	2	จันทร์	1	Q3	f
4242	2024-09-03	03/09/2024	2024	2567	9	กันยายน	ก.ย.	3	อังคาร	2	Q3	f
4243	2024-09-04	04/09/2024	2024	2567	9	กันยายน	ก.ย.	4	พุธ	3	Q3	f
4244	2024-09-05	05/09/2024	2024	2567	9	กันยายน	ก.ย.	5	พฤหัสบดี	4	Q3	f
4245	2024-09-06	06/09/2024	2024	2567	9	กันยายน	ก.ย.	6	ศุกร์	5	Q3	f
4246	2024-09-07	07/09/2024	2024	2567	9	กันยายน	ก.ย.	7	เสาร์	6	Q3	t
4247	2024-09-08	08/09/2024	2024	2567	9	กันยายน	ก.ย.	8	อาทิตย์	7	Q3	t
4248	2024-09-09	09/09/2024	2024	2567	9	กันยายน	ก.ย.	9	จันทร์	1	Q3	f
4249	2024-09-10	10/09/2024	2024	2567	9	กันยายน	ก.ย.	10	อังคาร	2	Q3	f
4250	2024-09-11	11/09/2024	2024	2567	9	กันยายน	ก.ย.	11	พุธ	3	Q3	f
4251	2024-09-12	12/09/2024	2024	2567	9	กันยายน	ก.ย.	12	พฤหัสบดี	4	Q3	f
4252	2024-09-13	13/09/2024	2024	2567	9	กันยายน	ก.ย.	13	ศุกร์	5	Q3	f
4253	2024-09-14	14/09/2024	2024	2567	9	กันยายน	ก.ย.	14	เสาร์	6	Q3	t
4254	2024-09-15	15/09/2024	2024	2567	9	กันยายน	ก.ย.	15	อาทิตย์	7	Q3	t
4255	2024-09-16	16/09/2024	2024	2567	9	กันยายน	ก.ย.	16	จันทร์	1	Q3	f
4256	2024-09-17	17/09/2024	2024	2567	9	กันยายน	ก.ย.	17	อังคาร	2	Q3	f
4257	2024-09-18	18/09/2024	2024	2567	9	กันยายน	ก.ย.	18	พุธ	3	Q3	f
4258	2024-09-19	19/09/2024	2024	2567	9	กันยายน	ก.ย.	19	พฤหัสบดี	4	Q3	f
4259	2024-09-20	20/09/2024	2024	2567	9	กันยายน	ก.ย.	20	ศุกร์	5	Q3	f
4260	2024-09-21	21/09/2024	2024	2567	9	กันยายน	ก.ย.	21	เสาร์	6	Q3	t
4261	2024-09-22	22/09/2024	2024	2567	9	กันยายน	ก.ย.	22	อาทิตย์	7	Q3	t
4262	2024-09-23	23/09/2024	2024	2567	9	กันยายน	ก.ย.	23	จันทร์	1	Q3	f
4263	2024-09-24	24/09/2024	2024	2567	9	กันยายน	ก.ย.	24	อังคาร	2	Q3	f
4350	2024-12-20	20/12/2024	2024	2567	12	ธันวาคม	ธ.ค.	20	ศุกร์	5	Q4	f
4264	2024-09-25	25/09/2024	2024	2567	9	กันยายน	ก.ย.	25	พุธ	3	Q3	f
4265	2024-09-26	26/09/2024	2024	2567	9	กันยายน	ก.ย.	26	พฤหัสบดี	4	Q3	f
4266	2024-09-27	27/09/2024	2024	2567	9	กันยายน	ก.ย.	27	ศุกร์	5	Q3	f
4267	2024-09-28	28/09/2024	2024	2567	9	กันยายน	ก.ย.	28	เสาร์	6	Q3	t
4268	2024-09-29	29/09/2024	2024	2567	9	กันยายน	ก.ย.	29	อาทิตย์	7	Q3	t
4269	2024-09-30	30/09/2024	2024	2567	9	กันยายน	ก.ย.	30	จันทร์	1	Q3	f
4270	2024-10-01	01/10/2024	2024	2567	10	ตุลาคม	ต.ค.	1	อังคาร	2	Q4	f
4271	2024-10-02	02/10/2024	2024	2567	10	ตุลาคม	ต.ค.	2	พุธ	3	Q4	f
4272	2024-10-03	03/10/2024	2024	2567	10	ตุลาคม	ต.ค.	3	พฤหัสบดี	4	Q4	f
4273	2024-10-04	04/10/2024	2024	2567	10	ตุลาคม	ต.ค.	4	ศุกร์	5	Q4	f
4274	2024-10-05	05/10/2024	2024	2567	10	ตุลาคม	ต.ค.	5	เสาร์	6	Q4	t
4275	2024-10-06	06/10/2024	2024	2567	10	ตุลาคม	ต.ค.	6	อาทิตย์	7	Q4	t
4276	2024-10-07	07/10/2024	2024	2567	10	ตุลาคม	ต.ค.	7	จันทร์	1	Q4	f
4277	2024-10-08	08/10/2024	2024	2567	10	ตุลาคม	ต.ค.	8	อังคาร	2	Q4	f
4278	2024-10-09	09/10/2024	2024	2567	10	ตุลาคม	ต.ค.	9	พุธ	3	Q4	f
4279	2024-10-10	10/10/2024	2024	2567	10	ตุลาคม	ต.ค.	10	พฤหัสบดี	4	Q4	f
4280	2024-10-11	11/10/2024	2024	2567	10	ตุลาคม	ต.ค.	11	ศุกร์	5	Q4	f
4281	2024-10-12	12/10/2024	2024	2567	10	ตุลาคม	ต.ค.	12	เสาร์	6	Q4	t
4282	2024-10-13	13/10/2024	2024	2567	10	ตุลาคม	ต.ค.	13	อาทิตย์	7	Q4	t
4283	2024-10-14	14/10/2024	2024	2567	10	ตุลาคม	ต.ค.	14	จันทร์	1	Q4	f
4284	2024-10-15	15/10/2024	2024	2567	10	ตุลาคม	ต.ค.	15	อังคาร	2	Q4	f
4285	2024-10-16	16/10/2024	2024	2567	10	ตุลาคม	ต.ค.	16	พุธ	3	Q4	f
4286	2024-10-17	17/10/2024	2024	2567	10	ตุลาคม	ต.ค.	17	พฤหัสบดี	4	Q4	f
4287	2024-10-18	18/10/2024	2024	2567	10	ตุลาคม	ต.ค.	18	ศุกร์	5	Q4	f
4288	2024-10-19	19/10/2024	2024	2567	10	ตุลาคม	ต.ค.	19	เสาร์	6	Q4	t
4289	2024-10-20	20/10/2024	2024	2567	10	ตุลาคม	ต.ค.	20	อาทิตย์	7	Q4	t
4290	2024-10-21	21/10/2024	2024	2567	10	ตุลาคม	ต.ค.	21	จันทร์	1	Q4	f
4291	2024-10-22	22/10/2024	2024	2567	10	ตุลาคม	ต.ค.	22	อังคาร	2	Q4	f
4292	2024-10-23	23/10/2024	2024	2567	10	ตุลาคม	ต.ค.	23	พุธ	3	Q4	f
4293	2024-10-24	24/10/2024	2024	2567	10	ตุลาคม	ต.ค.	24	พฤหัสบดี	4	Q4	f
4294	2024-10-25	25/10/2024	2024	2567	10	ตุลาคม	ต.ค.	25	ศุกร์	5	Q4	f
4295	2024-10-26	26/10/2024	2024	2567	10	ตุลาคม	ต.ค.	26	เสาร์	6	Q4	t
4296	2024-10-27	27/10/2024	2024	2567	10	ตุลาคม	ต.ค.	27	อาทิตย์	7	Q4	t
4297	2024-10-28	28/10/2024	2024	2567	10	ตุลาคม	ต.ค.	28	จันทร์	1	Q4	f
4298	2024-10-29	29/10/2024	2024	2567	10	ตุลาคม	ต.ค.	29	อังคาร	2	Q4	f
4299	2024-10-30	30/10/2024	2024	2567	10	ตุลาคม	ต.ค.	30	พุธ	3	Q4	f
4300	2024-10-31	31/10/2024	2024	2567	10	ตุลาคม	ต.ค.	31	พฤหัสบดี	4	Q4	f
4301	2024-11-01	01/11/2024	2024	2567	11	พฤศจิกายน	พ.ย.	1	ศุกร์	5	Q4	f
4302	2024-11-02	02/11/2024	2024	2567	11	พฤศจิกายน	พ.ย.	2	เสาร์	6	Q4	t
4303	2024-11-03	03/11/2024	2024	2567	11	พฤศจิกายน	พ.ย.	3	อาทิตย์	7	Q4	t
4304	2024-11-04	04/11/2024	2024	2567	11	พฤศจิกายน	พ.ย.	4	จันทร์	1	Q4	f
4305	2024-11-05	05/11/2024	2024	2567	11	พฤศจิกายน	พ.ย.	5	อังคาร	2	Q4	f
4306	2024-11-06	06/11/2024	2024	2567	11	พฤศจิกายน	พ.ย.	6	พุธ	3	Q4	f
4307	2024-11-07	07/11/2024	2024	2567	11	พฤศจิกายน	พ.ย.	7	พฤหัสบดี	4	Q4	f
4308	2024-11-08	08/11/2024	2024	2567	11	พฤศจิกายน	พ.ย.	8	ศุกร์	5	Q4	f
4309	2024-11-09	09/11/2024	2024	2567	11	พฤศจิกายน	พ.ย.	9	เสาร์	6	Q4	t
4310	2024-11-10	10/11/2024	2024	2567	11	พฤศจิกายน	พ.ย.	10	อาทิตย์	7	Q4	t
4311	2024-11-11	11/11/2024	2024	2567	11	พฤศจิกายน	พ.ย.	11	จันทร์	1	Q4	f
4312	2024-11-12	12/11/2024	2024	2567	11	พฤศจิกายน	พ.ย.	12	อังคาร	2	Q4	f
4313	2024-11-13	13/11/2024	2024	2567	11	พฤศจิกายน	พ.ย.	13	พุธ	3	Q4	f
4314	2024-11-14	14/11/2024	2024	2567	11	พฤศจิกายน	พ.ย.	14	พฤหัสบดี	4	Q4	f
4315	2024-11-15	15/11/2024	2024	2567	11	พฤศจิกายน	พ.ย.	15	ศุกร์	5	Q4	f
4316	2024-11-16	16/11/2024	2024	2567	11	พฤศจิกายน	พ.ย.	16	เสาร์	6	Q4	t
4317	2024-11-17	17/11/2024	2024	2567	11	พฤศจิกายน	พ.ย.	17	อาทิตย์	7	Q4	t
4318	2024-11-18	18/11/2024	2024	2567	11	พฤศจิกายน	พ.ย.	18	จันทร์	1	Q4	f
4319	2024-11-19	19/11/2024	2024	2567	11	พฤศจิกายน	พ.ย.	19	อังคาร	2	Q4	f
4320	2024-11-20	20/11/2024	2024	2567	11	พฤศจิกายน	พ.ย.	20	พุธ	3	Q4	f
4321	2024-11-21	21/11/2024	2024	2567	11	พฤศจิกายน	พ.ย.	21	พฤหัสบดี	4	Q4	f
4322	2024-11-22	22/11/2024	2024	2567	11	พฤศจิกายน	พ.ย.	22	ศุกร์	5	Q4	f
4323	2024-11-23	23/11/2024	2024	2567	11	พฤศจิกายน	พ.ย.	23	เสาร์	6	Q4	t
4324	2024-11-24	24/11/2024	2024	2567	11	พฤศจิกายน	พ.ย.	24	อาทิตย์	7	Q4	t
4325	2024-11-25	25/11/2024	2024	2567	11	พฤศจิกายน	พ.ย.	25	จันทร์	1	Q4	f
4326	2024-11-26	26/11/2024	2024	2567	11	พฤศจิกายน	พ.ย.	26	อังคาร	2	Q4	f
4327	2024-11-27	27/11/2024	2024	2567	11	พฤศจิกายน	พ.ย.	27	พุธ	3	Q4	f
4328	2024-11-28	28/11/2024	2024	2567	11	พฤศจิกายน	พ.ย.	28	พฤหัสบดี	4	Q4	f
4329	2024-11-29	29/11/2024	2024	2567	11	พฤศจิกายน	พ.ย.	29	ศุกร์	5	Q4	f
4330	2024-11-30	30/11/2024	2024	2567	11	พฤศจิกายน	พ.ย.	30	เสาร์	6	Q4	t
4331	2024-12-01	01/12/2024	2024	2567	12	ธันวาคม	ธ.ค.	1	อาทิตย์	7	Q4	t
4332	2024-12-02	02/12/2024	2024	2567	12	ธันวาคม	ธ.ค.	2	จันทร์	1	Q4	f
4333	2024-12-03	03/12/2024	2024	2567	12	ธันวาคม	ธ.ค.	3	อังคาร	2	Q4	f
4334	2024-12-04	04/12/2024	2024	2567	12	ธันวาคม	ธ.ค.	4	พุธ	3	Q4	f
4335	2024-12-05	05/12/2024	2024	2567	12	ธันวาคม	ธ.ค.	5	พฤหัสบดี	4	Q4	f
4336	2024-12-06	06/12/2024	2024	2567	12	ธันวาคม	ธ.ค.	6	ศุกร์	5	Q4	f
4337	2024-12-07	07/12/2024	2024	2567	12	ธันวาคม	ธ.ค.	7	เสาร์	6	Q4	t
4338	2024-12-08	08/12/2024	2024	2567	12	ธันวาคม	ธ.ค.	8	อาทิตย์	7	Q4	t
4339	2024-12-09	09/12/2024	2024	2567	12	ธันวาคม	ธ.ค.	9	จันทร์	1	Q4	f
4340	2024-12-10	10/12/2024	2024	2567	12	ธันวาคม	ธ.ค.	10	อังคาร	2	Q4	f
4341	2024-12-11	11/12/2024	2024	2567	12	ธันวาคม	ธ.ค.	11	พุธ	3	Q4	f
4342	2024-12-12	12/12/2024	2024	2567	12	ธันวาคม	ธ.ค.	12	พฤหัสบดี	4	Q4	f
4343	2024-12-13	13/12/2024	2024	2567	12	ธันวาคม	ธ.ค.	13	ศุกร์	5	Q4	f
4344	2024-12-14	14/12/2024	2024	2567	12	ธันวาคม	ธ.ค.	14	เสาร์	6	Q4	t
4345	2024-12-15	15/12/2024	2024	2567	12	ธันวาคม	ธ.ค.	15	อาทิตย์	7	Q4	t
4346	2024-12-16	16/12/2024	2024	2567	12	ธันวาคม	ธ.ค.	16	จันทร์	1	Q4	f
4347	2024-12-17	17/12/2024	2024	2567	12	ธันวาคม	ธ.ค.	17	อังคาร	2	Q4	f
4348	2024-12-18	18/12/2024	2024	2567	12	ธันวาคม	ธ.ค.	18	พุธ	3	Q4	f
4349	2024-12-19	19/12/2024	2024	2567	12	ธันวาคม	ธ.ค.	19	พฤหัสบดี	4	Q4	f
4351	2024-12-21	21/12/2024	2024	2567	12	ธันวาคม	ธ.ค.	21	เสาร์	6	Q4	t
4352	2024-12-22	22/12/2024	2024	2567	12	ธันวาคม	ธ.ค.	22	อาทิตย์	7	Q4	t
4353	2024-12-23	23/12/2024	2024	2567	12	ธันวาคม	ธ.ค.	23	จันทร์	1	Q4	f
4354	2024-12-24	24/12/2024	2024	2567	12	ธันวาคม	ธ.ค.	24	อังคาร	2	Q4	f
4355	2024-12-25	25/12/2024	2024	2567	12	ธันวาคม	ธ.ค.	25	พุธ	3	Q4	f
4356	2024-12-26	26/12/2024	2024	2567	12	ธันวาคม	ธ.ค.	26	พฤหัสบดี	4	Q4	f
4357	2024-12-27	27/12/2024	2024	2567	12	ธันวาคม	ธ.ค.	27	ศุกร์	5	Q4	f
4358	2024-12-28	28/12/2024	2024	2567	12	ธันวาคม	ธ.ค.	28	เสาร์	6	Q4	t
4359	2024-12-29	29/12/2024	2024	2567	12	ธันวาคม	ธ.ค.	29	อาทิตย์	7	Q4	t
4360	2024-12-30	30/12/2024	2024	2567	12	ธันวาคม	ธ.ค.	30	จันทร์	1	Q4	f
4361	2024-12-31	31/12/2024	2024	2567	12	ธันวาคม	ธ.ค.	31	อังคาร	2	Q4	f
4362	2025-01-01	01/01/2025	2025	2568	1	มกราคม	ม.ค.	1	พุธ	3	Q1	f
4363	2025-01-02	02/01/2025	2025	2568	1	มกราคม	ม.ค.	2	พฤหัสบดี	4	Q1	f
4364	2025-01-03	03/01/2025	2025	2568	1	มกราคม	ม.ค.	3	ศุกร์	5	Q1	f
4365	2025-01-04	04/01/2025	2025	2568	1	มกราคม	ม.ค.	4	เสาร์	6	Q1	t
4366	2025-01-05	05/01/2025	2025	2568	1	มกราคม	ม.ค.	5	อาทิตย์	7	Q1	t
4367	2025-01-06	06/01/2025	2025	2568	1	มกราคม	ม.ค.	6	จันทร์	1	Q1	f
4368	2025-01-07	07/01/2025	2025	2568	1	มกราคม	ม.ค.	7	อังคาร	2	Q1	f
4369	2025-01-08	08/01/2025	2025	2568	1	มกราคม	ม.ค.	8	พุธ	3	Q1	f
4370	2025-01-09	09/01/2025	2025	2568	1	มกราคม	ม.ค.	9	พฤหัสบดี	4	Q1	f
4371	2025-01-10	10/01/2025	2025	2568	1	มกราคม	ม.ค.	10	ศุกร์	5	Q1	f
4372	2025-01-11	11/01/2025	2025	2568	1	มกราคม	ม.ค.	11	เสาร์	6	Q1	t
4373	2025-01-12	12/01/2025	2025	2568	1	มกราคม	ม.ค.	12	อาทิตย์	7	Q1	t
4374	2025-01-13	13/01/2025	2025	2568	1	มกราคม	ม.ค.	13	จันทร์	1	Q1	f
4375	2025-01-14	14/01/2025	2025	2568	1	มกราคม	ม.ค.	14	อังคาร	2	Q1	f
4376	2025-01-15	15/01/2025	2025	2568	1	มกราคม	ม.ค.	15	พุธ	3	Q1	f
4377	2025-01-16	16/01/2025	2025	2568	1	มกราคม	ม.ค.	16	พฤหัสบดี	4	Q1	f
4378	2025-01-17	17/01/2025	2025	2568	1	มกราคม	ม.ค.	17	ศุกร์	5	Q1	f
4379	2025-01-18	18/01/2025	2025	2568	1	มกราคม	ม.ค.	18	เสาร์	6	Q1	t
4380	2025-01-19	19/01/2025	2025	2568	1	มกราคม	ม.ค.	19	อาทิตย์	7	Q1	t
4381	2025-01-20	20/01/2025	2025	2568	1	มกราคม	ม.ค.	20	จันทร์	1	Q1	f
4382	2025-01-21	21/01/2025	2025	2568	1	มกราคม	ม.ค.	21	อังคาร	2	Q1	f
4383	2025-01-22	22/01/2025	2025	2568	1	มกราคม	ม.ค.	22	พุธ	3	Q1	f
4384	2025-01-23	23/01/2025	2025	2568	1	มกราคม	ม.ค.	23	พฤหัสบดี	4	Q1	f
4385	2025-01-24	24/01/2025	2025	2568	1	มกราคม	ม.ค.	24	ศุกร์	5	Q1	f
4386	2025-01-25	25/01/2025	2025	2568	1	มกราคม	ม.ค.	25	เสาร์	6	Q1	t
4387	2025-01-26	26/01/2025	2025	2568	1	มกราคม	ม.ค.	26	อาทิตย์	7	Q1	t
4388	2025-01-27	27/01/2025	2025	2568	1	มกราคม	ม.ค.	27	จันทร์	1	Q1	f
4389	2025-01-28	28/01/2025	2025	2568	1	มกราคม	ม.ค.	28	อังคาร	2	Q1	f
4390	2025-01-29	29/01/2025	2025	2568	1	มกราคม	ม.ค.	29	พุธ	3	Q1	f
4391	2025-01-30	30/01/2025	2025	2568	1	มกราคม	ม.ค.	30	พฤหัสบดี	4	Q1	f
4392	2025-01-31	31/01/2025	2025	2568	1	มกราคม	ม.ค.	31	ศุกร์	5	Q1	f
4393	2025-02-01	01/02/2025	2025	2568	2	กุมภาพันธ์	ก.พ.	1	เสาร์	6	Q1	t
4394	2025-02-02	02/02/2025	2025	2568	2	กุมภาพันธ์	ก.พ.	2	อาทิตย์	7	Q1	t
4395	2025-02-03	03/02/2025	2025	2568	2	กุมภาพันธ์	ก.พ.	3	จันทร์	1	Q1	f
4396	2025-02-04	04/02/2025	2025	2568	2	กุมภาพันธ์	ก.พ.	4	อังคาร	2	Q1	f
4397	2025-02-05	05/02/2025	2025	2568	2	กุมภาพันธ์	ก.พ.	5	พุธ	3	Q1	f
4398	2025-02-06	06/02/2025	2025	2568	2	กุมภาพันธ์	ก.พ.	6	พฤหัสบดี	4	Q1	f
4399	2025-02-07	07/02/2025	2025	2568	2	กุมภาพันธ์	ก.พ.	7	ศุกร์	5	Q1	f
4400	2025-02-08	08/02/2025	2025	2568	2	กุมภาพันธ์	ก.พ.	8	เสาร์	6	Q1	t
4401	2025-02-09	09/02/2025	2025	2568	2	กุมภาพันธ์	ก.พ.	9	อาทิตย์	7	Q1	t
4402	2025-02-10	10/02/2025	2025	2568	2	กุมภาพันธ์	ก.พ.	10	จันทร์	1	Q1	f
4403	2025-02-11	11/02/2025	2025	2568	2	กุมภาพันธ์	ก.พ.	11	อังคาร	2	Q1	f
4404	2025-02-12	12/02/2025	2025	2568	2	กุมภาพันธ์	ก.พ.	12	พุธ	3	Q1	f
4405	2025-02-13	13/02/2025	2025	2568	2	กุมภาพันธ์	ก.พ.	13	พฤหัสบดี	4	Q1	f
4406	2025-02-14	14/02/2025	2025	2568	2	กุมภาพันธ์	ก.พ.	14	ศุกร์	5	Q1	f
4407	2025-02-15	15/02/2025	2025	2568	2	กุมภาพันธ์	ก.พ.	15	เสาร์	6	Q1	t
4408	2025-02-16	16/02/2025	2025	2568	2	กุมภาพันธ์	ก.พ.	16	อาทิตย์	7	Q1	t
4409	2025-02-17	17/02/2025	2025	2568	2	กุมภาพันธ์	ก.พ.	17	จันทร์	1	Q1	f
4410	2025-02-18	18/02/2025	2025	2568	2	กุมภาพันธ์	ก.พ.	18	อังคาร	2	Q1	f
4411	2025-02-19	19/02/2025	2025	2568	2	กุมภาพันธ์	ก.พ.	19	พุธ	3	Q1	f
4412	2025-02-20	20/02/2025	2025	2568	2	กุมภาพันธ์	ก.พ.	20	พฤหัสบดี	4	Q1	f
4413	2025-02-21	21/02/2025	2025	2568	2	กุมภาพันธ์	ก.พ.	21	ศุกร์	5	Q1	f
4414	2025-02-22	22/02/2025	2025	2568	2	กุมภาพันธ์	ก.พ.	22	เสาร์	6	Q1	t
4415	2025-02-23	23/02/2025	2025	2568	2	กุมภาพันธ์	ก.พ.	23	อาทิตย์	7	Q1	t
4416	2025-02-24	24/02/2025	2025	2568	2	กุมภาพันธ์	ก.พ.	24	จันทร์	1	Q1	f
4417	2025-02-25	25/02/2025	2025	2568	2	กุมภาพันธ์	ก.พ.	25	อังคาร	2	Q1	f
4418	2025-02-26	26/02/2025	2025	2568	2	กุมภาพันธ์	ก.พ.	26	พุธ	3	Q1	f
4419	2025-02-27	27/02/2025	2025	2568	2	กุมภาพันธ์	ก.พ.	27	พฤหัสบดี	4	Q1	f
4420	2025-02-28	28/02/2025	2025	2568	2	กุมภาพันธ์	ก.พ.	28	ศุกร์	5	Q1	f
4421	2025-03-01	01/03/2025	2025	2568	3	มีนาคม	มี.ค.	1	เสาร์	6	Q1	t
4422	2025-03-02	02/03/2025	2025	2568	3	มีนาคม	มี.ค.	2	อาทิตย์	7	Q1	t
4423	2025-03-03	03/03/2025	2025	2568	3	มีนาคม	มี.ค.	3	จันทร์	1	Q1	f
4424	2025-03-04	04/03/2025	2025	2568	3	มีนาคม	มี.ค.	4	อังคาร	2	Q1	f
4425	2025-03-05	05/03/2025	2025	2568	3	มีนาคม	มี.ค.	5	พุธ	3	Q1	f
4426	2025-03-06	06/03/2025	2025	2568	3	มีนาคม	มี.ค.	6	พฤหัสบดี	4	Q1	f
4427	2025-03-07	07/03/2025	2025	2568	3	มีนาคม	มี.ค.	7	ศุกร์	5	Q1	f
4428	2025-03-08	08/03/2025	2025	2568	3	มีนาคม	มี.ค.	8	เสาร์	6	Q1	t
4429	2025-03-09	09/03/2025	2025	2568	3	มีนาคม	มี.ค.	9	อาทิตย์	7	Q1	t
4430	2025-03-10	10/03/2025	2025	2568	3	มีนาคม	มี.ค.	10	จันทร์	1	Q1	f
4431	2025-03-11	11/03/2025	2025	2568	3	มีนาคม	มี.ค.	11	อังคาร	2	Q1	f
4432	2025-03-12	12/03/2025	2025	2568	3	มีนาคม	มี.ค.	12	พุธ	3	Q1	f
4433	2025-03-13	13/03/2025	2025	2568	3	มีนาคม	มี.ค.	13	พฤหัสบดี	4	Q1	f
4434	2025-03-14	14/03/2025	2025	2568	3	มีนาคม	มี.ค.	14	ศุกร์	5	Q1	f
4435	2025-03-15	15/03/2025	2025	2568	3	มีนาคม	มี.ค.	15	เสาร์	6	Q1	t
4436	2025-03-16	16/03/2025	2025	2568	3	มีนาคม	มี.ค.	16	อาทิตย์	7	Q1	t
4437	2025-03-17	17/03/2025	2025	2568	3	มีนาคม	มี.ค.	17	จันทร์	1	Q1	f
4438	2025-03-18	18/03/2025	2025	2568	3	มีนาคม	มี.ค.	18	อังคาร	2	Q1	f
4439	2025-03-19	19/03/2025	2025	2568	3	มีนาคม	มี.ค.	19	พุธ	3	Q1	f
4440	2025-03-20	20/03/2025	2025	2568	3	มีนาคม	มี.ค.	20	พฤหัสบดี	4	Q1	f
4441	2025-03-21	21/03/2025	2025	2568	3	มีนาคม	มี.ค.	21	ศุกร์	5	Q1	f
4442	2025-03-22	22/03/2025	2025	2568	3	มีนาคม	มี.ค.	22	เสาร์	6	Q1	t
4443	2025-03-23	23/03/2025	2025	2568	3	มีนาคม	มี.ค.	23	อาทิตย์	7	Q1	t
4444	2025-03-24	24/03/2025	2025	2568	3	มีนาคม	มี.ค.	24	จันทร์	1	Q1	f
4445	2025-03-25	25/03/2025	2025	2568	3	มีนาคม	มี.ค.	25	อังคาร	2	Q1	f
4446	2025-03-26	26/03/2025	2025	2568	3	มีนาคม	มี.ค.	26	พุธ	3	Q1	f
4447	2025-03-27	27/03/2025	2025	2568	3	มีนาคม	มี.ค.	27	พฤหัสบดี	4	Q1	f
4448	2025-03-28	28/03/2025	2025	2568	3	มีนาคม	มี.ค.	28	ศุกร์	5	Q1	f
4449	2025-03-29	29/03/2025	2025	2568	3	มีนาคม	มี.ค.	29	เสาร์	6	Q1	t
4450	2025-03-30	30/03/2025	2025	2568	3	มีนาคม	มี.ค.	30	อาทิตย์	7	Q1	t
4451	2025-03-31	31/03/2025	2025	2568	3	มีนาคม	มี.ค.	31	จันทร์	1	Q1	f
4452	2025-04-01	01/04/2025	2025	2568	4	เมษายน	เม.ย.	1	อังคาร	2	Q2	f
4453	2025-04-02	02/04/2025	2025	2568	4	เมษายน	เม.ย.	2	พุธ	3	Q2	f
4454	2025-04-03	03/04/2025	2025	2568	4	เมษายน	เม.ย.	3	พฤหัสบดี	4	Q2	f
4455	2025-04-04	04/04/2025	2025	2568	4	เมษายน	เม.ย.	4	ศุกร์	5	Q2	f
4456	2025-04-05	05/04/2025	2025	2568	4	เมษายน	เม.ย.	5	เสาร์	6	Q2	t
4457	2025-04-06	06/04/2025	2025	2568	4	เมษายน	เม.ย.	6	อาทิตย์	7	Q2	t
4458	2025-04-07	07/04/2025	2025	2568	4	เมษายน	เม.ย.	7	จันทร์	1	Q2	f
4459	2025-04-08	08/04/2025	2025	2568	4	เมษายน	เม.ย.	8	อังคาร	2	Q2	f
4460	2025-04-09	09/04/2025	2025	2568	4	เมษายน	เม.ย.	9	พุธ	3	Q2	f
4461	2025-04-10	10/04/2025	2025	2568	4	เมษายน	เม.ย.	10	พฤหัสบดี	4	Q2	f
4462	2025-04-11	11/04/2025	2025	2568	4	เมษายน	เม.ย.	11	ศุกร์	5	Q2	f
4463	2025-04-12	12/04/2025	2025	2568	4	เมษายน	เม.ย.	12	เสาร์	6	Q2	t
4464	2025-04-13	13/04/2025	2025	2568	4	เมษายน	เม.ย.	13	อาทิตย์	7	Q2	t
4465	2025-04-14	14/04/2025	2025	2568	4	เมษายน	เม.ย.	14	จันทร์	1	Q2	f
4466	2025-04-15	15/04/2025	2025	2568	4	เมษายน	เม.ย.	15	อังคาร	2	Q2	f
4467	2025-04-16	16/04/2025	2025	2568	4	เมษายน	เม.ย.	16	พุธ	3	Q2	f
4468	2025-04-17	17/04/2025	2025	2568	4	เมษายน	เม.ย.	17	พฤหัสบดี	4	Q2	f
4469	2025-04-18	18/04/2025	2025	2568	4	เมษายน	เม.ย.	18	ศุกร์	5	Q2	f
4470	2025-04-19	19/04/2025	2025	2568	4	เมษายน	เม.ย.	19	เสาร์	6	Q2	t
4471	2025-04-20	20/04/2025	2025	2568	4	เมษายน	เม.ย.	20	อาทิตย์	7	Q2	t
4472	2025-04-21	21/04/2025	2025	2568	4	เมษายน	เม.ย.	21	จันทร์	1	Q2	f
4473	2025-04-22	22/04/2025	2025	2568	4	เมษายน	เม.ย.	22	อังคาร	2	Q2	f
4474	2025-04-23	23/04/2025	2025	2568	4	เมษายน	เม.ย.	23	พุธ	3	Q2	f
4475	2025-04-24	24/04/2025	2025	2568	4	เมษายน	เม.ย.	24	พฤหัสบดี	4	Q2	f
4476	2025-04-25	25/04/2025	2025	2568	4	เมษายน	เม.ย.	25	ศุกร์	5	Q2	f
4489	2025-05-08	08/05/2025	2025	2568	5	พฤษภาคม	พ.ค.	8	พฤหัสบดี	4	Q2	f
4490	2025-05-09	09/05/2025	2025	2568	5	พฤษภาคม	พ.ค.	9	ศุกร์	5	Q2	f
4491	2025-05-10	10/05/2025	2025	2568	5	พฤษภาคม	พ.ค.	10	เสาร์	6	Q2	t
7920	2026-05-16	16/05/2026	2026	2569	5	พฤษภาคม	พ.ค.	16	เสาร์	6	Q2	t
7921	2026-05-17	17/05/2026	2026	2569	5	พฤษภาคม	พ.ค.	17	อาทิตย์	7	Q2	t
7922	2026-05-18	18/05/2026	2026	2569	5	พฤษภาคม	พ.ค.	18	จันทร์	1	Q2	f
7923	2026-05-19	19/05/2026	2026	2569	5	พฤษภาคม	พ.ค.	19	อังคาร	2	Q2	f
7924	2026-05-20	20/05/2026	2026	2569	5	พฤษภาคม	พ.ค.	20	พุธ	3	Q2	f
7925	2026-05-21	21/05/2026	2026	2569	5	พฤษภาคม	พ.ค.	21	พฤหัสบดี	4	Q2	f
7926	2026-05-22	22/05/2026	2026	2569	5	พฤษภาคม	พ.ค.	22	ศุกร์	5	Q2	f
7927	2026-05-23	23/05/2026	2026	2569	5	พฤษภาคม	พ.ค.	23	เสาร์	6	Q2	t
7928	2026-05-24	24/05/2026	2026	2569	5	พฤษภาคม	พ.ค.	24	อาทิตย์	7	Q2	t
7929	2026-05-25	25/05/2026	2026	2569	5	พฤษภาคม	พ.ค.	25	จันทร์	1	Q2	f
7930	2026-05-26	26/05/2026	2026	2569	5	พฤษภาคม	พ.ค.	26	อังคาร	2	Q2	f
7931	2026-05-27	27/05/2026	2026	2569	5	พฤษภาคม	พ.ค.	27	พุธ	3	Q2	f
7932	2026-05-28	28/05/2026	2026	2569	5	พฤษภาคม	พ.ค.	28	พฤหัสบดี	4	Q2	f
7933	2026-05-29	29/05/2026	2026	2569	5	พฤษภาคม	พ.ค.	29	ศุกร์	5	Q2	f
7644	2025-08-13	13/08/2025	2025	2568	8	สิงหาคม	ส.ค.	13	พุธ	3	Q3	f
7645	2025-08-14	14/08/2025	2025	2568	8	สิงหาคม	ส.ค.	14	พฤหัสบดี	4	Q3	f
7646	2025-08-15	15/08/2025	2025	2568	8	สิงหาคม	ส.ค.	15	ศุกร์	5	Q3	f
7647	2025-08-16	16/08/2025	2025	2568	8	สิงหาคม	ส.ค.	16	เสาร์	6	Q3	t
7648	2025-08-17	17/08/2025	2025	2568	8	สิงหาคม	ส.ค.	17	อาทิตย์	7	Q3	t
7649	2025-08-18	18/08/2025	2025	2568	8	สิงหาคม	ส.ค.	18	จันทร์	1	Q3	f
7650	2025-08-19	19/08/2025	2025	2568	8	สิงหาคม	ส.ค.	19	อังคาร	2	Q3	f
7651	2025-08-20	20/08/2025	2025	2568	8	สิงหาคม	ส.ค.	20	พุธ	3	Q3	f
7652	2025-08-21	21/08/2025	2025	2568	8	สิงหาคม	ส.ค.	21	พฤหัสบดี	4	Q3	f
7885	2026-04-11	11/04/2026	2026	2569	4	เมษายน	เม.ย.	11	เสาร์	6	Q2	t
7886	2026-04-12	12/04/2026	2026	2569	4	เมษายน	เม.ย.	12	อาทิตย์	7	Q2	t
7887	2026-04-13	13/04/2026	2026	2569	4	เมษายน	เม.ย.	13	จันทร์	1	Q2	f
7888	2026-04-14	14/04/2026	2026	2569	4	เมษายน	เม.ย.	14	อังคาร	2	Q2	f
7889	2026-04-15	15/04/2026	2026	2569	4	เมษายน	เม.ย.	15	พุธ	3	Q2	f
7890	2026-04-16	16/04/2026	2026	2569	4	เมษายน	เม.ย.	16	พฤหัสบดี	4	Q2	f
7891	2026-04-17	17/04/2026	2026	2569	4	เมษายน	เม.ย.	17	ศุกร์	5	Q2	f
7892	2026-04-18	18/04/2026	2026	2569	4	เมษายน	เม.ย.	18	เสาร์	6	Q2	t
7893	2026-04-19	19/04/2026	2026	2569	4	เมษายน	เม.ย.	19	อาทิตย์	7	Q2	t
7894	2026-04-20	20/04/2026	2026	2569	4	เมษายน	เม.ย.	20	จันทร์	1	Q2	f
7895	2026-04-21	21/04/2026	2026	2569	4	เมษายน	เม.ย.	21	อังคาร	2	Q2	f
7896	2026-04-22	22/04/2026	2026	2569	4	เมษายน	เม.ย.	22	พุธ	3	Q2	f
7897	2026-04-23	23/04/2026	2026	2569	4	เมษายน	เม.ย.	23	พฤหัสบดี	4	Q2	f
7898	2026-04-24	24/04/2026	2026	2569	4	เมษายน	เม.ย.	24	ศุกร์	5	Q2	f
7899	2026-04-25	25/04/2026	2026	2569	4	เมษายน	เม.ย.	25	เสาร์	6	Q2	t
7900	2026-04-26	26/04/2026	2026	2569	4	เมษายน	เม.ย.	26	อาทิตย์	7	Q2	t
7901	2026-04-27	27/04/2026	2026	2569	4	เมษายน	เม.ย.	27	จันทร์	1	Q2	f
7902	2026-04-28	28/04/2026	2026	2569	4	เมษายน	เม.ย.	28	อังคาร	2	Q2	f
7903	2026-04-29	29/04/2026	2026	2569	4	เมษายน	เม.ย.	29	พุธ	3	Q2	f
7904	2026-04-30	30/04/2026	2026	2569	4	เมษายน	เม.ย.	30	พฤหัสบดี	4	Q2	f
7905	2026-05-01	01/05/2026	2026	2569	5	พฤษภาคม	พ.ค.	1	ศุกร์	5	Q2	f
7906	2026-05-02	02/05/2026	2026	2569	5	พฤษภาคม	พ.ค.	2	เสาร์	6	Q2	t
7907	2026-05-03	03/05/2026	2026	2569	5	พฤษภาคม	พ.ค.	3	อาทิตย์	7	Q2	t
7908	2026-05-04	04/05/2026	2026	2569	5	พฤษภาคม	พ.ค.	4	จันทร์	1	Q2	f
7909	2026-05-05	05/05/2026	2026	2569	5	พฤษภาคม	พ.ค.	5	อังคาร	2	Q2	f
7910	2026-05-06	06/05/2026	2026	2569	5	พฤษภาคม	พ.ค.	6	พุธ	3	Q2	f
7911	2026-05-07	07/05/2026	2026	2569	5	พฤษภาคม	พ.ค.	7	พฤหัสบดี	4	Q2	f
7912	2026-05-08	08/05/2026	2026	2569	5	พฤษภาคม	พ.ค.	8	ศุกร์	5	Q2	f
7913	2026-05-09	09/05/2026	2026	2569	5	พฤษภาคม	พ.ค.	9	เสาร์	6	Q2	t
7914	2026-05-10	10/05/2026	2026	2569	5	พฤษภาคม	พ.ค.	10	อาทิตย์	7	Q2	t
7915	2026-05-11	11/05/2026	2026	2569	5	พฤษภาคม	พ.ค.	11	จันทร์	1	Q2	f
7593	2025-06-23	23/06/2025	2025	2568	6	มิถุนายน	มิ.ย.	23	จันทร์	1	Q2	f
7594	2025-06-24	24/06/2025	2025	2568	6	มิถุนายน	มิ.ย.	24	อังคาร	2	Q2	f
7595	2025-06-25	25/06/2025	2025	2568	6	มิถุนายน	มิ.ย.	25	พุธ	3	Q2	f
7596	2025-06-26	26/06/2025	2025	2568	6	มิถุนายน	มิ.ย.	26	พฤหัสบดี	4	Q2	f
7597	2025-06-27	27/06/2025	2025	2568	6	มิถุนายน	มิ.ย.	27	ศุกร์	5	Q2	f
7598	2025-06-28	28/06/2025	2025	2568	6	มิถุนายน	มิ.ย.	28	เสาร์	6	Q2	t
7599	2025-06-29	29/06/2025	2025	2568	6	มิถุนายน	มิ.ย.	29	อาทิตย์	7	Q2	t
7600	2025-06-30	30/06/2025	2025	2568	6	มิถุนายน	มิ.ย.	30	จันทร์	1	Q2	f
7601	2025-07-01	01/07/2025	2025	2568	7	กรกฎาคม	ก.ค.	1	อังคาร	2	Q3	f
7602	2025-07-02	02/07/2025	2025	2568	7	กรกฎาคม	ก.ค.	2	พุธ	3	Q3	f
7603	2025-07-03	03/07/2025	2025	2568	7	กรกฎาคม	ก.ค.	3	พฤหัสบดี	4	Q3	f
7604	2025-07-04	04/07/2025	2025	2568	7	กรกฎาคม	ก.ค.	4	ศุกร์	5	Q3	f
7605	2025-07-05	05/07/2025	2025	2568	7	กรกฎาคม	ก.ค.	5	เสาร์	6	Q3	t
7606	2025-07-06	06/07/2025	2025	2568	7	กรกฎาคม	ก.ค.	6	อาทิตย์	7	Q3	t
7607	2025-07-07	07/07/2025	2025	2568	7	กรกฎาคม	ก.ค.	7	จันทร์	1	Q3	f
7608	2025-07-08	08/07/2025	2025	2568	7	กรกฎาคม	ก.ค.	8	อังคาร	2	Q3	f
7609	2025-07-09	09/07/2025	2025	2568	7	กรกฎาคม	ก.ค.	9	พุธ	3	Q3	f
7610	2025-07-10	10/07/2025	2025	2568	7	กรกฎาคม	ก.ค.	10	พฤหัสบดี	4	Q3	f
7611	2025-07-11	11/07/2025	2025	2568	7	กรกฎาคม	ก.ค.	11	ศุกร์	5	Q3	f
7791	2026-01-07	07/01/2026	2026	2569	1	มกราคม	ม.ค.	7	พุธ	3	Q1	f
7612	2025-07-12	12/07/2025	2025	2568	7	กรกฎาคม	ก.ค.	12	เสาร์	6	Q3	t
7613	2025-07-13	13/07/2025	2025	2568	7	กรกฎาคม	ก.ค.	13	อาทิตย์	7	Q3	t
7614	2025-07-14	14/07/2025	2025	2568	7	กรกฎาคม	ก.ค.	14	จันทร์	1	Q3	f
7615	2025-07-15	15/07/2025	2025	2568	7	กรกฎาคม	ก.ค.	15	อังคาร	2	Q3	f
7616	2025-07-16	16/07/2025	2025	2568	7	กรกฎาคม	ก.ค.	16	พุธ	3	Q3	f
7617	2025-07-17	17/07/2025	2025	2568	7	กรกฎาคม	ก.ค.	17	พฤหัสบดี	4	Q3	f
7618	2025-07-18	18/07/2025	2025	2568	7	กรกฎาคม	ก.ค.	18	ศุกร์	5	Q3	f
7619	2025-07-19	19/07/2025	2025	2568	7	กรกฎาคม	ก.ค.	19	เสาร์	6	Q3	t
7620	2025-07-20	20/07/2025	2025	2568	7	กรกฎาคม	ก.ค.	20	อาทิตย์	7	Q3	t
7621	2025-07-21	21/07/2025	2025	2568	7	กรกฎาคม	ก.ค.	21	จันทร์	1	Q3	f
4499	2025-05-18	18/05/2025	2025	2568	5	พฤษภาคม	พ.ค.	18	อาทิตย์	7	Q2	t
4500	2025-05-19	19/05/2025	2025	2568	5	พฤษภาคม	พ.ค.	19	จันทร์	1	Q2	f
4501	2025-05-20	20/05/2025	2025	2568	5	พฤษภาคม	พ.ค.	20	อังคาร	2	Q2	f
4502	2025-05-21	21/05/2025	2025	2568	5	พฤษภาคม	พ.ค.	21	พุธ	3	Q2	f
4503	2025-05-22	22/05/2025	2025	2568	5	พฤษภาคม	พ.ค.	22	พฤหัสบดี	4	Q2	f
4504	2025-05-23	23/05/2025	2025	2568	5	พฤษภาคม	พ.ค.	23	ศุกร์	5	Q2	f
4505	2025-05-24	24/05/2025	2025	2568	5	พฤษภาคม	พ.ค.	24	เสาร์	6	Q2	t
4506	2025-05-25	25/05/2025	2025	2568	5	พฤษภาคม	พ.ค.	25	อาทิตย์	7	Q2	t
4507	2025-05-26	26/05/2025	2025	2568	5	พฤษภาคม	พ.ค.	26	จันทร์	1	Q2	f
4508	2025-05-27	27/05/2025	2025	2568	5	พฤษภาคม	พ.ค.	27	อังคาร	2	Q2	f
4509	2025-05-28	28/05/2025	2025	2568	5	พฤษภาคม	พ.ค.	28	พุธ	3	Q2	f
4510	2025-05-29	29/05/2025	2025	2568	5	พฤษภาคม	พ.ค.	29	พฤหัสบดี	4	Q2	f
4511	2025-05-30	30/05/2025	2025	2568	5	พฤษภาคม	พ.ค.	30	ศุกร์	5	Q2	f
4512	2025-05-31	31/05/2025	2025	2568	5	พฤษภาคม	พ.ค.	31	เสาร์	6	Q2	t
4513	2025-06-01	01/06/2025	2025	2568	6	มิถุนายน	มิ.ย.	1	อาทิตย์	7	Q2	t
4514	2025-06-02	02/06/2025	2025	2568	6	มิถุนายน	มิ.ย.	2	จันทร์	1	Q2	f
4515	2025-06-03	03/06/2025	2025	2568	6	มิถุนายน	มิ.ย.	3	อังคาร	2	Q2	f
4516	2025-06-04	04/06/2025	2025	2568	6	มิถุนายน	มิ.ย.	4	พุธ	3	Q2	f
4517	2025-06-05	05/06/2025	2025	2568	6	มิถุนายน	มิ.ย.	5	พฤหัสบดี	4	Q2	f
8246	2025-06-09	09/06/2025	2025	2568	6	มิถุนายน	มิ.ย.	9	จันทร์	1	Q2	f
8247	2025-06-10	10/06/2025	2025	2568	6	มิถุนายน	มิ.ย.	10	อังคาร	2	Q2	f
8248	2025-06-11	11/06/2025	2025	2568	6	มิถุนายน	มิ.ย.	11	พุธ	3	Q2	f
8249	2025-06-12	12/06/2025	2025	2568	6	มิถุนายน	มิ.ย.	12	พฤหัสบดี	4	Q2	f
8250	2025-06-13	13/06/2025	2025	2568	6	มิถุนายน	มิ.ย.	13	ศุกร์	5	Q2	f
8251	2025-06-14	14/06/2025	2025	2568	6	มิถุนายน	มิ.ย.	14	เสาร์	6	Q2	t
8252	2025-06-15	15/06/2025	2025	2568	6	มิถุนายน	มิ.ย.	15	อาทิตย์	7	Q2	t
8253	2025-06-16	16/06/2025	2025	2568	6	มิถุนายน	มิ.ย.	16	จันทร์	1	Q2	f
8254	2025-06-17	17/06/2025	2025	2568	6	มิถุนายน	มิ.ย.	17	อังคาร	2	Q2	f
8255	2025-06-18	18/06/2025	2025	2568	6	มิถุนายน	มิ.ย.	18	พุธ	3	Q2	f
8256	2025-06-19	19/06/2025	2025	2568	6	มิถุนายน	มิ.ย.	19	พฤหัสบดี	4	Q2	f
8257	2025-06-20	20/06/2025	2025	2568	6	มิถุนายน	มิ.ย.	20	ศุกร์	5	Q2	f
8258	2025-06-21	21/06/2025	2025	2568	6	มิถุนายน	มิ.ย.	21	เสาร์	6	Q2	t
8259	2025-06-22	22/06/2025	2025	2568	6	มิถุนายน	มิ.ย.	22	อาทิตย์	7	Q2	t
7622	2025-07-22	22/07/2025	2025	2568	7	กรกฎาคม	ก.ค.	22	อังคาร	2	Q3	f
7623	2025-07-23	23/07/2025	2025	2568	7	กรกฎาคม	ก.ค.	23	พุธ	3	Q3	f
7624	2025-07-24	24/07/2025	2025	2568	7	กรกฎาคม	ก.ค.	24	พฤหัสบดี	4	Q3	f
7625	2025-07-25	25/07/2025	2025	2568	7	กรกฎาคม	ก.ค.	25	ศุกร์	5	Q3	f
7626	2025-07-26	26/07/2025	2025	2568	7	กรกฎาคม	ก.ค.	26	เสาร์	6	Q3	t
7627	2025-07-27	27/07/2025	2025	2568	7	กรกฎาคม	ก.ค.	27	อาทิตย์	7	Q3	t
7628	2025-07-28	28/07/2025	2025	2568	7	กรกฎาคม	ก.ค.	28	จันทร์	1	Q3	f
7629	2025-07-29	29/07/2025	2025	2568	7	กรกฎาคม	ก.ค.	29	อังคาร	2	Q3	f
7630	2025-07-30	30/07/2025	2025	2568	7	กรกฎาคม	ก.ค.	30	พุธ	3	Q3	f
7631	2025-07-31	31/07/2025	2025	2568	7	กรกฎาคม	ก.ค.	31	พฤหัสบดี	4	Q3	f
7632	2025-08-01	01/08/2025	2025	2568	8	สิงหาคม	ส.ค.	1	ศุกร์	5	Q3	f
7633	2025-08-02	02/08/2025	2025	2568	8	สิงหาคม	ส.ค.	2	เสาร์	6	Q3	t
7634	2025-08-03	03/08/2025	2025	2568	8	สิงหาคม	ส.ค.	3	อาทิตย์	7	Q3	t
7636	2025-08-05	05/08/2025	2025	2568	8	สิงหาคม	ส.ค.	5	อังคาร	2	Q3	f
7770	2025-12-17	17/12/2025	2025	2568	12	ธันวาคม	ธ.ค.	17	พุธ	3	Q4	f
7635	2025-08-04	04/08/2025	2025	2568	8	สิงหาคม	ส.ค.	4	จันทร์	1	Q3	f
7637	2025-08-06	06/08/2025	2025	2568	8	สิงหาคม	ส.ค.	6	พุธ	3	Q3	f
7638	2025-08-07	07/08/2025	2025	2568	8	สิงหาคม	ส.ค.	7	พฤหัสบดี	4	Q3	f
7639	2025-08-08	08/08/2025	2025	2568	8	สิงหาคม	ส.ค.	8	ศุกร์	5	Q3	f
7640	2025-08-09	09/08/2025	2025	2568	8	สิงหาคม	ส.ค.	9	เสาร์	6	Q3	t
7707	2025-10-15	15/10/2025	2025	2568	10	ตุลาคม	ต.ค.	15	พุธ	3	Q4	f
7641	2025-08-10	10/08/2025	2025	2568	8	สิงหาคม	ส.ค.	10	อาทิตย์	7	Q3	t
7642	2025-08-11	11/08/2025	2025	2568	8	สิงหาคม	ส.ค.	11	จันทร์	1	Q3	f
7643	2025-08-12	12/08/2025	2025	2568	8	สิงหาคม	ส.ค.	12	อังคาร	2	Q3	f
7653	2025-08-22	22/08/2025	2025	2568	8	สิงหาคม	ส.ค.	22	ศุกร์	5	Q3	f
7654	2025-08-23	23/08/2025	2025	2568	8	สิงหาคม	ส.ค.	23	เสาร์	6	Q3	t
7655	2025-08-24	24/08/2025	2025	2568	8	สิงหาคม	ส.ค.	24	อาทิตย์	7	Q3	t
7656	2025-08-25	25/08/2025	2025	2568	8	สิงหาคม	ส.ค.	25	จันทร์	1	Q3	f
7657	2025-08-26	26/08/2025	2025	2568	8	สิงหาคม	ส.ค.	26	อังคาร	2	Q3	f
7798	2026-01-14	14/01/2026	2026	2569	1	มกราคม	ม.ค.	14	พุธ	3	Q1	f
7658	2025-08-27	27/08/2025	2025	2568	8	สิงหาคม	ส.ค.	27	พุธ	3	Q3	f
7659	2025-08-28	28/08/2025	2025	2568	8	สิงหาคม	ส.ค.	28	พฤหัสบดี	4	Q3	f
7660	2025-08-29	29/08/2025	2025	2568	8	สิงหาคม	ส.ค.	29	ศุกร์	5	Q3	f
7661	2025-08-30	30/08/2025	2025	2568	8	สิงหาคม	ส.ค.	30	เสาร์	6	Q3	t
7662	2025-08-31	31/08/2025	2025	2568	8	สิงหาคม	ส.ค.	31	อาทิตย์	7	Q3	t
7663	2025-09-01	01/09/2025	2025	2568	9	กันยายน	ก.ย.	1	จันทร์	1	Q3	f
7664	2025-09-02	02/09/2025	2025	2568	9	กันยายน	ก.ย.	2	อังคาร	2	Q3	f
7665	2025-09-03	03/09/2025	2025	2568	9	กันยายน	ก.ย.	3	พุธ	3	Q3	f
7666	2025-09-04	04/09/2025	2025	2568	9	กันยายน	ก.ย.	4	พฤหัสบดี	4	Q3	f
7667	2025-09-05	05/09/2025	2025	2568	9	กันยายน	ก.ย.	5	ศุกร์	5	Q3	f
7668	2025-09-06	06/09/2025	2025	2568	9	กันยายน	ก.ย.	6	เสาร์	6	Q3	t
7669	2025-09-07	07/09/2025	2025	2568	9	กันยายน	ก.ย.	7	อาทิตย์	7	Q3	t
7670	2025-09-08	08/09/2025	2025	2568	9	กันยายน	ก.ย.	8	จันทร์	1	Q3	f
7671	2025-09-09	09/09/2025	2025	2568	9	กันยายน	ก.ย.	9	อังคาร	2	Q3	f
7672	2025-09-10	10/09/2025	2025	2568	9	กันยายน	ก.ย.	10	พุธ	3	Q3	f
7673	2025-09-11	11/09/2025	2025	2568	9	กันยายน	ก.ย.	11	พฤหัสบดี	4	Q3	f
7674	2025-09-12	12/09/2025	2025	2568	9	กันยายน	ก.ย.	12	ศุกร์	5	Q3	f
7675	2025-09-13	13/09/2025	2025	2568	9	กันยายน	ก.ย.	13	เสาร์	6	Q3	t
7676	2025-09-14	14/09/2025	2025	2568	9	กันยายน	ก.ย.	14	อาทิตย์	7	Q3	t
7677	2025-09-15	15/09/2025	2025	2568	9	กันยายน	ก.ย.	15	จันทร์	1	Q3	f
7678	2025-09-16	16/09/2025	2025	2568	9	กันยายน	ก.ย.	16	อังคาร	2	Q3	f
7679	2025-09-17	17/09/2025	2025	2568	9	กันยายน	ก.ย.	17	พุธ	3	Q3	f
7680	2025-09-18	18/09/2025	2025	2568	9	กันยายน	ก.ย.	18	พฤหัสบดี	4	Q3	f
7681	2025-09-19	19/09/2025	2025	2568	9	กันยายน	ก.ย.	19	ศุกร์	5	Q3	f
7682	2025-09-20	20/09/2025	2025	2568	9	กันยายน	ก.ย.	20	เสาร์	6	Q3	t
7683	2025-09-21	21/09/2025	2025	2568	9	กันยายน	ก.ย.	21	อาทิตย์	7	Q3	t
7684	2025-09-22	22/09/2025	2025	2568	9	กันยายน	ก.ย.	22	จันทร์	1	Q3	f
7685	2025-09-23	23/09/2025	2025	2568	9	กันยายน	ก.ย.	23	อังคาร	2	Q3	f
7686	2025-09-24	24/09/2025	2025	2568	9	กันยายน	ก.ย.	24	พุธ	3	Q3	f
7687	2025-09-25	25/09/2025	2025	2568	9	กันยายน	ก.ย.	25	พฤหัสบดี	4	Q3	f
7688	2025-09-26	26/09/2025	2025	2568	9	กันยายน	ก.ย.	26	ศุกร์	5	Q3	f
7689	2025-09-27	27/09/2025	2025	2568	9	กันยายน	ก.ย.	27	เสาร์	6	Q3	t
7690	2025-09-28	28/09/2025	2025	2568	9	กันยายน	ก.ย.	28	อาทิตย์	7	Q3	t
7691	2025-09-29	29/09/2025	2025	2568	9	กันยายน	ก.ย.	29	จันทร์	1	Q3	f
7692	2025-09-30	30/09/2025	2025	2568	9	กันยายน	ก.ย.	30	อังคาร	2	Q3	f
7693	2025-10-01	01/10/2025	2025	2568	10	ตุลาคม	ต.ค.	1	พุธ	3	Q4	f
7694	2025-10-02	02/10/2025	2025	2568	10	ตุลาคม	ต.ค.	2	พฤหัสบดี	4	Q4	f
7695	2025-10-03	03/10/2025	2025	2568	10	ตุลาคม	ต.ค.	3	ศุกร์	5	Q4	f
7696	2025-10-04	04/10/2025	2025	2568	10	ตุลาคม	ต.ค.	4	เสาร์	6	Q4	t
7697	2025-10-05	05/10/2025	2025	2568	10	ตุลาคม	ต.ค.	5	อาทิตย์	7	Q4	t
7698	2025-10-06	06/10/2025	2025	2568	10	ตุลาคม	ต.ค.	6	จันทร์	1	Q4	f
7699	2025-10-07	07/10/2025	2025	2568	10	ตุลาคม	ต.ค.	7	อังคาร	2	Q4	f
7700	2025-10-08	08/10/2025	2025	2568	10	ตุลาคม	ต.ค.	8	พุธ	3	Q4	f
7701	2025-10-09	09/10/2025	2025	2568	10	ตุลาคม	ต.ค.	9	พฤหัสบดี	4	Q4	f
7702	2025-10-10	10/10/2025	2025	2568	10	ตุลาคม	ต.ค.	10	ศุกร์	5	Q4	f
7703	2025-10-11	11/10/2025	2025	2568	10	ตุลาคม	ต.ค.	11	เสาร์	6	Q4	t
7704	2025-10-12	12/10/2025	2025	2568	10	ตุลาคม	ต.ค.	12	อาทิตย์	7	Q4	t
7705	2025-10-13	13/10/2025	2025	2568	10	ตุลาคม	ต.ค.	13	จันทร์	1	Q4	f
7706	2025-10-14	14/10/2025	2025	2568	10	ตุลาคม	ต.ค.	14	อังคาร	2	Q4	f
7708	2025-10-16	16/10/2025	2025	2568	10	ตุลาคม	ต.ค.	16	พฤหัสบดี	4	Q4	f
7709	2025-10-17	17/10/2025	2025	2568	10	ตุลาคม	ต.ค.	17	ศุกร์	5	Q4	f
7710	2025-10-18	18/10/2025	2025	2568	10	ตุลาคม	ต.ค.	18	เสาร์	6	Q4	t
7711	2025-10-19	19/10/2025	2025	2568	10	ตุลาคม	ต.ค.	19	อาทิตย์	7	Q4	t
7712	2025-10-20	20/10/2025	2025	2568	10	ตุลาคม	ต.ค.	20	จันทร์	1	Q4	f
7713	2025-10-21	21/10/2025	2025	2568	10	ตุลาคม	ต.ค.	21	อังคาร	2	Q4	f
7714	2025-10-22	22/10/2025	2025	2568	10	ตุลาคม	ต.ค.	22	พุธ	3	Q4	f
7715	2025-10-23	23/10/2025	2025	2568	10	ตุลาคม	ต.ค.	23	พฤหัสบดี	4	Q4	f
7716	2025-10-24	24/10/2025	2025	2568	10	ตุลาคม	ต.ค.	24	ศุกร์	5	Q4	f
7717	2025-10-25	25/10/2025	2025	2568	10	ตุลาคม	ต.ค.	25	เสาร์	6	Q4	t
7718	2025-10-26	26/10/2025	2025	2568	10	ตุลาคม	ต.ค.	26	อาทิตย์	7	Q4	t
7719	2025-10-27	27/10/2025	2025	2568	10	ตุลาคม	ต.ค.	27	จันทร์	1	Q4	f
7720	2025-10-28	28/10/2025	2025	2568	10	ตุลาคม	ต.ค.	28	อังคาร	2	Q4	f
7721	2025-10-29	29/10/2025	2025	2568	10	ตุลาคม	ต.ค.	29	พุธ	3	Q4	f
7722	2025-10-30	30/10/2025	2025	2568	10	ตุลาคม	ต.ค.	30	พฤหัสบดี	4	Q4	f
7723	2025-10-31	31/10/2025	2025	2568	10	ตุลาคม	ต.ค.	31	ศุกร์	5	Q4	f
7724	2025-11-01	01/11/2025	2025	2568	11	พฤศจิกายน	พ.ย.	1	เสาร์	6	Q4	t
7725	2025-11-02	02/11/2025	2025	2568	11	พฤศจิกายน	พ.ย.	2	อาทิตย์	7	Q4	t
7726	2025-11-03	03/11/2025	2025	2568	11	พฤศจิกายน	พ.ย.	3	จันทร์	1	Q4	f
7727	2025-11-04	04/11/2025	2025	2568	11	พฤศจิกายน	พ.ย.	4	อังคาร	2	Q4	f
7728	2025-11-05	05/11/2025	2025	2568	11	พฤศจิกายน	พ.ย.	5	พุธ	3	Q4	f
7729	2025-11-06	06/11/2025	2025	2568	11	พฤศจิกายน	พ.ย.	6	พฤหัสบดี	4	Q4	f
7730	2025-11-07	07/11/2025	2025	2568	11	พฤศจิกายน	พ.ย.	7	ศุกร์	5	Q4	f
7731	2025-11-08	08/11/2025	2025	2568	11	พฤศจิกายน	พ.ย.	8	เสาร์	6	Q4	t
7732	2025-11-09	09/11/2025	2025	2568	11	พฤศจิกายน	พ.ย.	9	อาทิตย์	7	Q4	t
7733	2025-11-10	10/11/2025	2025	2568	11	พฤศจิกายน	พ.ย.	10	จันทร์	1	Q4	f
7734	2025-11-11	11/11/2025	2025	2568	11	พฤศจิกายน	พ.ย.	11	อังคาร	2	Q4	f
7735	2025-11-12	12/11/2025	2025	2568	11	พฤศจิกายน	พ.ย.	12	พุธ	3	Q4	f
7736	2025-11-13	13/11/2025	2025	2568	11	พฤศจิกายน	พ.ย.	13	พฤหัสบดี	4	Q4	f
7737	2025-11-14	14/11/2025	2025	2568	11	พฤศจิกายน	พ.ย.	14	ศุกร์	5	Q4	f
7738	2025-11-15	15/11/2025	2025	2568	11	พฤศจิกายน	พ.ย.	15	เสาร์	6	Q4	t
7739	2025-11-16	16/11/2025	2025	2568	11	พฤศจิกายน	พ.ย.	16	อาทิตย์	7	Q4	t
7740	2025-11-17	17/11/2025	2025	2568	11	พฤศจิกายน	พ.ย.	17	จันทร์	1	Q4	f
7741	2025-11-18	18/11/2025	2025	2568	11	พฤศจิกายน	พ.ย.	18	อังคาร	2	Q4	f
7742	2025-11-19	19/11/2025	2025	2568	11	พฤศจิกายน	พ.ย.	19	พุธ	3	Q4	f
7743	2025-11-20	20/11/2025	2025	2568	11	พฤศจิกายน	พ.ย.	20	พฤหัสบดี	4	Q4	f
7744	2025-11-21	21/11/2025	2025	2568	11	พฤศจิกายน	พ.ย.	21	ศุกร์	5	Q4	f
7745	2025-11-22	22/11/2025	2025	2568	11	พฤศจิกายน	พ.ย.	22	เสาร์	6	Q4	t
7746	2025-11-23	23/11/2025	2025	2568	11	พฤศจิกายน	พ.ย.	23	อาทิตย์	7	Q4	t
7747	2025-11-24	24/11/2025	2025	2568	11	พฤศจิกายน	พ.ย.	24	จันทร์	1	Q4	f
7748	2025-11-25	25/11/2025	2025	2568	11	พฤศจิกายน	พ.ย.	25	อังคาร	2	Q4	f
7749	2025-11-26	26/11/2025	2025	2568	11	พฤศจิกายน	พ.ย.	26	พุธ	3	Q4	f
7750	2025-11-27	27/11/2025	2025	2568	11	พฤศจิกายน	พ.ย.	27	พฤหัสบดี	4	Q4	f
7751	2025-11-28	28/11/2025	2025	2568	11	พฤศจิกายน	พ.ย.	28	ศุกร์	5	Q4	f
7752	2025-11-29	29/11/2025	2025	2568	11	พฤศจิกายน	พ.ย.	29	เสาร์	6	Q4	t
7753	2025-11-30	30/11/2025	2025	2568	11	พฤศจิกายน	พ.ย.	30	อาทิตย์	7	Q4	t
7754	2025-12-01	01/12/2025	2025	2568	12	ธันวาคม	ธ.ค.	1	จันทร์	1	Q4	f
7755	2025-12-02	02/12/2025	2025	2568	12	ธันวาคม	ธ.ค.	2	อังคาร	2	Q4	f
7756	2025-12-03	03/12/2025	2025	2568	12	ธันวาคม	ธ.ค.	3	พุธ	3	Q4	f
7757	2025-12-04	04/12/2025	2025	2568	12	ธันวาคม	ธ.ค.	4	พฤหัสบดี	4	Q4	f
7758	2025-12-05	05/12/2025	2025	2568	12	ธันวาคม	ธ.ค.	5	ศุกร์	5	Q4	f
7759	2025-12-06	06/12/2025	2025	2568	12	ธันวาคม	ธ.ค.	6	เสาร์	6	Q4	t
7760	2025-12-07	07/12/2025	2025	2568	12	ธันวาคม	ธ.ค.	7	อาทิตย์	7	Q4	t
7761	2025-12-08	08/12/2025	2025	2568	12	ธันวาคม	ธ.ค.	8	จันทร์	1	Q4	f
7762	2025-12-09	09/12/2025	2025	2568	12	ธันวาคม	ธ.ค.	9	อังคาร	2	Q4	f
7763	2025-12-10	10/12/2025	2025	2568	12	ธันวาคม	ธ.ค.	10	พุธ	3	Q4	f
7764	2025-12-11	11/12/2025	2025	2568	12	ธันวาคม	ธ.ค.	11	พฤหัสบดี	4	Q4	f
7765	2025-12-12	12/12/2025	2025	2568	12	ธันวาคม	ธ.ค.	12	ศุกร์	5	Q4	f
7766	2025-12-13	13/12/2025	2025	2568	12	ธันวาคม	ธ.ค.	13	เสาร์	6	Q4	t
7767	2025-12-14	14/12/2025	2025	2568	12	ธันวาคม	ธ.ค.	14	อาทิตย์	7	Q4	t
7768	2025-12-15	15/12/2025	2025	2568	12	ธันวาคม	ธ.ค.	15	จันทร์	1	Q4	f
7769	2025-12-16	16/12/2025	2025	2568	12	ธันวาคม	ธ.ค.	16	อังคาร	2	Q4	f
7771	2025-12-18	18/12/2025	2025	2568	12	ธันวาคม	ธ.ค.	18	พฤหัสบดี	4	Q4	f
7772	2025-12-19	19/12/2025	2025	2568	12	ธันวาคม	ธ.ค.	19	ศุกร์	5	Q4	f
7773	2025-12-20	20/12/2025	2025	2568	12	ธันวาคม	ธ.ค.	20	เสาร์	6	Q4	t
7774	2025-12-21	21/12/2025	2025	2568	12	ธันวาคม	ธ.ค.	21	อาทิตย์	7	Q4	t
7775	2025-12-22	22/12/2025	2025	2568	12	ธันวาคม	ธ.ค.	22	จันทร์	1	Q4	f
7776	2025-12-23	23/12/2025	2025	2568	12	ธันวาคม	ธ.ค.	23	อังคาร	2	Q4	f
7777	2025-12-24	24/12/2025	2025	2568	12	ธันวาคม	ธ.ค.	24	พุธ	3	Q4	f
7778	2025-12-25	25/12/2025	2025	2568	12	ธันวาคม	ธ.ค.	25	พฤหัสบดี	4	Q4	f
7779	2025-12-26	26/12/2025	2025	2568	12	ธันวาคม	ธ.ค.	26	ศุกร์	5	Q4	f
7780	2025-12-27	27/12/2025	2025	2568	12	ธันวาคม	ธ.ค.	27	เสาร์	6	Q4	t
7781	2025-12-28	28/12/2025	2025	2568	12	ธันวาคม	ธ.ค.	28	อาทิตย์	7	Q4	t
7782	2025-12-29	29/12/2025	2025	2568	12	ธันวาคม	ธ.ค.	29	จันทร์	1	Q4	f
7783	2025-12-30	30/12/2025	2025	2568	12	ธันวาคม	ธ.ค.	30	อังคาร	2	Q4	f
7784	2025-12-31	31/12/2025	2025	2568	12	ธันวาคม	ธ.ค.	31	พุธ	3	Q4	f
7785	2026-01-01	01/01/2026	2026	2569	1	มกราคม	ม.ค.	1	พฤหัสบดี	4	Q1	f
7786	2026-01-02	02/01/2026	2026	2569	1	มกราคม	ม.ค.	2	ศุกร์	5	Q1	f
7787	2026-01-03	03/01/2026	2026	2569	1	มกราคม	ม.ค.	3	เสาร์	6	Q1	t
7788	2026-01-04	04/01/2026	2026	2569	1	มกราคม	ม.ค.	4	อาทิตย์	7	Q1	t
7789	2026-01-05	05/01/2026	2026	2569	1	มกราคม	ม.ค.	5	จันทร์	1	Q1	f
7790	2026-01-06	06/01/2026	2026	2569	1	มกราคม	ม.ค.	6	อังคาร	2	Q1	f
7792	2026-01-08	08/01/2026	2026	2569	1	มกราคม	ม.ค.	8	พฤหัสบดี	4	Q1	f
7793	2026-01-09	09/01/2026	2026	2569	1	มกราคม	ม.ค.	9	ศุกร์	5	Q1	f
7794	2026-01-10	10/01/2026	2026	2569	1	มกราคม	ม.ค.	10	เสาร์	6	Q1	t
7795	2026-01-11	11/01/2026	2026	2569	1	มกราคม	ม.ค.	11	อาทิตย์	7	Q1	t
7796	2026-01-12	12/01/2026	2026	2569	1	มกราคม	ม.ค.	12	จันทร์	1	Q1	f
7797	2026-01-13	13/01/2026	2026	2569	1	มกราคม	ม.ค.	13	อังคาร	2	Q1	f
7799	2026-01-15	15/01/2026	2026	2569	1	มกราคม	ม.ค.	15	พฤหัสบดี	4	Q1	f
7800	2026-01-16	16/01/2026	2026	2569	1	มกราคม	ม.ค.	16	ศุกร์	5	Q1	f
7801	2026-01-17	17/01/2026	2026	2569	1	มกราคม	ม.ค.	17	เสาร์	6	Q1	t
7802	2026-01-18	18/01/2026	2026	2569	1	มกราคม	ม.ค.	18	อาทิตย์	7	Q1	t
7803	2026-01-19	19/01/2026	2026	2569	1	มกราคม	ม.ค.	19	จันทร์	1	Q1	f
7804	2026-01-20	20/01/2026	2026	2569	1	มกราคม	ม.ค.	20	อังคาร	2	Q1	f
7805	2026-01-21	21/01/2026	2026	2569	1	มกราคม	ม.ค.	21	พุธ	3	Q1	f
7806	2026-01-22	22/01/2026	2026	2569	1	มกราคม	ม.ค.	22	พฤหัสบดี	4	Q1	f
7807	2026-01-23	23/01/2026	2026	2569	1	มกราคม	ม.ค.	23	ศุกร์	5	Q1	f
7808	2026-01-24	24/01/2026	2026	2569	1	มกราคม	ม.ค.	24	เสาร์	6	Q1	t
7809	2026-01-25	25/01/2026	2026	2569	1	มกราคม	ม.ค.	25	อาทิตย์	7	Q1	t
7810	2026-01-26	26/01/2026	2026	2569	1	มกราคม	ม.ค.	26	จันทร์	1	Q1	f
7811	2026-01-27	27/01/2026	2026	2569	1	มกราคม	ม.ค.	27	อังคาร	2	Q1	f
7812	2026-01-28	28/01/2026	2026	2569	1	มกราคม	ม.ค.	28	พุธ	3	Q1	f
7813	2026-01-29	29/01/2026	2026	2569	1	มกราคม	ม.ค.	29	พฤหัสบดี	4	Q1	f
7814	2026-01-30	30/01/2026	2026	2569	1	มกราคม	ม.ค.	30	ศุกร์	5	Q1	f
7815	2026-01-31	31/01/2026	2026	2569	1	มกราคม	ม.ค.	31	เสาร์	6	Q1	t
7816	2026-02-01	01/02/2026	2026	2569	2	กุมภาพันธ์	ก.พ.	1	อาทิตย์	7	Q1	t
7817	2026-02-02	02/02/2026	2026	2569	2	กุมภาพันธ์	ก.พ.	2	จันทร์	1	Q1	f
7818	2026-02-03	03/02/2026	2026	2569	2	กุมภาพันธ์	ก.พ.	3	อังคาร	2	Q1	f
7819	2026-02-04	04/02/2026	2026	2569	2	กุมภาพันธ์	ก.พ.	4	พุธ	3	Q1	f
7820	2026-02-05	05/02/2026	2026	2569	2	กุมภาพันธ์	ก.พ.	5	พฤหัสบดี	4	Q1	f
7821	2026-02-06	06/02/2026	2026	2569	2	กุมภาพันธ์	ก.พ.	6	ศุกร์	5	Q1	f
7822	2026-02-07	07/02/2026	2026	2569	2	กุมภาพันธ์	ก.พ.	7	เสาร์	6	Q1	t
7823	2026-02-08	08/02/2026	2026	2569	2	กุมภาพันธ์	ก.พ.	8	อาทิตย์	7	Q1	t
7824	2026-02-09	09/02/2026	2026	2569	2	กุมภาพันธ์	ก.พ.	9	จันทร์	1	Q1	f
7825	2026-02-10	10/02/2026	2026	2569	2	กุมภาพันธ์	ก.พ.	10	อังคาร	2	Q1	f
7826	2026-02-11	11/02/2026	2026	2569	2	กุมภาพันธ์	ก.พ.	11	พุธ	3	Q1	f
7827	2026-02-12	12/02/2026	2026	2569	2	กุมภาพันธ์	ก.พ.	12	พฤหัสบดี	4	Q1	f
7828	2026-02-13	13/02/2026	2026	2569	2	กุมภาพันธ์	ก.พ.	13	ศุกร์	5	Q1	f
7829	2026-02-14	14/02/2026	2026	2569	2	กุมภาพันธ์	ก.พ.	14	เสาร์	6	Q1	t
7830	2026-02-15	15/02/2026	2026	2569	2	กุมภาพันธ์	ก.พ.	15	อาทิตย์	7	Q1	t
7831	2026-02-16	16/02/2026	2026	2569	2	กุมภาพันธ์	ก.พ.	16	จันทร์	1	Q1	f
7832	2026-02-17	17/02/2026	2026	2569	2	กุมภาพันธ์	ก.พ.	17	อังคาร	2	Q1	f
7833	2026-02-18	18/02/2026	2026	2569	2	กุมภาพันธ์	ก.พ.	18	พุธ	3	Q1	f
7834	2026-02-19	19/02/2026	2026	2569	2	กุมภาพันธ์	ก.พ.	19	พฤหัสบดี	4	Q1	f
7835	2026-02-20	20/02/2026	2026	2569	2	กุมภาพันธ์	ก.พ.	20	ศุกร์	5	Q1	f
7836	2026-02-21	21/02/2026	2026	2569	2	กุมภาพันธ์	ก.พ.	21	เสาร์	6	Q1	t
7837	2026-02-22	22/02/2026	2026	2569	2	กุมภาพันธ์	ก.พ.	22	อาทิตย์	7	Q1	t
7838	2026-02-23	23/02/2026	2026	2569	2	กุมภาพันธ์	ก.พ.	23	จันทร์	1	Q1	f
7839	2026-02-24	24/02/2026	2026	2569	2	กุมภาพันธ์	ก.พ.	24	อังคาร	2	Q1	f
7840	2026-02-25	25/02/2026	2026	2569	2	กุมภาพันธ์	ก.พ.	25	พุธ	3	Q1	f
7841	2026-02-26	26/02/2026	2026	2569	2	กุมภาพันธ์	ก.พ.	26	พฤหัสบดี	4	Q1	f
7842	2026-02-27	27/02/2026	2026	2569	2	กุมภาพันธ์	ก.พ.	27	ศุกร์	5	Q1	f
7843	2026-02-28	28/02/2026	2026	2569	2	กุมภาพันธ์	ก.พ.	28	เสาร์	6	Q1	t
7844	2026-03-01	01/03/2026	2026	2569	3	มีนาคม	มี.ค.	1	อาทิตย์	7	Q1	t
7845	2026-03-02	02/03/2026	2026	2569	3	มีนาคม	มี.ค.	2	จันทร์	1	Q1	f
7846	2026-03-03	03/03/2026	2026	2569	3	มีนาคม	มี.ค.	3	อังคาร	2	Q1	f
7847	2026-03-04	04/03/2026	2026	2569	3	มีนาคม	มี.ค.	4	พุธ	3	Q1	f
7848	2026-03-05	05/03/2026	2026	2569	3	มีนาคม	มี.ค.	5	พฤหัสบดี	4	Q1	f
7849	2026-03-06	06/03/2026	2026	2569	3	มีนาคม	มี.ค.	6	ศุกร์	5	Q1	f
7850	2026-03-07	07/03/2026	2026	2569	3	มีนาคม	มี.ค.	7	เสาร์	6	Q1	t
7851	2026-03-08	08/03/2026	2026	2569	3	มีนาคม	มี.ค.	8	อาทิตย์	7	Q1	t
7852	2026-03-09	09/03/2026	2026	2569	3	มีนาคม	มี.ค.	9	จันทร์	1	Q1	f
7853	2026-03-10	10/03/2026	2026	2569	3	มีนาคม	มี.ค.	10	อังคาร	2	Q1	f
7854	2026-03-11	11/03/2026	2026	2569	3	มีนาคม	มี.ค.	11	พุธ	3	Q1	f
7855	2026-03-12	12/03/2026	2026	2569	3	มีนาคม	มี.ค.	12	พฤหัสบดี	4	Q1	f
7856	2026-03-13	13/03/2026	2026	2569	3	มีนาคม	มี.ค.	13	ศุกร์	5	Q1	f
7857	2026-03-14	14/03/2026	2026	2569	3	มีนาคม	มี.ค.	14	เสาร์	6	Q1	t
7858	2026-03-15	15/03/2026	2026	2569	3	มีนาคม	มี.ค.	15	อาทิตย์	7	Q1	t
7859	2026-03-16	16/03/2026	2026	2569	3	มีนาคม	มี.ค.	16	จันทร์	1	Q1	f
7860	2026-03-17	17/03/2026	2026	2569	3	มีนาคม	มี.ค.	17	อังคาร	2	Q1	f
7861	2026-03-18	18/03/2026	2026	2569	3	มีนาคม	มี.ค.	18	พุธ	3	Q1	f
7862	2026-03-19	19/03/2026	2026	2569	3	มีนาคม	มี.ค.	19	พฤหัสบดี	4	Q1	f
7863	2026-03-20	20/03/2026	2026	2569	3	มีนาคม	มี.ค.	20	ศุกร์	5	Q1	f
7864	2026-03-21	21/03/2026	2026	2569	3	มีนาคม	มี.ค.	21	เสาร์	6	Q1	t
7865	2026-03-22	22/03/2026	2026	2569	3	มีนาคม	มี.ค.	22	อาทิตย์	7	Q1	t
7866	2026-03-23	23/03/2026	2026	2569	3	มีนาคม	มี.ค.	23	จันทร์	1	Q1	f
7867	2026-03-24	24/03/2026	2026	2569	3	มีนาคม	มี.ค.	24	อังคาร	2	Q1	f
7868	2026-03-25	25/03/2026	2026	2569	3	มีนาคม	มี.ค.	25	พุธ	3	Q1	f
7869	2026-03-26	26/03/2026	2026	2569	3	มีนาคม	มี.ค.	26	พฤหัสบดี	4	Q1	f
7870	2026-03-27	27/03/2026	2026	2569	3	มีนาคม	มี.ค.	27	ศุกร์	5	Q1	f
7871	2026-03-28	28/03/2026	2026	2569	3	มีนาคม	มี.ค.	28	เสาร์	6	Q1	t
7872	2026-03-29	29/03/2026	2026	2569	3	มีนาคม	มี.ค.	29	อาทิตย์	7	Q1	t
7873	2026-03-30	30/03/2026	2026	2569	3	มีนาคม	มี.ค.	30	จันทร์	1	Q1	f
7874	2026-03-31	31/03/2026	2026	2569	3	มีนาคม	มี.ค.	31	อังคาร	2	Q1	f
7875	2026-04-01	01/04/2026	2026	2569	4	เมษายน	เม.ย.	1	พุธ	3	Q2	f
7876	2026-04-02	02/04/2026	2026	2569	4	เมษายน	เม.ย.	2	พฤหัสบดี	4	Q2	f
7877	2026-04-03	03/04/2026	2026	2569	4	เมษายน	เม.ย.	3	ศุกร์	5	Q2	f
7878	2026-04-04	04/04/2026	2026	2569	4	เมษายน	เม.ย.	4	เสาร์	6	Q2	t
7879	2026-04-05	05/04/2026	2026	2569	4	เมษายน	เม.ย.	5	อาทิตย์	7	Q2	t
7880	2026-04-06	06/04/2026	2026	2569	4	เมษายน	เม.ย.	6	จันทร์	1	Q2	f
7881	2026-04-07	07/04/2026	2026	2569	4	เมษายน	เม.ย.	7	อังคาร	2	Q2	f
7882	2026-04-08	08/04/2026	2026	2569	4	เมษายน	เม.ย.	8	พุธ	3	Q2	f
7883	2026-04-09	09/04/2026	2026	2569	4	เมษายน	เม.ย.	9	พฤหัสบดี	4	Q2	f
7884	2026-04-10	10/04/2026	2026	2569	4	เมษายน	เม.ย.	10	ศุกร์	5	Q2	f
7916	2026-05-12	12/05/2026	2026	2569	5	พฤษภาคม	พ.ค.	12	อังคาร	2	Q2	f
7917	2026-05-13	13/05/2026	2026	2569	5	พฤษภาคม	พ.ค.	13	พุธ	3	Q2	f
7918	2026-05-14	14/05/2026	2026	2569	5	พฤษภาคม	พ.ค.	14	พฤหัสบดี	4	Q2	f
7919	2026-05-15	15/05/2026	2026	2569	5	พฤษภาคม	พ.ค.	15	ศุกร์	5	Q2	f
7934	2026-05-30	30/05/2026	2026	2569	5	พฤษภาคม	พ.ค.	30	เสาร์	6	Q2	t
7935	2026-05-31	31/05/2026	2026	2569	5	พฤษภาคม	พ.ค.	31	อาทิตย์	7	Q2	t
7936	2026-06-01	01/06/2026	2026	2569	6	มิถุนายน	มิ.ย.	1	จันทร์	1	Q2	f
7937	2026-06-02	02/06/2026	2026	2569	6	มิถุนายน	มิ.ย.	2	อังคาร	2	Q2	f
7938	2026-06-03	03/06/2026	2026	2569	6	มิถุนายน	มิ.ย.	3	พุธ	3	Q2	f
7939	2026-06-04	04/06/2026	2026	2569	6	มิถุนายน	มิ.ย.	4	พฤหัสบดี	4	Q2	f
7940	2026-06-05	05/06/2026	2026	2569	6	มิถุนายน	มิ.ย.	5	ศุกร์	5	Q2	f
7941	2026-06-06	06/06/2026	2026	2569	6	มิถุนายน	มิ.ย.	6	เสาร์	6	Q2	t
7942	2026-06-07	07/06/2026	2026	2569	6	มิถุนายน	มิ.ย.	7	อาทิตย์	7	Q2	t
\.


--
-- Data for Name: dim_faculty; Type: TABLE DATA; Schema: public; Owner: admin
--

COPY public.dim_faculty (id, faculty_code, faculty_name_th) FROM stdin;
16	BBA	BBA
17	Dent	Dent
18	Med	Med
1	Normal	Normal
\.


--
-- Data for Name: fact_academic_calendar; Type: TABLE DATA; Schema: public; Owner: admin
--

COPY public.fact_academic_calendar (id, date_id, campus_id, faculty_id, academic_year, semester, week_of_semester, is_academic_day, is_holiday, holiday_name, day_type) FROM stdin;
1	1	1	1	2564	3	1	t	f	\N	วันทำการ
2	2	1	1	2564	3	1	t	f	\N	วันทำการ
3	3	1	1	2564	3	1	t	f	\N	วันทำการ
4	4	1	1	2564	3	1	t	f	\N	วันทำการ
5	5	1	1	2564	3	1	t	f	\N	วันทำการ
6	6	1	1	2564	3	1	f	f	\N	วันหยุด
7	7	1	1	2564	3	1	f	f	\N	วันหยุด
8	8	1	1	2564	3	2	t	f	\N	วันทำการ
9	9	1	1	2564	3	2	t	f	\N	วันทำการ
10	10	1	1	2564	3	2	f	t	วันจักรี	วันหยุดนักขัตฤกษ์
11	11	1	1	2564	3	2	t	f	\N	วันทำการ
12	12	1	1	2564	3	2	t	f	\N	วันทำการ
13	13	1	1	2564	3	2	f	f	\N	วันหยุด
14	14	1	1	2564	3	2	f	f	\N	วันหยุด
15	15	1	1	2564	3	3	t	f	\N	วันทำการ
16	16	1	1	2564	3	3	t	f	\N	วันทำการ
17	17	1	1	2564	3	3	f	t	วันสงกรานต์	วันหยุดนักขัตฤกษ์
18	18	1	1	2564	3	3	f	t	วันสงกรานต์	วันหยุดนักขัตฤกษ์
21	21	1	1	2564	3	3	f	f	\N	วันหยุด
163	1	4	1	2564	3	1	t	f	\N	วันทำการ
164	2	4	1	2564	3	1	t	f	\N	วันทำการ
165	3	4	1	2564	3	1	t	f	\N	วันทำการ
166	4	4	1	2564	3	1	t	f	\N	วันทำการ
167	5	4	1	2564	3	1	t	f	\N	วันทำการ
168	6	4	1	2564	3	1	f	f	\N	วันหยุด
169	7	4	1	2564	3	1	f	f	\N	วันหยุด
170	8	4	1	2564	3	2	t	f	\N	วันทำการ
171	9	4	1	2564	3	2	t	f	\N	วันทำการ
172	10	4	1	2564	3	2	f	t	วันจักรี	วันหยุดนักขัตฤกษ์
173	11	4	1	2564	3	2	t	f	\N	วันทำการ
174	12	4	1	2564	3	2	t	f	\N	วันทำการ
175	13	4	1	2564	3	2	f	f	\N	วันหยุด
176	14	4	1	2564	3	2	f	f	\N	วันหยุด
177	15	4	1	2564	3	3	t	f	\N	วันทำการ
178	16	4	1	2564	3	3	t	f	\N	วันทำการ
179	17	4	1	2564	3	3	f	t	วันสงกรานต์	วันหยุดนักขัตฤกษ์
180	18	4	1	2564	3	3	f	t	วันสงกรานต์	วันหยุดนักขัตฤกษ์
181	19	4	1	2564	3	3	f	t	วันสงกรานต์	วันหยุดนักขัตฤกษ์
182	20	4	1	2564	3	3	f	t	วันวิสาขบูชา	วันหยุดนักขัตฤกษ์
183	21	4	1	2564	3	3	f	f	\N	วันหยุด
184	22	4	1	2564	3	4	t	f	\N	วันทำการ
185	23	4	1	2564	3	4	t	f	\N	วันทำการ
186	24	4	1	2564	3	4	t	f	\N	วันทำการ
187	25	4	1	2564	3	4	t	f	\N	วันทำการ
188	26	4	1	2564	3	4	t	f	\N	วันทำการ
189	27	4	1	2564	3	4	f	f	\N	วันหยุด
190	28	4	1	2564	3	4	f	f	\N	วันหยุด
191	29	4	1	2564	3	5	t	f	\N	วันทำการ
192	30	4	1	2564	3	5	t	f	\N	วันทำการ
193	31	4	1	2564	3	5	t	f	\N	วันทำการ
194	32	4	1	2564	3	5	t	f	\N	วันทำการ
195	33	4	1	2564	3	5	t	f	\N	วันทำการ
196	34	4	1	2564	3	5	f	f	\N	วันหยุด
267	51	5	1	2564	3	8	t	f	\N	วันทำการ
19	19	1	1	2564	3	3	f	t	วันสงกรานต์	วันหยุดนักขัตฤกษ์
20	20	1	1	2564	3	3	f	t	วันวิสาขบูชา	วันหยุดนักขัตฤกษ์
22	22	1	1	2564	3	4	t	f	\N	วันทำการ
23	23	1	1	2564	3	4	t	f	\N	วันทำการ
24	24	1	1	2564	3	4	t	f	\N	วันทำการ
25	25	1	1	2564	3	4	t	f	\N	วันทำการ
26	26	1	1	2564	3	4	t	f	\N	วันทำการ
27	27	1	1	2564	3	4	f	f	\N	วันหยุด
28	28	1	1	2564	3	4	f	f	\N	วันหยุด
29	29	1	1	2564	3	5	t	f	\N	วันทำการ
30	30	1	1	2564	3	5	t	f	\N	วันทำการ
31	31	1	1	2564	3	5	t	f	\N	วันทำการ
32	32	1	1	2564	3	5	t	f	\N	วันทำการ
33	33	1	1	2564	3	5	t	f	\N	วันทำการ
34	34	1	1	2564	3	5	f	f	\N	วันหยุด
35	35	1	1	2564	3	5	f	t	วันแรงงานแห่งชาติ	วันหยุดนักขัตฤกษ์
36	36	1	1	2564	3	6	f	t	วันหยุดชดเชยวันแรงงานแห่งชาติ	วันหยุดนักขัตฤกษ์
37	37	1	1	2564	3	6	t	f	\N	วันทำการ
38	38	1	1	2564	3	6	f	t	วันฉัตรมงคล	วันหยุดนักขัตฤกษ์
39	39	1	1	2564	3	6	t	f	\N	วันทำการ
40	40	1	1	2564	3	6	t	f	\N	วันทำการ
41	41	1	1	2564	3	6	f	f	\N	วันหยุด
42	42	1	1	2564	3	6	f	f	\N	วันหยุด
43	43	1	1	2564	3	7	t	f	\N	วันทำการ
44	44	1	1	2564	3	7	t	f	\N	วันทำการ
45	45	1	1	2564	3	7	t	f	\N	วันทำการ
46	46	1	1	2564	3	7	t	f	\N	วันทำการ
47	47	1	1	2564	3	7	f	t	วันพืชมงคล	วันหยุดนักขัตฤกษ์
48	48	1	1	2564	3	7	f	f	\N	วันหยุด
49	49	1	1	2564	3	7	f	t	วันวิสาขบูชา	วันหยุดนักขัตฤกษ์
50	50	1	1	2564	3	8	f	t	ชดเชยวันวิสาขบูชา	วันหยุดนักขัตฤกษ์
51	51	1	1	2564	3	8	t	f	\N	วันทำการ
52	52	1	1	2564	3	8	t	f	\N	วันทำการ
53	53	1	1	2564	3	8	t	f	\N	วันทำการ
54	54	1	1	2564	3	8	t	f	\N	วันทำการ
197	35	4	1	2564	3	5	f	t	วันแรงงานแห่งชาติ	วันหยุดนักขัตฤกษ์
198	36	4	1	2564	3	6	f	t	วันหยุดชดเชยวันแรงงานแห่งชาติ	วันหยุดนักขัตฤกษ์
199	37	4	1	2564	3	6	t	f	\N	วันทำการ
200	38	4	1	2564	3	6	f	t	วันฉัตรมงคล	วันหยุดนักขัตฤกษ์
201	39	4	1	2564	3	6	t	f	\N	วันทำการ
202	40	4	1	2564	3	6	t	f	\N	วันทำการ
203	41	4	1	2564	3	6	f	f	\N	วันหยุด
204	42	4	1	2564	3	6	f	f	\N	วันหยุด
205	43	4	1	2564	3	7	t	f	\N	วันทำการ
206	44	4	1	2564	3	7	t	f	\N	วันทำการ
207	45	4	1	2564	3	7	t	f	\N	วันทำการ
208	46	4	1	2564	3	7	t	f	\N	วันทำการ
209	47	4	1	2564	3	7	f	t	วันพืชมงคล	วันหยุดนักขัตฤกษ์
210	48	4	1	2564	3	7	f	f	\N	วันหยุด
211	49	4	1	2564	3	7	f	t	วันวิสาขบูชา	วันหยุดนักขัตฤกษ์
212	50	4	1	2564	3	8	f	t	ชดเชยวันวิสาขบูชา	วันหยุดนักขัตฤกษ์
213	51	4	1	2564	3	8	t	f	\N	วันทำการ
214	52	4	1	2564	3	8	t	f	\N	วันทำการ
215	53	4	1	2564	3	8	t	f	\N	วันทำการ
216	54	4	1	2564	3	8	t	f	\N	วันทำการ
217	1	5	1	2564	3	1	t	f	\N	วันทำการ
218	2	5	1	2564	3	1	t	f	\N	วันทำการ
219	3	5	1	2564	3	1	t	f	\N	วันทำการ
220	4	5	1	2564	3	1	t	f	\N	วันทำการ
221	5	5	1	2564	3	1	t	f	\N	วันทำการ
222	6	5	1	2564	3	1	f	f	\N	วันหยุด
223	7	5	1	2564	3	1	f	f	\N	วันหยุด
224	8	5	1	2564	3	2	t	f	\N	วันทำการ
225	9	5	1	2564	3	2	t	f	\N	วันทำการ
226	10	5	1	2564	3	2	f	t	วันจักรี	วันหยุดนักขัตฤกษ์
227	11	5	1	2564	3	2	t	f	\N	วันทำการ
228	12	5	1	2564	3	2	t	f	\N	วันทำการ
229	13	5	1	2564	3	2	f	f	\N	วันหยุด
230	14	5	1	2564	3	2	f	f	\N	วันหยุด
231	15	5	1	2564	3	3	t	f	\N	วันทำการ
232	16	5	1	2564	3	3	t	f	\N	วันทำการ
233	17	5	1	2564	3	3	f	t	วันสงกรานต์	วันหยุดนักขัตฤกษ์
234	18	5	1	2564	3	3	f	t	วันสงกรานต์	วันหยุดนักขัตฤกษ์
235	19	5	1	2564	3	3	f	t	วันสงกรานต์	วันหยุดนักขัตฤกษ์
236	20	5	1	2564	3	3	f	t	วันวิสาขบูชา	วันหยุดนักขัตฤกษ์
237	21	5	1	2564	3	3	f	f	\N	วันหยุด
238	22	5	1	2564	3	4	t	f	\N	วันทำการ
239	23	5	1	2564	3	4	t	f	\N	วันทำการ
240	24	5	1	2564	3	4	t	f	\N	วันทำการ
241	25	5	1	2564	3	4	t	f	\N	วันทำการ
242	26	5	1	2564	3	4	t	f	\N	วันทำการ
243	27	5	1	2564	3	4	f	f	\N	วันหยุด
244	28	5	1	2564	3	4	f	f	\N	วันหยุด
245	29	5	1	2564	3	5	t	f	\N	วันทำการ
246	30	5	1	2564	3	5	t	f	\N	วันทำการ
247	31	5	1	2564	3	5	t	f	\N	วันทำการ
248	32	5	1	2564	3	5	t	f	\N	วันทำการ
249	33	5	1	2564	3	5	t	f	\N	วันทำการ
250	34	5	1	2564	3	5	f	f	\N	วันหยุด
251	35	5	1	2564	3	5	f	t	วันแรงงานแห่งชาติ	วันหยุดนักขัตฤกษ์
252	36	5	1	2564	3	6	f	t	วันหยุดชดเชยวันแรงงานแห่งชาติ	วันหยุดนักขัตฤกษ์
253	37	5	1	2564	3	6	t	f	\N	วันทำการ
254	38	5	1	2564	3	6	f	t	วันฉัตรมงคล	วันหยุดนักขัตฤกษ์
255	39	5	1	2564	3	6	t	f	\N	วันทำการ
256	40	5	1	2564	3	6	t	f	\N	วันทำการ
257	41	5	1	2564	3	6	f	f	\N	วันหยุด
258	42	5	1	2564	3	6	f	f	\N	วันหยุด
259	43	5	1	2564	3	7	t	f	\N	วันทำการ
260	44	5	1	2564	3	7	t	f	\N	วันทำการ
261	45	5	1	2564	3	7	t	f	\N	วันทำการ
262	46	5	1	2564	3	7	t	f	\N	วันทำการ
263	47	5	1	2564	3	7	f	t	วันพืชมงคล	วันหยุดนักขัตฤกษ์
264	48	5	1	2564	3	7	f	f	\N	วันหยุด
265	49	5	1	2564	3	7	f	t	วันวิสาขบูชา	วันหยุดนักขัตฤกษ์
266	50	5	1	2564	3	8	f	t	ชดเชยวันวิสาขบูชา	วันหยุดนักขัตฤกษ์
268	52	5	1	2564	3	8	t	f	\N	วันทำการ
269	53	5	1	2564	3	8	t	f	\N	วันทำการ
270	54	5	1	2564	3	8	t	f	\N	วันทำการ
271	1	6	1	2564	3	1	t	f	\N	วันทำการ
272	2	6	1	2564	3	1	t	f	\N	วันทำการ
273	3	6	1	2564	3	1	t	f	\N	วันทำการ
274	4	6	1	2564	3	1	t	f	\N	วันทำการ
275	5	6	1	2564	3	1	t	f	\N	วันทำการ
276	6	6	1	2564	3	1	f	f	\N	วันหยุด
277	7	6	1	2564	3	1	f	f	\N	วันหยุด
278	8	6	1	2564	3	2	t	f	\N	วันทำการ
279	9	6	1	2564	3	2	t	f	\N	วันทำการ
280	10	6	1	2564	3	2	f	t	วันจักรี	วันหยุดนักขัตฤกษ์
281	11	6	1	2564	3	2	t	f	\N	วันทำการ
282	12	6	1	2564	3	2	t	f	\N	วันทำการ
283	13	6	1	2564	3	2	f	f	\N	วันหยุด
284	14	6	1	2564	3	2	f	f	\N	วันหยุด
285	15	6	1	2564	3	3	t	f	\N	วันทำการ
286	16	6	1	2564	3	3	t	f	\N	วันทำการ
287	17	6	1	2564	3	3	f	t	วันสงกรานต์	วันหยุดนักขัตฤกษ์
288	18	6	1	2564	3	3	f	t	วันสงกรานต์	วันหยุดนักขัตฤกษ์
289	19	6	1	2564	3	3	f	t	วันสงกรานต์	วันหยุดนักขัตฤกษ์
290	20	6	1	2564	3	3	f	t	วันวิสาขบูชา	วันหยุดนักขัตฤกษ์
291	21	6	1	2564	3	3	f	f	\N	วันหยุด
292	22	6	1	2564	3	4	t	f	\N	วันทำการ
293	23	6	1	2564	3	4	t	f	\N	วันทำการ
294	24	6	1	2564	3	4	t	f	\N	วันทำการ
295	25	6	1	2564	3	4	t	f	\N	วันทำการ
296	26	6	1	2564	3	4	t	f	\N	วันทำการ
297	27	6	1	2564	3	4	f	f	\N	วันหยุด
298	28	6	1	2564	3	4	f	f	\N	วันหยุด
299	29	6	1	2564	3	5	t	f	\N	วันทำการ
300	30	6	1	2564	3	5	t	f	\N	วันทำการ
301	31	6	1	2564	3	5	t	f	\N	วันทำการ
302	32	6	1	2564	3	5	t	f	\N	วันทำการ
303	33	6	1	2564	3	5	t	f	\N	วันทำการ
304	34	6	1	2564	3	5	f	f	\N	วันหยุด
305	35	6	1	2564	3	5	f	t	วันแรงงานแห่งชาติ	วันหยุดนักขัตฤกษ์
306	36	6	1	2564	3	6	f	t	วันหยุดชดเชยวันแรงงานแห่งชาติ	วันหยุดนักขัตฤกษ์
307	37	6	1	2564	3	6	t	f	\N	วันทำการ
308	38	6	1	2564	3	6	f	t	วันฉัตรมงคล	วันหยุดนักขัตฤกษ์
309	39	6	1	2564	3	6	t	f	\N	วันทำการ
310	40	6	1	2564	3	6	t	f	\N	วันทำการ
311	41	6	1	2564	3	6	f	f	\N	วันหยุด
312	42	6	1	2564	3	6	f	f	\N	วันหยุด
313	43	6	1	2564	3	7	t	f	\N	วันทำการ
314	44	6	1	2564	3	7	t	f	\N	วันทำการ
315	45	6	1	2564	3	7	t	f	\N	วันทำการ
316	46	6	1	2564	3	7	t	f	\N	วันทำการ
317	47	6	1	2564	3	7	f	t	วันพืชมงคล	วันหยุดนักขัตฤกษ์
318	48	6	1	2564	3	7	f	f	\N	วันหยุด
319	49	6	1	2564	3	7	f	t	วันวิสาขบูชา	วันหยุดนักขัตฤกษ์
320	50	6	1	2564	3	8	f	t	ชดเชยวันวิสาขบูชา	วันหยุดนักขัตฤกษ์
321	51	6	1	2564	3	8	t	f	\N	วันทำการ
322	52	6	1	2564	3	8	t	f	\N	วันทำการ
323	53	6	1	2564	3	8	t	f	\N	วันทำการ
324	54	6	1	2564	3	8	t	f	\N	วันทำการ
325	1	7	1	2564	3	1	t	f	\N	วันทำการ
326	2	7	1	2564	3	1	t	f	\N	วันทำการ
327	3	7	1	2564	3	1	t	f	\N	วันทำการ
328	4	7	1	2564	3	1	t	f	\N	วันทำการ
329	5	7	1	2564	3	1	t	f	\N	วันทำการ
330	6	7	1	2564	3	1	f	f	\N	วันหยุด
331	7	7	1	2564	3	1	f	f	\N	วันหยุด
332	8	7	1	2564	3	2	t	f	\N	วันทำการ
333	9	7	1	2564	3	2	t	f	\N	วันทำการ
334	10	7	1	2564	3	2	f	t	วันจักรี	วันหยุดนักขัตฤกษ์
335	11	7	1	2564	3	2	t	f	\N	วันทำการ
336	12	7	1	2564	3	2	t	f	\N	วันทำการ
337	13	7	1	2564	3	2	f	f	\N	วันหยุด
338	14	7	1	2564	3	2	f	f	\N	วันหยุด
339	15	7	1	2564	3	3	t	f	\N	วันทำการ
340	16	7	1	2564	3	3	t	f	\N	วันทำการ
341	17	7	1	2564	3	3	f	t	วันสงกรานต์	วันหยุดนักขัตฤกษ์
342	18	7	1	2564	3	3	f	t	วันสงกรานต์	วันหยุดนักขัตฤกษ์
343	19	7	1	2564	3	3	f	t	วันสงกรานต์	วันหยุดนักขัตฤกษ์
344	20	7	1	2564	3	3	f	t	วันวิสาขบูชา	วันหยุดนักขัตฤกษ์
345	21	7	1	2564	3	3	f	f	\N	วันหยุด
346	22	7	1	2564	3	4	t	f	\N	วันทำการ
347	23	7	1	2564	3	4	t	f	\N	วันทำการ
348	24	7	1	2564	3	4	t	f	\N	วันทำการ
349	25	7	1	2564	3	4	t	f	\N	วันทำการ
350	26	7	1	2564	3	4	t	f	\N	วันทำการ
351	27	7	1	2564	3	4	f	f	\N	วันหยุด
352	28	7	1	2564	3	4	f	f	\N	วันหยุด
353	29	7	1	2564	3	5	t	f	\N	วันทำการ
354	30	7	1	2564	3	5	t	f	\N	วันทำการ
355	31	7	1	2564	3	5	t	f	\N	วันทำการ
356	32	7	1	2564	3	5	t	f	\N	วันทำการ
357	33	7	1	2564	3	5	t	f	\N	วันทำการ
358	34	7	1	2564	3	5	f	f	\N	วันหยุด
359	35	7	1	2564	3	5	f	t	วันแรงงานแห่งชาติ	วันหยุดนักขัตฤกษ์
360	36	7	1	2564	3	6	f	t	วันหยุดชดเชยวันแรงงานแห่งชาติ	วันหยุดนักขัตฤกษ์
361	37	7	1	2564	3	6	t	f	\N	วันทำการ
362	38	7	1	2564	3	6	f	t	วันฉัตรมงคล	วันหยุดนักขัตฤกษ์
363	39	7	1	2564	3	6	t	f	\N	วันทำการ
364	40	7	1	2564	3	6	t	f	\N	วันทำการ
365	41	7	1	2564	3	6	f	f	\N	วันหยุด
366	42	7	1	2564	3	6	f	f	\N	วันหยุด
367	43	7	1	2564	3	7	t	f	\N	วันทำการ
368	44	7	1	2564	3	7	t	f	\N	วันทำการ
369	45	7	1	2564	3	7	t	f	\N	วันทำการ
370	46	7	1	2564	3	7	t	f	\N	วันทำการ
371	47	7	1	2564	3	7	f	t	วันพืชมงคล	วันหยุดนักขัตฤกษ์
372	48	7	1	2564	3	7	f	f	\N	วันหยุด
373	49	7	1	2564	3	7	f	t	วันวิสาขบูชา	วันหยุดนักขัตฤกษ์
374	50	7	1	2564	3	8	f	t	ชดเชยวันวิสาขบูชา	วันหยุดนักขัตฤกษ์
375	51	7	1	2564	3	8	t	f	\N	วันทำการ
376	52	7	1	2564	3	8	t	f	\N	วันทำการ
377	53	7	1	2564	3	8	t	f	\N	วันทำการ
378	54	7	1	2564	3	8	t	f	\N	วันทำการ
379	379	1	1	2565	3	1	f	t	ชดเชยวันสงกรานต์	วันหยุดนักขัตฤกษ์
380	380	1	1	2565	3	1	t	f	\N	วันทำการ
381	381	1	1	2565	3	1	t	f	\N	วันทำการ
382	382	1	1	2565	3	1	t	f	\N	วันทำการ
383	383	1	1	2565	3	1	t	f	\N	วันทำการ
384	384	1	1	2565	3	1	f	f	\N	วันหยุด
385	385	1	1	2565	3	1	f	f	\N	วันหยุด
386	386	1	1	2565	3	2	t	f	\N	วันทำการ
387	387	1	1	2565	3	2	t	f	\N	วันทำการ
388	388	1	1	2565	3	2	t	f	\N	วันทำการ
389	389	1	1	2565	3	2	t	f	\N	วันทำการ
390	390	1	1	2565	3	2	t	f	\N	วันทำการ
391	391	1	1	2565	3	2	f	f	\N	วันหยุด
392	392	1	1	2565	3	2	f	f	\N	วันหยุด
393	393	1	1	2565	3	3	f	t	วันแรงงานแห่งชาติ	วันหยุดนักขัตฤกษ์
394	394	1	1	2565	3	3	t	f	\N	วันทำการ
395	395	1	1	2565	3	3	t	f	\N	วันทำการ
396	396	1	1	2565	3	3	f	t	วันฉัตรมงคล	วันหยุดนักขัตฤกษ์
397	397	1	1	2565	3	3	f	t	วันฉัตรมงคล	วันหยุดนักขัตฤกษ์
398	398	1	1	2565	3	3	f	f	\N	วันหยุด
399	399	1	1	2565	3	3	f	f	\N	วันหยุด
400	400	1	1	2565	3	4	t	f	\N	วันทำการ
401	401	1	1	2565	3	4	t	f	\N	วันทำการ
402	402	1	1	2565	3	4	f	t	วันรับปริญญา	วันหยุดนักขัตฤกษ์
403	403	1	1	2565	3	4	f	t	วันรับปริญญา	วันหยุดนักขัตฤกษ์
404	404	1	1	2565	3	4	t	f	\N	วันทำการ
405	405	1	1	2565	3	4	f	f	\N	วันหยุด
406	406	1	1	2565	3	4	f	f	\N	วันหยุด
407	407	1	1	2565	3	5	t	f	\N	วันทำการ
408	408	1	1	2565	3	5	t	f	\N	วันทำการ
409	409	1	1	2565	3	5	f	t	วันพืชมงคล	วันหยุดนักขัตฤกษ์
410	410	1	1	2565	3	5	t	f	\N	วันทำการ
411	411	1	1	2565	3	5	t	f	\N	วันทำการ
412	412	1	1	2565	3	5	f	f	\N	วันหยุด
413	413	1	1	2565	3	5	f	f	\N	วันหยุด
414	414	1	1	2565	3	6	t	f	\N	วันทำการ
415	415	1	1	2565	3	6	t	f	\N	วันทำการ
416	416	1	1	2565	3	6	t	f	\N	วันทำการ
417	417	1	1	2565	3	6	t	f	\N	วันทำการ
418	418	1	1	2565	3	6	t	f	\N	วันทำการ
419	419	1	1	2565	3	6	f	f	\N	วันหยุด
420	420	1	1	2565	3	6	f	f	\N	วันหยุด
421	421	1	1	2565	3	7	t	f	\N	วันทำการ
422	422	1	1	2565	3	7	t	f	\N	วันทำการ
423	423	1	1	2565	3	7	t	f	\N	วันทำการ
424	424	1	1	2565	3	7	t	f	\N	วันทำการ
425	425	1	1	2565	3	7	t	f	\N	วันทำการ
426	426	1	1	2565	3	7	f	t	วันเฉลิมฯ พระราชินี	วันหยุดนักขัตฤกษ์
427	427	1	1	2565	3	7	f	f	\N	วันหยุด
428	428	1	1	2565	3	8	f	t	วันหยุดชดเชยวันวิสาขบูชา	วันหยุดนักขัตฤกษ์
429	429	1	1	2565	3	8	t	f	\N	วันทำการ
430	430	1	1	2565	3	8	t	f	\N	วันทำการ
431	431	1	1	2565	3	8	t	f	\N	วันทำการ
432	432	1	1	2565	3	8	t	f	\N	วันทำการ
433	433	1	1	2565	3	8	f	f	\N	วันหยุด
544	379	4	1	2565	3	1	f	t	ชดเชยวันสงกรานต์	วันหยุดนักขัตฤกษ์
545	380	4	1	2565	3	1	t	f	\N	วันทำการ
546	381	4	1	2565	3	1	t	f	\N	วันทำการ
547	382	4	1	2565	3	1	t	f	\N	วันทำการ
548	383	4	1	2565	3	1	t	f	\N	วันทำการ
549	384	4	1	2565	3	1	f	f	\N	วันหยุด
550	385	4	1	2565	3	1	f	f	\N	วันหยุด
551	386	4	1	2565	3	2	t	f	\N	วันทำการ
552	387	4	1	2565	3	2	t	f	\N	วันทำการ
553	388	4	1	2565	3	2	t	f	\N	วันทำการ
554	389	4	1	2565	3	2	t	f	\N	วันทำการ
555	390	4	1	2565	3	2	t	f	\N	วันทำการ
556	391	4	1	2565	3	2	f	f	\N	วันหยุด
557	392	4	1	2565	3	2	f	f	\N	วันหยุด
558	393	4	1	2565	3	3	f	t	วันแรงงานแห่งชาติ	วันหยุดนักขัตฤกษ์
559	394	4	1	2565	3	3	t	f	\N	วันทำการ
560	395	4	1	2565	3	3	t	f	\N	วันทำการ
561	396	4	1	2565	3	3	f	t	วันฉัตรมงคล	วันหยุดนักขัตฤกษ์
562	397	4	1	2565	3	3	f	t	วันฉัตรมงคล	วันหยุดนักขัตฤกษ์
563	398	4	1	2565	3	3	f	f	\N	วันหยุด
564	399	4	1	2565	3	3	f	f	\N	วันหยุด
565	400	4	1	2565	3	4	t	f	\N	วันทำการ
566	401	4	1	2565	3	4	t	f	\N	วันทำการ
567	402	4	1	2565	3	4	t	f	\N	วันทำการ
568	403	4	1	2565	3	4	t	f	\N	วันทำการ
569	404	4	1	2565	3	4	t	f	\N	วันทำการ
570	405	4	1	2565	3	4	f	f	\N	วันหยุด
571	406	4	1	2565	3	4	f	f	\N	วันหยุด
572	407	4	1	2565	3	5	t	f	\N	วันทำการ
573	408	4	1	2565	3	5	t	f	\N	วันทำการ
574	409	4	1	2565	3	5	f	t	วันพืชมงคล	วันหยุดนักขัตฤกษ์
575	410	4	1	2565	3	5	t	f	\N	วันทำการ
576	411	4	1	2565	3	5	t	f	\N	วันทำการ
577	412	4	1	2565	3	5	f	f	\N	วันหยุด
578	413	4	1	2565	3	5	f	f	\N	วันหยุด
579	414	4	1	2565	3	6	t	f	\N	วันทำการ
580	415	4	1	2565	3	6	t	f	\N	วันทำการ
581	416	4	1	2565	3	6	t	f	\N	วันทำการ
582	417	4	1	2565	3	6	t	f	\N	วันทำการ
583	418	4	1	2565	3	6	t	f	\N	วันทำการ
584	419	4	1	2565	3	6	f	f	\N	วันหยุด
585	420	4	1	2565	3	6	f	f	\N	วันหยุด
586	421	4	1	2565	3	7	t	f	\N	วันทำการ
587	422	4	1	2565	3	7	t	f	\N	วันทำการ
588	423	4	1	2565	3	7	t	f	\N	วันทำการ
589	424	4	1	2565	3	7	t	f	\N	วันทำการ
590	425	4	1	2565	3	7	t	f	\N	วันทำการ
591	426	4	1	2565	3	7	f	t	วันเฉลิมฯ พระราชินี	วันหยุดนักขัตฤกษ์
592	427	4	1	2565	3	7	f	f	\N	วันหยุด
593	428	4	1	2565	3	8	f	t	วันหยุดชดเชยวันวิสาขบูชา	วันหยุดนักขัตฤกษ์
594	429	4	1	2565	3	8	t	f	\N	วันทำการ
595	430	4	1	2565	3	8	t	f	\N	วันทำการ
596	431	4	1	2565	3	8	t	f	\N	วันทำการ
597	432	4	1	2565	3	8	t	f	\N	วันทำการ
598	433	4	1	2565	3	8	f	f	\N	วันหยุด
599	379	5	1	2565	3	1	f	t	ชดเชยวันสงกรานต์	วันหยุดนักขัตฤกษ์
600	380	5	1	2565	3	1	t	f	\N	วันทำการ
601	381	5	1	2565	3	1	t	f	\N	วันทำการ
602	382	5	1	2565	3	1	t	f	\N	วันทำการ
603	383	5	1	2565	3	1	t	f	\N	วันทำการ
604	384	5	1	2565	3	1	f	f	\N	วันหยุด
605	385	5	1	2565	3	1	f	f	\N	วันหยุด
606	386	5	1	2565	3	2	t	f	\N	วันทำการ
607	387	5	1	2565	3	2	t	f	\N	วันทำการ
608	388	5	1	2565	3	2	t	f	\N	วันทำการ
609	389	5	1	2565	3	2	t	f	\N	วันทำการ
610	390	5	1	2565	3	2	t	f	\N	วันทำการ
611	391	5	1	2565	3	2	f	f	\N	วันหยุด
612	392	5	1	2565	3	2	f	f	\N	วันหยุด
613	393	5	1	2565	3	3	f	t	วันแรงงานแห่งชาติ	วันหยุดนักขัตฤกษ์
614	394	5	1	2565	3	3	t	f	\N	วันทำการ
615	395	5	1	2565	3	3	t	f	\N	วันทำการ
616	396	5	1	2565	3	3	f	t	วันฉัตรมงคล	วันหยุดนักขัตฤกษ์
617	397	5	1	2565	3	3	f	t	วันฉัตรมงคล	วันหยุดนักขัตฤกษ์
618	398	5	1	2565	3	3	f	f	\N	วันหยุด
619	399	5	1	2565	3	3	f	f	\N	วันหยุด
620	400	5	1	2565	3	4	t	f	\N	วันทำการ
621	401	5	1	2565	3	4	t	f	\N	วันทำการ
622	402	5	1	2565	3	4	t	f	\N	วันทำการ
623	403	5	1	2565	3	4	t	f	\N	วันทำการ
624	404	5	1	2565	3	4	t	f	\N	วันทำการ
625	405	5	1	2565	3	4	f	f	\N	วันหยุด
626	406	5	1	2565	3	4	f	f	\N	วันหยุด
627	407	5	1	2565	3	5	t	f	\N	วันทำการ
628	408	5	1	2565	3	5	t	f	\N	วันทำการ
629	409	5	1	2565	3	5	f	t	วันพืชมงคล	วันหยุดนักขัตฤกษ์
630	410	5	1	2565	3	5	t	f	\N	วันทำการ
631	411	5	1	2565	3	5	t	f	\N	วันทำการ
632	412	5	1	2565	3	5	f	f	\N	วันหยุด
633	413	5	1	2565	3	5	f	f	\N	วันหยุด
634	414	5	1	2565	3	6	t	f	\N	วันทำการ
635	415	5	1	2565	3	6	t	f	\N	วันทำการ
636	416	5	1	2565	3	6	t	f	\N	วันทำการ
637	417	5	1	2565	3	6	t	f	\N	วันทำการ
638	418	5	1	2565	3	6	t	f	\N	วันทำการ
639	419	5	1	2565	3	6	f	f	\N	วันหยุด
640	420	5	1	2565	3	6	f	f	\N	วันหยุด
641	421	5	1	2565	3	7	t	f	\N	วันทำการ
642	422	5	1	2565	3	7	t	f	\N	วันทำการ
643	423	5	1	2565	3	7	t	f	\N	วันทำการ
644	424	5	1	2565	3	7	t	f	\N	วันทำการ
645	425	5	1	2565	3	7	t	f	\N	วันทำการ
646	426	5	1	2565	3	7	f	t	วันเฉลิมฯ พระราชินี	วันหยุดนักขัตฤกษ์
647	427	5	1	2565	3	7	f	f	\N	วันหยุด
648	428	5	1	2565	3	8	f	t	วันหยุดชดเชยวันวิสาขบูชา	วันหยุดนักขัตฤกษ์
649	429	5	1	2565	3	8	t	f	\N	วันทำการ
650	430	5	1	2565	3	8	t	f	\N	วันทำการ
651	431	5	1	2565	3	8	t	f	\N	วันทำการ
652	432	5	1	2565	3	8	t	f	\N	วันทำการ
653	433	5	1	2565	3	8	f	f	\N	วันหยุด
654	379	6	1	2565	3	1	f	t	ชดเชยวันสงกรานต์	วันหยุดนักขัตฤกษ์
655	380	6	1	2565	3	1	t	f	\N	วันทำการ
656	381	6	1	2565	3	1	t	f	\N	วันทำการ
657	382	6	1	2565	3	1	t	f	\N	วันทำการ
658	383	6	1	2565	3	1	t	f	\N	วันทำการ
659	384	6	1	2565	3	1	f	f	\N	วันหยุด
660	385	6	1	2565	3	1	f	f	\N	วันหยุด
661	386	6	1	2565	3	2	t	f	\N	วันทำการ
662	387	6	1	2565	3	2	t	f	\N	วันทำการ
663	388	6	1	2565	3	2	t	f	\N	วันทำการ
664	389	6	1	2565	3	2	t	f	\N	วันทำการ
665	390	6	1	2565	3	2	t	f	\N	วันทำการ
666	391	6	1	2565	3	2	f	f	\N	วันหยุด
667	392	6	1	2565	3	2	f	f	\N	วันหยุด
668	393	6	1	2565	3	3	f	t	วันแรงงานแห่งชาติ	วันหยุดนักขัตฤกษ์
669	394	6	1	2565	3	3	t	f	\N	วันทำการ
670	395	6	1	2565	3	3	t	f	\N	วันทำการ
671	396	6	1	2565	3	3	f	t	วันฉัตรมงคล	วันหยุดนักขัตฤกษ์
672	397	6	1	2565	3	3	f	t	วันฉัตรมงคล	วันหยุดนักขัตฤกษ์
673	398	6	1	2565	3	3	f	f	\N	วันหยุด
674	399	6	1	2565	3	3	f	f	\N	วันหยุด
675	400	6	1	2565	3	4	t	f	\N	วันทำการ
676	401	6	1	2565	3	4	t	f	\N	วันทำการ
677	402	6	1	2565	3	4	t	f	\N	วันทำการ
678	403	6	1	2565	3	4	t	f	\N	วันทำการ
679	404	6	1	2565	3	4	t	f	\N	วันทำการ
680	405	6	1	2565	3	4	f	f	\N	วันหยุด
681	406	6	1	2565	3	4	f	f	\N	วันหยุด
682	407	6	1	2565	3	5	t	f	\N	วันทำการ
683	408	6	1	2565	3	5	t	f	\N	วันทำการ
684	409	6	1	2565	3	5	f	t	วันพืชมงคล	วันหยุดนักขัตฤกษ์
685	410	6	1	2565	3	5	t	f	\N	วันทำการ
686	411	6	1	2565	3	5	t	f	\N	วันทำการ
687	412	6	1	2565	3	5	f	f	\N	วันหยุด
688	413	6	1	2565	3	5	f	f	\N	วันหยุด
689	414	6	1	2565	3	6	t	f	\N	วันทำการ
690	415	6	1	2565	3	6	t	f	\N	วันทำการ
691	416	6	1	2565	3	6	t	f	\N	วันทำการ
692	417	6	1	2565	3	6	t	f	\N	วันทำการ
693	418	6	1	2565	3	6	t	f	\N	วันทำการ
694	419	6	1	2565	3	6	f	f	\N	วันหยุด
695	420	6	1	2565	3	6	f	f	\N	วันหยุด
696	421	6	1	2565	3	7	t	f	\N	วันทำการ
697	422	6	1	2565	3	7	t	f	\N	วันทำการ
698	423	6	1	2565	3	7	t	f	\N	วันทำการ
699	424	6	1	2565	3	7	t	f	\N	วันทำการ
700	425	6	1	2565	3	7	t	f	\N	วันทำการ
701	426	6	1	2565	3	7	f	t	วันเฉลิมฯ พระราชินี	วันหยุดนักขัตฤกษ์
702	427	6	1	2565	3	7	f	f	\N	วันหยุด
703	428	6	1	2565	3	8	f	t	วันหยุดชดเชยวันวิสาขบูชา	วันหยุดนักขัตฤกษ์
704	429	6	1	2565	3	8	t	f	\N	วันทำการ
705	430	6	1	2565	3	8	t	f	\N	วันทำการ
706	431	6	1	2565	3	8	t	f	\N	วันทำการ
707	432	6	1	2565	3	8	t	f	\N	วันทำการ
708	433	6	1	2565	3	8	f	f	\N	วันหยุด
709	379	7	1	2565	3	1	f	t	ชดเชยวันสงกรานต์	วันหยุดนักขัตฤกษ์
710	380	7	1	2565	3	1	t	f	\N	วันทำการ
711	381	7	1	2565	3	1	t	f	\N	วันทำการ
712	382	7	1	2565	3	1	t	f	\N	วันทำการ
713	383	7	1	2565	3	1	t	f	\N	วันทำการ
714	384	7	1	2565	3	1	f	f	\N	วันหยุด
715	385	7	1	2565	3	1	f	f	\N	วันหยุด
716	386	7	1	2565	3	2	t	f	\N	วันทำการ
717	387	7	1	2565	3	2	t	f	\N	วันทำการ
718	388	7	1	2565	3	2	t	f	\N	วันทำการ
719	389	7	1	2565	3	2	t	f	\N	วันทำการ
720	390	7	1	2565	3	2	t	f	\N	วันทำการ
721	391	7	1	2565	3	2	f	f	\N	วันหยุด
722	392	7	1	2565	3	2	f	f	\N	วันหยุด
723	393	7	1	2565	3	3	f	t	วันแรงงานแห่งชาติ	วันหยุดนักขัตฤกษ์
724	394	7	1	2565	3	3	t	f	\N	วันทำการ
725	395	7	1	2565	3	3	t	f	\N	วันทำการ
726	396	7	1	2565	3	3	f	t	วันฉัตรมงคล	วันหยุดนักขัตฤกษ์
727	397	7	1	2565	3	3	f	t	วันฉัตรมงคล	วันหยุดนักขัตฤกษ์
728	398	7	1	2565	3	3	f	f	\N	วันหยุด
729	399	7	1	2565	3	3	f	f	\N	วันหยุด
730	400	7	1	2565	3	4	t	f	\N	วันทำการ
731	401	7	1	2565	3	4	t	f	\N	วันทำการ
732	402	7	1	2565	3	4	t	f	\N	วันทำการ
733	403	7	1	2565	3	4	t	f	\N	วันทำการ
734	404	7	1	2565	3	4	t	f	\N	วันทำการ
735	405	7	1	2565	3	4	f	f	\N	วันหยุด
736	406	7	1	2565	3	4	f	f	\N	วันหยุด
737	407	7	1	2565	3	5	t	f	\N	วันทำการ
738	408	7	1	2565	3	5	t	f	\N	วันทำการ
739	409	7	1	2565	3	5	f	t	วันพืชมงคล	วันหยุดนักขัตฤกษ์
740	410	7	1	2565	3	5	t	f	\N	วันทำการ
741	411	7	1	2565	3	5	t	f	\N	วันทำการ
742	412	7	1	2565	3	5	f	f	\N	วันหยุด
743	413	7	1	2565	3	5	f	f	\N	วันหยุด
744	414	7	1	2565	3	6	t	f	\N	วันทำการ
745	415	7	1	2565	3	6	t	f	\N	วันทำการ
746	416	7	1	2565	3	6	t	f	\N	วันทำการ
747	417	7	1	2565	3	6	t	f	\N	วันทำการ
748	418	7	1	2565	3	6	t	f	\N	วันทำการ
749	419	7	1	2565	3	6	f	f	\N	วันหยุด
750	420	7	1	2565	3	6	f	f	\N	วันหยุด
751	421	7	1	2565	3	7	t	f	\N	วันทำการ
752	422	7	1	2565	3	7	t	f	\N	วันทำการ
753	423	7	1	2565	3	7	t	f	\N	วันทำการ
754	424	7	1	2565	3	7	t	f	\N	วันทำการ
755	425	7	1	2565	3	7	t	f	\N	วันทำการ
756	426	7	1	2565	3	7	f	t	วันเฉลิมฯ พระราชินี	วันหยุดนักขัตฤกษ์
757	427	7	1	2565	3	7	f	f	\N	วันหยุด
758	428	7	1	2565	3	8	f	t	วันหยุดชดเชยวันวิสาขบูชา	วันหยุดนักขัตฤกษ์
759	429	7	1	2565	3	8	t	f	\N	วันทำการ
760	430	7	1	2565	3	8	t	f	\N	วันทำการ
761	431	7	1	2565	3	8	t	f	\N	วันทำการ
762	432	7	1	2565	3	8	t	f	\N	วันทำการ
763	433	7	1	2565	3	8	f	f	\N	วันหยุด
1113	806	1	16	2566	1	1	t	f	\N	วันทำการ
1114	807	1	16	2566	1	1	t	f	\N	วันทำการ
1115	808	1	16	2566	1	1	t	f	\N	วันทำการ
1116	809	1	16	2566	1	1	t	f	\N	วันทำการ
1117	810	1	16	2566	1	1	t	f	\N	วันทำการ
1118	811	1	16	2566	1	1	f	t	วันแม่แห่งชาติ	วันหยุดนักขัตฤกษ์
1119	812	1	16	2566	1	1	f	f	\N	วันหยุด
1120	813	1	16	2566	1	2	f	t	ชดเชยวันแม่แห่งชาติ	วันหยุดนักขัตฤกษ์
1121	814	1	16	2566	1	2	t	f	\N	วันทำการ
1122	815	1	16	2566	1	2	t	f	\N	วันทำการ
1123	816	1	16	2566	1	2	t	f	\N	วันทำการ
1124	817	1	16	2566	1	2	t	f	\N	วันทำการ
1125	818	1	16	2566	1	2	f	f	\N	วันหยุด
1126	819	1	16	2566	1	2	f	f	\N	วันหยุด
1127	820	1	16	2566	1	3	t	f	\N	วันทำการ
1128	821	1	16	2566	1	3	t	f	\N	วันทำการ
1129	822	1	16	2566	1	3	t	f	\N	วันทำการ
1130	823	1	16	2566	1	3	t	f	\N	วันทำการ
1131	824	1	16	2566	1	3	t	f	\N	วันทำการ
1132	825	1	16	2566	1	3	f	f	\N	วันหยุด
1133	826	1	16	2566	1	3	f	f	\N	วันหยุด
1134	827	1	16	2566	1	4	t	f	\N	วันทำการ
1135	828	1	16	2566	1	4	t	f	\N	วันทำการ
1136	829	1	16	2566	1	4	t	f	\N	วันทำการ
1137	830	1	16	2566	1	4	t	f	\N	วันทำการ
1138	831	1	16	2566	1	4	t	f	\N	วันทำการ
1139	832	1	16	2566	1	4	f	f	\N	วันหยุด
1140	833	1	16	2566	1	4	f	f	\N	วันหยุด
1141	834	1	16	2566	1	5	t	f	\N	วันทำการ
1142	835	1	16	2566	1	5	t	f	\N	วันทำการ
1143	836	1	16	2566	1	5	t	f	\N	วันทำการ
1144	837	1	16	2566	1	5	t	f	\N	วันทำการ
1145	838	1	16	2566	1	5	t	f	\N	วันทำการ
1146	839	1	16	2566	1	5	f	f	\N	วันหยุด
1147	840	1	16	2566	1	5	f	f	\N	วันหยุด
1148	841	1	16	2566	1	6	t	f	\N	วันทำการ
1149	842	1	16	2566	1	6	t	f	\N	วันทำการ
1150	843	1	16	2566	1	6	t	f	\N	วันทำการ
1151	844	1	16	2566	1	6	t	f	\N	วันทำการ
1152	845	1	16	2566	1	6	t	f	\N	วันทำการ
1153	846	1	16	2566	1	6	f	f	\N	วันหยุด
1154	847	1	16	2566	1	6	f	f	\N	วันหยุด
1155	848	1	16	2566	1	7	t	f	\N	วันทำการ
1156	849	1	16	2566	1	7	t	f	\N	วันทำการ
1157	850	1	16	2566	1	7	t	f	\N	วันทำการ
1158	851	1	16	2566	1	7	t	f	\N	วันทำการ
1159	852	1	16	2566	1	7	f	t	วันสงขลานครินทร์	วันหยุดนักขัตฤกษ์
1160	853	1	16	2566	1	7	f	f	\N	วันหยุด
1161	854	1	16	2566	1	7	f	f	\N	วันหยุด
1162	855	1	16	2566	1	8	t	f	\N	วันทำการ
1163	856	1	16	2566	1	8	t	f	\N	วันทำการ
1164	857	1	16	2566	1	8	t	f	\N	วันทำการ
1165	858	1	16	2566	1	8	t	f	\N	วันทำการ
1166	859	1	16	2566	1	8	t	f	\N	วันทำการ
1167	860	1	16	2566	1	8	f	f	\N	วันหยุด
1168	861	1	16	2566	1	8	f	f	\N	วันหยุด
1169	862	1	16	2566	1	9	t	f	\N	วันทำการ
1170	863	1	16	2566	1	9	t	f	\N	วันทำการ
1171	864	1	16	2566	1	9	t	f	\N	วันทำการ
1172	865	1	16	2566	1	9	t	f	\N	วันทำการ
1173	866	1	16	2566	1	9	t	f	\N	วันทำการ
1174	867	1	16	2566	1	9	f	f	\N	วันหยุด
1175	868	1	16	2566	1	9	f	f	\N	วันหยุด
1176	869	1	16	2566	1	10	t	f	\N	วันทำการ
1177	870	1	16	2566	1	10	t	f	\N	วันทำการ
1178	871	1	16	2566	1	10	t	f	\N	วันทำการ
1179	872	1	16	2566	1	10	t	f	\N	วันทำการ
1180	873	1	16	2566	1	10	f	t	วันนวมินทรมหาราช	วันหยุดนักขัตฤกษ์
1181	874	1	16	2566	1	10	f	f	\N	วันหยุด
1182	875	1	16	2566	1	10	f	f	\N	วันหยุด
1183	876	1	16	2566	1	11	t	f	\N	วันทำการ
1184	877	1	16	2566	1	11	t	f	\N	วันทำการ
1185	878	1	16	2566	1	11	t	f	\N	วันทำการ
1186	879	1	16	2566	1	11	t	f	\N	วันทำการ
1187	880	1	16	2566	1	11	t	f	\N	วันทำการ
1188	881	1	16	2566	1	11	f	f	\N	วันหยุด
1189	882	1	16	2566	1	11	f	f	\N	วันหยุด
1190	883	1	16	2566	1	12	f	t	วันปิยมหาราช	วันหยุดนักขัตฤกษ์
1191	884	1	16	2566	1	12	t	f	\N	วันทำการ
1192	885	1	16	2566	1	12	t	f	\N	วันทำการ
1193	886	1	16	2566	1	12	t	f	\N	วันทำการ
1194	887	1	16	2566	1	12	t	f	\N	วันทำการ
1195	888	1	16	2566	1	12	f	f	\N	วันหยุด
1196	889	1	16	2566	1	12	f	f	\N	วันหยุด
1197	890	1	16	2566	1	13	t	f	\N	วันทำการ
1198	891	1	16	2566	1	13	t	f	\N	วันทำการ
1199	892	1	16	2566	1	13	t	f	\N	วันทำการ
1200	893	1	16	2566	1	13	t	f	\N	วันทำการ
1201	894	1	16	2566	1	13	t	f	\N	วันทำการ
1202	895	1	16	2566	1	13	f	f	\N	วันหยุด
1203	896	1	16	2566	1	13	f	f	\N	วันหยุด
1204	897	1	16	2566	1	14	t	f	\N	วันทำการ
1205	898	1	16	2566	1	14	t	f	\N	วันทำการ
1206	899	1	16	2566	1	14	t	f	\N	วันทำการ
1207	900	1	16	2566	1	14	t	f	\N	วันทำการ
1208	901	1	16	2566	1	14	t	f	\N	วันทำการ
1209	902	1	16	2566	1	14	f	f	\N	วันหยุด
1210	903	1	16	2566	1	14	f	f	\N	วันหยุด
1211	904	1	16	2566	1	15	t	f	\N	วันทำการ
1212	905	1	16	2566	1	15	t	f	\N	วันทำการ
1213	906	1	16	2566	1	15	t	f	\N	วันทำการ
1214	907	1	16	2566	1	15	t	f	\N	วันทำการ
1215	908	1	16	2566	1	15	t	f	\N	วันทำการ
1216	909	1	16	2566	1	15	f	f	\N	วันหยุด
1217	910	1	16	2566	1	15	f	f	\N	วันหยุด
1218	911	1	16	2566	1	16	t	f	\N	วันทำการ
1219	912	1	16	2566	1	16	t	f	\N	วันทำการ
1220	913	1	16	2566	1	16	t	f	\N	วันทำการ
1221	914	1	16	2566	1	16	t	f	\N	วันทำการ
1222	915	1	16	2566	1	16	t	f	\N	วันทำการ
1223	916	1	16	2566	1	16	f	f	\N	วันหยุด
1224	917	1	16	2566	1	16	f	f	\N	วันหยุด
1225	918	1	16	2566	1	17	t	f	\N	วันทำการ
1226	919	1	16	2566	1	17	t	f	\N	วันทำการ
1227	920	1	16	2566	1	17	t	f	\N	วันทำการ
1228	921	1	16	2566	1	17	t	f	\N	วันทำการ
1229	922	1	16	2566	1	17	t	f	\N	วันทำการ
1230	923	1	16	2566	1	17	f	f	\N	วันหยุด
1231	924	1	16	2566	1	17	f	f	\N	วันหยุด
1232	925	1	16	2566	1	18	t	f	\N	วันทำการ
1233	926	1	16	2566	1	18	f	t	วันพ่อแห่งชาติ	วันหยุดนักขัตฤกษ์
1234	927	1	16	2566	1	18	t	f	\N	วันทำการ
1235	928	1	16	2566	1	18	t	f	\N	วันทำการ
1236	929	1	16	2566	\N	\N	f	f	\N	ปิดภาค
1237	930	1	16	2566	\N	\N	f	f	\N	วันหยุด
1238	931	1	16	2566	\N	\N	f	t	วันรัฐธรรมนูญ	วันหยุดนักขัตฤกษ์
1239	932	1	16	2566	\N	\N	f	t	ชดเชยวันรัฐธรรมนูญ	วันหยุดนักขัตฤกษ์
1240	933	1	16	2566	\N	\N	f	f	\N	ปิดภาค
1241	934	1	16	2566	\N	\N	f	f	\N	ปิดภาค
1242	935	1	16	2566	\N	\N	f	f	\N	ปิดภาค
1243	936	1	16	2566	\N	\N	f	f	\N	ปิดภาค
1244	937	1	16	2566	\N	\N	f	f	\N	วันหยุด
1245	938	1	16	2566	\N	\N	f	f	\N	วันหยุด
1246	939	1	16	2566	\N	\N	f	f	\N	ปิดภาค
1247	940	1	16	2566	\N	\N	f	f	\N	ปิดภาค
1248	941	1	16	2566	\N	\N	f	f	\N	ปิดภาค
1249	942	1	16	2566	\N	\N	f	f	\N	ปิดภาค
1250	943	1	16	2566	\N	\N	f	f	\N	ปิดภาค
1251	944	1	16	2566	\N	\N	f	f	\N	วันหยุด
1252	945	1	16	2566	\N	\N	f	t	วันคริสต์มาสอีฟ	วันหยุดนักขัตฤกษ์
1253	946	1	16	2566	\N	\N	f	t	วันคริสต์มาส	วันหยุดนักขัตฤกษ์
1254	947	1	16	2566	\N	\N	f	f	\N	ปิดภาค
1255	948	1	16	2566	\N	\N	f	f	\N	ปิดภาค
1256	949	1	16	2566	\N	\N	f	f	\N	ปิดภาค
1257	950	1	16	2566	\N	\N	f	t	วันหยุดราชการธันวาคม	วันหยุดนักขัตฤกษ์
1258	951	1	16	2566	\N	\N	f	f	\N	วันหยุด
1259	952	1	16	2566	\N	\N	f	t	วันสิ้นปี	วันหยุดนักขัตฤกษ์
1260	953	1	16	2566	\N	\N	f	t	วันขึ้นปีใหม่	วันหยุดนักขัตฤกษ์
1261	954	1	16	2566	\N	\N	f	f	\N	ปิดภาค
1262	955	1	16	2566	2	1	t	f	\N	วันทำการ
1263	956	1	16	2566	2	1	t	f	\N	วันทำการ
1264	957	1	16	2566	2	1	t	f	\N	วันทำการ
1265	958	1	16	2566	2	1	f	f	\N	วันหยุด
1266	959	1	16	2566	2	1	f	f	\N	วันหยุด
1267	960	1	16	2566	2	2	t	f	\N	วันทำการ
1268	961	1	16	2566	2	2	t	f	\N	วันทำการ
1269	962	1	16	2566	2	2	t	f	\N	วันทำการ
1270	963	1	16	2566	2	2	t	f	\N	วันทำการ
1271	964	1	16	2566	2	2	t	f	\N	วันทำการ
1272	965	1	16	2566	2	2	f	f	\N	วันหยุด
1273	966	1	16	2566	2	2	f	f	\N	วันหยุด
1274	967	1	16	2566	2	3	t	f	\N	วันทำการ
1275	968	1	16	2566	2	3	t	f	\N	วันทำการ
1276	969	1	16	2566	2	3	t	f	\N	วันทำการ
1277	970	1	16	2566	2	3	t	f	\N	วันทำการ
1278	971	1	16	2566	2	3	t	f	\N	วันทำการ
1279	972	1	16	2566	2	3	f	f	\N	วันหยุด
1280	973	1	16	2566	2	3	f	f	\N	วันหยุด
1281	974	1	16	2566	2	4	t	f	\N	วันทำการ
1282	975	1	16	2566	2	4	t	f	\N	วันทำการ
1283	976	1	16	2566	2	4	t	f	\N	วันทำการ
1284	977	1	16	2566	2	4	f	t	วันมาฆบูชา	วันหยุดนักขัตฤกษ์
1285	978	1	16	2566	2	4	t	f	\N	วันทำการ
1286	979	1	16	2566	2	4	f	f	\N	วันหยุด
1287	980	1	16	2566	2	4	f	f	\N	วันหยุด
1288	981	1	16	2566	2	5	t	f	\N	วันทำการ
1289	982	1	16	2566	2	5	t	f	\N	วันทำการ
1290	983	1	16	2566	2	5	t	f	\N	วันทำการ
1291	984	1	16	2566	2	5	t	f	\N	วันทำการ
1292	985	1	16	2566	2	5	t	f	\N	วันทำการ
1293	986	1	16	2566	2	5	f	f	\N	วันหยุด
1294	987	1	16	2566	2	5	f	f	\N	วันหยุด
1295	988	1	16	2566	2	6	t	f	\N	วันทำการ
1296	989	1	16	2566	2	6	t	f	\N	วันทำการ
1297	990	1	16	2566	2	6	t	f	\N	วันทำการ
1298	991	1	16	2566	2	6	t	f	\N	วันทำการ
1299	992	1	16	2566	2	6	t	f	\N	วันทำการ
1300	993	1	16	2566	2	6	f	t	วันตรุษจีน	วันหยุดนักขัตฤกษ์
1301	994	1	16	2566	2	6	f	t	วันตรุษจีน (วันที่ 2)	วันหยุดนักขัตฤกษ์
1302	995	1	16	2566	2	7	f	t	วันตรุษจีน (วันที่ 3)	วันหยุดนักขัตฤกษ์
1303	996	1	16	2566	2	7	t	f	\N	วันทำการ
1304	997	1	16	2566	2	7	f	t	วันวาเลนไทน์	วันหยุดนักขัตฤกษ์
1305	998	1	16	2566	2	7	t	f	\N	วันทำการ
1306	999	1	16	2566	2	7	t	f	\N	วันทำการ
1307	1000	1	16	2566	2	7	f	f	\N	วันหยุด
1308	1001	1	16	2566	2	7	f	f	\N	วันหยุด
1309	1002	1	16	2566	2	8	t	f	\N	วันทำการ
1310	1003	1	16	2566	2	8	t	f	\N	วันทำการ
1311	1004	1	16	2566	2	8	t	f	\N	วันทำการ
1312	1005	1	16	2566	2	8	t	f	\N	วันทำการ
1313	1006	1	16	2566	2	8	t	f	\N	วันทำการ
1314	1007	1	16	2566	2	8	f	t	วันมาฆบูชา	วันหยุดนักขัตฤกษ์
1315	1008	1	16	2566	2	8	f	f	\N	วันหยุด
1316	1009	1	16	2566	2	9	f	t	วันหยุดชดเชยวันมาฆบูชา	วันหยุดนักขัตฤกษ์
1317	1010	1	16	2566	2	9	t	f	\N	วันทำการ
1318	1011	1	16	2566	2	9	t	f	\N	วันทำการ
1319	1012	1	16	2566	2	9	t	f	\N	วันทำการ
1320	1013	1	16	2566	2	9	t	f	\N	วันทำการ
1321	1014	1	16	2566	2	9	f	f	\N	วันหยุด
1322	1015	1	16	2566	2	9	f	f	\N	วันหยุด
1323	1016	1	16	2566	2	10	t	f	\N	วันทำการ
1324	1017	1	16	2566	2	10	t	f	\N	วันทำการ
1325	1018	1	16	2566	2	10	t	f	\N	วันทำการ
1326	1019	1	16	2566	2	10	t	f	\N	วันทำการ
1327	1020	1	16	2566	2	10	t	f	\N	วันทำการ
1328	1021	1	16	2566	2	10	f	f	\N	วันหยุด
1329	1022	1	16	2566	2	10	f	f	\N	วันหยุด
1330	1023	1	16	2566	2	11	t	f	\N	วันทำการ
1331	1024	1	16	2566	2	11	t	f	\N	วันทำการ
1332	1025	1	16	2566	2	11	t	f	\N	วันทำการ
1333	1026	1	16	2566	2	11	t	f	\N	วันทำการ
1334	1027	1	16	2566	2	11	t	f	\N	วันทำการ
1335	1028	1	16	2566	2	11	f	f	\N	วันหยุด
1336	1029	1	16	2566	2	11	f	f	\N	วันหยุด
1337	1030	1	16	2566	2	12	t	f	\N	วันทำการ
1338	1031	1	16	2566	2	12	t	f	\N	วันทำการ
1339	1032	1	16	2566	2	12	t	f	\N	วันทำการ
1340	1033	1	16	2566	2	12	t	f	\N	วันทำการ
1341	1034	1	16	2566	2	12	t	f	\N	วันทำการ
1342	1035	1	16	2566	2	12	f	f	\N	วันหยุด
1343	1036	1	16	2566	2	12	f	f	\N	วันหยุด
1344	1037	1	16	2566	2	13	t	f	\N	วันทำการ
1345	1038	1	16	2566	2	13	t	f	\N	วันทำการ
1346	1039	1	16	2566	2	13	t	f	\N	วันทำการ
1347	1040	1	16	2566	2	13	t	f	\N	วันทำการ
1348	1041	1	16	2566	2	13	t	f	\N	วันทำการ
1349	1042	1	16	2566	2	13	f	f	\N	วันหยุด
1350	1043	1	16	2566	2	13	f	f	\N	วันหยุด
1351	1044	1	16	2566	2	14	t	f	\N	วันทำการ
1352	1045	1	16	2566	2	14	t	f	\N	วันทำการ
1353	1046	1	16	2566	2	14	t	f	\N	วันทำการ
1354	1047	1	16	2566	2	14	t	f	\N	วันทำการ
1355	1048	1	16	2566	2	14	t	f	\N	วันทำการ
1356	1049	1	16	2566	2	14	f	t	วันจักรี	วันหยุดนักขัตฤกษ์
1357	1050	1	16	2566	2	14	f	f	\N	วันหยุด
1358	1051	1	16	2566	2	15	f	t	ชดเชยวันจักรี	วันหยุดนักขัตฤกษ์
1359	1052	1	16	2566	2	15	t	f	\N	วันทำการ
1360	1053	1	16	2566	2	15	t	f	\N	วันทำการ
1361	1054	1	16	2566	2	15	t	f	\N	วันทำการ
1362	1055	1	16	2566	2	15	f	t	วันสงกรานต์	วันหยุดนักขัตฤกษ์
1363	1056	1	16	2566	2	15	f	t	วันสงกรานต์	วันหยุดนักขัตฤกษ์
1364	1057	1	16	2566	2	15	f	t	วันสงกรานต์	วันหยุดนักขัตฤกษ์
1365	1058	1	16	2566	2	16	f	t	วันสงกรานต์	วันหยุดนักขัตฤกษ์
1366	1059	1	16	2566	2	16	f	t	ชดเชยวันสงกรานต์	วันหยุดนักขัตฤกษ์
1367	1060	1	16	2566	2	16	t	f	\N	วันทำการ
1368	1061	1	16	2566	2	16	t	f	\N	วันทำการ
1369	1062	1	16	2566	2	16	t	f	\N	วันทำการ
1370	1063	1	16	2566	2	16	f	f	\N	วันหยุด
1371	1064	1	16	2566	2	16	f	f	\N	วันหยุด
1372	1065	1	16	2566	2	17	t	f	\N	วันทำการ
1373	1066	1	16	2566	2	17	f	t	วันวิสาขบูชา	วันหยุดนักขัตฤกษ์
1374	1067	1	16	2566	2	17	t	f	\N	วันทำการ
1375	1068	1	16	2566	2	17	t	f	\N	วันทำการ
1376	1069	1	16	2566	2	17	t	f	\N	วันทำการ
1377	1070	1	16	2566	2	17	f	f	\N	วันหยุด
1378	1071	1	16	2566	2	17	f	f	\N	วันหยุด
1379	1072	1	16	2566	2	18	t	f	\N	วันทำการ
1380	1073	1	16	2566	2	18	t	f	\N	วันทำการ
1381	1074	1	16	2566	2	18	f	t	วันแรงงานแห่งชาติ	วันหยุดนักขัตฤกษ์
1382	1075	1	16	2566	2	18	t	f	\N	วันทำการ
1383	421	1	17	2566	1	1	t	f	\N	วันทำการ
1384	422	1	17	2566	1	1	t	f	\N	วันทำการ
1385	423	1	17	2566	1	1	t	f	\N	วันทำการ
1386	424	1	17	2566	1	1	t	f	\N	วันทำการ
1387	425	1	17	2566	1	1	t	f	\N	วันทำการ
1388	426	1	17	2566	1	1	f	t	วันเฉลิมฯ พระราชินี	วันหยุดนักขัตฤกษ์
1389	427	1	17	2566	1	1	f	f	\N	วันหยุด
1390	428	1	17	2566	1	2	f	t	วันหยุดชดเชยวันวิสาขบูชา	วันหยุดนักขัตฤกษ์
1391	429	1	17	2566	1	2	t	f	\N	วันทำการ
1392	430	1	17	2566	1	2	t	f	\N	วันทำการ
1393	431	1	17	2566	1	2	t	f	\N	วันทำการ
1394	432	1	17	2566	1	2	t	f	\N	วันทำการ
1395	433	1	17	2566	1	2	f	f	\N	วันหยุด
1396	1396	1	17	2566	1	2	f	f	\N	วันหยุด
1397	1397	1	17	2566	1	3	t	f	\N	วันทำการ
1398	1398	1	17	2566	1	3	t	f	\N	วันทำการ
1399	1399	1	17	2566	1	3	t	f	\N	วันทำการ
1400	1400	1	17	2566	1	3	t	f	\N	วันทำการ
1401	1401	1	17	2566	1	3	t	f	\N	วันทำการ
1402	1402	1	17	2566	1	3	f	f	\N	วันหยุด
1403	1403	1	17	2566	1	3	f	f	\N	วันหยุด
1404	1404	1	17	2566	1	4	t	f	\N	วันทำการ
1405	1405	1	17	2566	1	4	t	f	\N	วันทำการ
1406	1406	1	17	2566	1	4	t	f	\N	วันทำการ
1407	1407	1	17	2566	1	4	t	f	\N	วันทำการ
1408	1408	1	17	2566	1	4	t	f	\N	วันทำการ
1409	1409	1	17	2566	1	4	f	f	\N	วันหยุด
1410	1410	1	17	2566	1	4	f	f	\N	วันหยุด
1411	764	1	17	2566	1	5	t	f	\N	วันทำการ
1412	765	1	17	2566	1	5	t	f	\N	วันทำการ
1413	766	1	17	2566	1	5	t	f	\N	วันทำการ
1414	767	1	17	2566	1	5	t	f	\N	วันทำการ
1415	768	1	17	2566	1	5	t	f	\N	วันทำการ
1416	769	1	17	2566	1	5	f	f	\N	วันหยุด
1417	770	1	17	2566	1	5	f	f	\N	วันหยุด
1418	771	1	17	2566	1	6	f	t	วันอาสาฬหบูชา	วันหยุดนักขัตฤกษ์
1419	772	1	17	2566	1	6	f	t	วันเข้าพรรษา	วันหยุดนักขัตฤกษ์
1420	773	1	17	2566	1	6	t	f	\N	วันทำการ
1421	774	1	17	2566	1	6	t	f	\N	วันทำการ
1422	775	1	17	2566	1	6	t	f	\N	วันทำการ
1423	776	1	17	2566	1	6	f	f	\N	วันหยุด
1424	777	1	17	2566	1	6	f	f	\N	วันหยุด
1425	778	1	17	2566	1	7	t	f	\N	วันทำการ
1426	779	1	17	2566	1	7	t	f	\N	วันทำการ
1427	780	1	17	2566	1	7	t	f	\N	วันทำการ
1428	781	1	17	2566	1	7	t	f	\N	วันทำการ
1429	782	1	17	2566	1	7	t	f	\N	วันทำการ
1430	783	1	17	2566	1	7	f	f	\N	วันหยุด
1431	784	1	17	2566	1	7	f	f	\N	วันหยุด
1432	785	1	17	2566	1	8	t	f	\N	วันทำการ
1433	786	1	17	2566	1	8	t	f	\N	วันทำการ
1434	787	1	17	2566	1	8	t	f	\N	วันทำการ
1435	788	1	17	2566	1	8	t	f	\N	วันทำการ
1436	789	1	17	2566	1	8	t	f	\N	วันทำการ
1437	790	1	17	2566	1	8	f	f	\N	วันหยุด
1438	791	1	17	2566	1	8	f	f	\N	วันหยุด
1439	792	1	17	2566	1	9	t	f	\N	วันทำการ
1440	793	1	17	2566	1	9	t	f	\N	วันทำการ
1441	794	1	17	2566	1	9	t	f	\N	วันทำการ
1442	795	1	17	2566	1	9	t	f	\N	วันทำการ
1443	796	1	17	2566	1	9	f	t	วันเฉลิมฯ ร.10	วันหยุดนักขัตฤกษ์
1444	797	1	17	2566	1	9	f	f	\N	วันหยุด
1445	798	1	17	2566	1	9	f	f	\N	วันหยุด
1446	799	1	17	2566	1	10	f	t	นักขัตฤกษ์	วันหยุดนักขัตฤกษ์
1447	800	1	17	2566	1	10	f	t	วันอาสาฬหบูชา	วันหยุดนักขัตฤกษ์
1448	801	1	17	2566	1	10	t	f	\N	วันทำการ
1449	802	1	17	2566	1	10	t	f	\N	วันทำการ
1450	803	1	17	2566	1	10	t	f	\N	วันทำการ
1451	804	1	17	2566	1	10	f	f	\N	วันหยุด
1452	805	1	17	2566	1	10	f	f	\N	วันหยุด
1453	806	1	17	2566	1	11	t	f	\N	วันทำการ
1454	807	1	17	2566	1	11	t	f	\N	วันทำการ
1455	808	1	17	2566	1	11	t	f	\N	วันทำการ
1456	809	1	17	2566	1	11	t	f	\N	วันทำการ
1457	810	1	17	2566	1	11	t	f	\N	วันทำการ
1458	811	1	17	2566	1	11	f	t	วันแม่แห่งชาติ	วันหยุดนักขัตฤกษ์
1459	812	1	17	2566	1	11	f	f	\N	วันหยุด
1460	813	1	17	2566	1	12	f	t	ชดเชยวันแม่แห่งชาติ	วันหยุดนักขัตฤกษ์
1461	814	1	17	2566	1	12	t	f	\N	วันทำการ
1462	815	1	17	2566	1	12	t	f	\N	วันทำการ
1463	816	1	17	2566	1	12	t	f	\N	วันทำการ
1464	817	1	17	2566	1	12	t	f	\N	วันทำการ
1465	818	1	17	2566	1	12	f	f	\N	วันหยุด
1466	819	1	17	2566	1	12	f	f	\N	วันหยุด
1467	820	1	17	2566	1	13	t	f	\N	วันทำการ
1468	821	1	17	2566	1	13	t	f	\N	วันทำการ
1469	822	1	17	2566	1	13	t	f	\N	วันทำการ
1470	823	1	17	2566	1	13	t	f	\N	วันทำการ
1471	824	1	17	2566	1	13	t	f	\N	วันทำการ
1472	825	1	17	2566	1	13	f	f	\N	วันหยุด
1473	826	1	17	2566	1	13	f	f	\N	วันหยุด
1474	827	1	17	2566	1	14	t	f	\N	วันทำการ
1475	828	1	17	2566	1	14	t	f	\N	วันทำการ
1476	829	1	17	2566	1	14	t	f	\N	วันทำการ
1477	830	1	17	2566	1	14	t	f	\N	วันทำการ
1478	831	1	17	2566	1	14	t	f	\N	วันทำการ
1479	832	1	17	2566	1	14	f	f	\N	วันหยุด
1480	833	1	17	2566	1	14	f	f	\N	วันหยุด
1481	834	1	17	2566	1	15	t	f	\N	วันทำการ
1482	835	1	17	2566	1	15	t	f	\N	วันทำการ
1483	836	1	17	2566	1	15	t	f	\N	วันทำการ
1484	837	1	17	2566	1	15	t	f	\N	วันทำการ
1485	838	1	17	2566	1	15	t	f	\N	วันทำการ
1486	839	1	17	2566	1	15	f	f	\N	วันหยุด
1487	840	1	17	2566	1	15	f	f	\N	วันหยุด
1488	841	1	17	2566	1	16	t	f	\N	วันทำการ
1489	842	1	17	2566	1	16	t	f	\N	วันทำการ
1490	843	1	17	2566	1	16	t	f	\N	วันทำการ
1491	844	1	17	2566	1	16	t	f	\N	วันทำการ
1492	845	1	17	2566	1	16	t	f	\N	วันทำการ
1493	846	1	17	2566	1	16	f	f	\N	วันหยุด
1494	847	1	17	2566	1	16	f	f	\N	วันหยุด
1495	848	1	17	2566	1	17	t	f	\N	วันทำการ
1496	849	1	17	2566	1	17	t	f	\N	วันทำการ
1497	850	1	17	2566	1	17	t	f	\N	วันทำการ
1498	851	1	17	2566	1	17	t	f	\N	วันทำการ
1499	852	1	17	2566	1	17	f	t	วันสงขลานครินทร์	วันหยุดนักขัตฤกษ์
1500	853	1	17	2566	1	17	f	f	\N	วันหยุด
1501	854	1	17	2566	1	17	f	f	\N	วันหยุด
1502	855	1	17	2566	1	18	t	f	\N	วันทำการ
1503	856	1	17	2566	1	18	t	f	\N	วันทำการ
1504	857	1	17	2566	1	18	t	f	\N	วันทำการ
1505	858	1	17	2566	1	18	t	f	\N	วันทำการ
1506	859	1	17	2566	1	18	t	f	\N	วันทำการ
1507	860	1	17	2566	1	18	f	f	\N	วันหยุด
1508	861	1	17	2566	1	18	f	f	\N	วันหยุด
1509	862	1	17	2566	1	19	t	f	\N	วันทำการ
1510	863	1	17	2566	1	19	t	f	\N	วันทำการ
1511	864	1	17	2566	1	19	t	f	\N	วันทำการ
1512	865	1	17	2566	1	19	t	f	\N	วันทำการ
1513	866	1	17	2566	1	19	t	f	\N	วันทำการ
1514	867	1	17	2566	1	19	f	f	\N	วันหยุด
1515	868	1	17	2566	1	19	f	f	\N	วันหยุด
1516	869	1	17	2566	1	20	t	f	\N	วันทำการ
1517	870	1	17	2566	1	20	t	f	\N	วันทำการ
1518	871	1	17	2566	1	20	t	f	\N	วันทำการ
1519	872	1	17	2566	1	20	t	f	\N	วันทำการ
1520	873	1	17	2566	1	20	f	t	วันนวมินทรมหาราช	วันหยุดนักขัตฤกษ์
1521	874	1	17	2566	1	20	f	f	\N	วันหยุด
1522	875	1	17	2566	1	20	f	f	\N	วันหยุด
1523	876	1	17	2566	1	21	t	f	\N	วันทำการ
1524	877	1	17	2566	1	21	t	f	\N	วันทำการ
1525	878	1	17	2566	1	21	t	f	\N	วันทำการ
1526	879	1	17	2566	1	21	t	f	\N	วันทำการ
1527	880	1	17	2566	1	21	t	f	\N	วันทำการ
1528	881	1	17	2566	1	21	f	f	\N	วันหยุด
1529	882	1	17	2566	1	21	f	f	\N	วันหยุด
1530	883	1	17	2566	1	22	f	t	วันปิยมหาราช	วันหยุดนักขัตฤกษ์
1531	884	1	17	2566	1	22	t	f	\N	วันทำการ
1532	885	1	17	2566	1	22	t	f	\N	วันทำการ
1533	886	1	17	2566	1	22	t	f	\N	วันทำการ
1534	887	1	17	2566	1	22	t	f	\N	วันทำการ
1535	888	1	17	2566	1	22	f	f	\N	วันหยุด
1536	889	1	17	2566	1	22	f	f	\N	วันหยุด
1537	890	1	17	2566	1	23	t	f	\N	วันทำการ
1538	891	1	17	2566	1	23	t	f	\N	วันทำการ
1539	892	1	17	2566	1	23	t	f	\N	วันทำการ
1540	893	1	17	2566	1	23	t	f	\N	วันทำการ
1541	894	1	17	2566	1	23	t	f	\N	วันทำการ
1542	895	1	17	2566	1	23	f	f	\N	วันหยุด
1543	896	1	17	2566	1	23	f	f	\N	วันหยุด
1544	897	1	17	2566	1	24	t	f	\N	วันทำการ
1545	898	1	17	2566	1	24	t	f	\N	วันทำการ
1546	899	1	17	2566	1	24	t	f	\N	วันทำการ
1547	900	1	17	2566	1	24	t	f	\N	วันทำการ
1548	901	1	17	2566	1	24	t	f	\N	วันทำการ
1549	902	1	17	2566	1	24	f	f	\N	วันหยุด
1550	903	1	17	2566	1	24	f	f	\N	วันหยุด
1551	904	1	17	2566	1	25	t	f	\N	วันทำการ
1552	905	1	17	2566	1	25	t	f	\N	วันทำการ
1553	906	1	17	2566	1	25	t	f	\N	วันทำการ
1554	907	1	17	2566	1	25	t	f	\N	วันทำการ
1555	908	1	17	2566	1	25	t	f	\N	วันทำการ
1556	909	1	17	2566	1	25	f	f	\N	วันหยุด
1557	910	1	17	2566	1	25	f	f	\N	วันหยุด
1558	911	1	17	2566	1	26	t	f	\N	วันทำการ
1559	912	1	17	2566	1	26	t	f	\N	วันทำการ
1560	913	1	17	2566	1	26	t	f	\N	วันทำการ
1561	914	1	17	2566	1	26	t	f	\N	วันทำการ
1562	915	1	17	2566	1	26	t	f	\N	วันทำการ
1563	916	1	17	2566	1	26	f	f	\N	วันหยุด
1564	917	1	17	2566	1	26	f	f	\N	วันหยุด
1565	918	1	17	2566	1	27	t	f	\N	วันทำการ
1566	919	1	17	2566	1	27	t	f	\N	วันทำการ
1567	920	1	17	2566	1	27	t	f	\N	วันทำการ
1568	921	1	17	2566	1	27	t	f	\N	วันทำการ
1569	922	1	17	2566	1	27	t	f	\N	วันทำการ
1570	923	1	17	2566	1	27	f	f	\N	วันหยุด
1571	924	1	17	2566	1	27	f	f	\N	วันหยุด
1572	925	1	17	2566	1	28	t	f	\N	วันทำการ
1573	926	1	17	2566	1	28	f	t	วันพ่อแห่งชาติ	วันหยุดนักขัตฤกษ์
1574	927	1	17	2566	1	28	t	f	\N	วันทำการ
1575	928	1	17	2566	1	28	t	f	\N	วันทำการ
1576	929	1	17	2566	1	28	t	f	\N	วันทำการ
1577	930	1	17	2566	1	28	f	f	\N	วันหยุด
1578	931	1	17	2566	1	28	f	t	วันรัฐธรรมนูญ	วันหยุดนักขัตฤกษ์
1579	932	1	17	2566	1	29	f	t	ชดเชยวันรัฐธรรมนูญ	วันหยุดนักขัตฤกษ์
1580	933	1	17	2566	1	29	t	f	\N	วันทำการ
1581	934	1	17	2566	1	29	t	f	\N	วันทำการ
1582	935	1	17	2566	1	29	t	f	\N	วันทำการ
1583	936	1	17	2566	1	29	t	f	\N	วันทำการ
1584	937	1	17	2566	1	29	f	f	\N	วันหยุด
1585	938	1	17	2566	1	29	f	f	\N	วันหยุด
1586	939	1	17	2566	1	30	t	f	\N	วันทำการ
1587	940	1	17	2566	1	30	t	f	\N	วันทำการ
1588	941	1	17	2566	1	30	t	f	\N	วันทำการ
1589	942	1	17	2566	1	30	t	f	\N	วันทำการ
1590	943	1	17	2566	1	30	t	f	\N	วันทำการ
1591	944	1	17	2566	1	30	f	f	\N	วันหยุด
1592	945	1	17	2566	1	30	f	t	วันคริสต์มาสอีฟ	วันหยุดนักขัตฤกษ์
1593	946	1	17	2566	1	31	f	t	วันคริสต์มาส	วันหยุดนักขัตฤกษ์
1594	947	1	17	2566	1	31	t	f	\N	วันทำการ
1595	948	1	17	2566	1	31	t	f	\N	วันทำการ
1596	949	1	17	2566	1	31	t	f	\N	วันทำการ
1597	950	1	17	2566	1	31	f	t	วันหยุดราชการธันวาคม	วันหยุดนักขัตฤกษ์
1598	951	1	17	2566	1	31	f	f	\N	วันหยุด
1599	952	1	17	2566	1	31	f	t	วันสิ้นปี	วันหยุดนักขัตฤกษ์
1600	953	1	17	2566	1	32	f	t	วันขึ้นปีใหม่	วันหยุดนักขัตฤกษ์
1601	954	1	17	2566	1	32	t	f	\N	วันทำการ
1602	955	1	17	2566	1	32	t	f	\N	วันทำการ
1603	956	1	17	2566	1	32	t	f	\N	วันทำการ
1604	957	1	17	2566	1	32	t	f	\N	วันทำการ
1605	958	1	17	2566	1	32	f	f	\N	วันหยุด
1606	959	1	17	2566	1	32	f	f	\N	วันหยุด
1607	960	1	17	2566	1	33	t	f	\N	วันทำการ
1608	961	1	17	2566	1	33	t	f	\N	วันทำการ
1609	962	1	17	2566	1	33	t	f	\N	วันทำการ
1610	963	1	17	2566	1	33	t	f	\N	วันทำการ
1611	964	1	17	2566	1	33	t	f	\N	วันทำการ
1612	965	1	17	2566	1	33	f	f	\N	วันหยุด
1613	966	1	17	2566	1	33	f	f	\N	วันหยุด
1614	967	1	17	2566	1	34	t	f	\N	วันทำการ
1615	968	1	17	2566	1	34	t	f	\N	วันทำการ
1616	969	1	17	2566	1	34	t	f	\N	วันทำการ
1617	970	1	17	2566	1	34	t	f	\N	วันทำการ
1618	971	1	17	2566	1	34	t	f	\N	วันทำการ
1619	972	1	17	2566	1	34	f	f	\N	วันหยุด
1620	973	1	17	2566	1	34	f	f	\N	วันหยุด
1621	974	1	17	2566	1	35	t	f	\N	วันทำการ
1622	975	1	17	2566	1	35	t	f	\N	วันทำการ
1623	976	1	17	2566	1	35	t	f	\N	วันทำการ
1700	1053	1	17	2566	1	46	t	f	\N	วันทำการ
1624	977	1	17	2566	1	35	f	t	วันมาฆบูชา	วันหยุดนักขัตฤกษ์
1625	978	1	17	2566	1	35	t	f	\N	วันทำการ
1626	979	1	17	2566	1	35	f	f	\N	วันหยุด
1627	980	1	17	2566	1	35	f	f	\N	วันหยุด
1628	981	1	17	2566	1	36	t	f	\N	วันทำการ
1629	982	1	17	2566	1	36	t	f	\N	วันทำการ
1630	983	1	17	2566	1	36	t	f	\N	วันทำการ
1631	984	1	17	2566	1	36	t	f	\N	วันทำการ
1632	985	1	17	2566	1	36	t	f	\N	วันทำการ
1633	986	1	17	2566	1	36	f	f	\N	วันหยุด
1634	987	1	17	2566	1	36	f	f	\N	วันหยุด
1635	988	1	17	2566	1	37	t	f	\N	วันทำการ
1636	989	1	17	2566	1	37	t	f	\N	วันทำการ
1637	990	1	17	2566	1	37	t	f	\N	วันทำการ
1638	991	1	17	2566	1	37	t	f	\N	วันทำการ
1639	992	1	17	2566	1	37	t	f	\N	วันทำการ
1640	993	1	17	2566	1	37	f	t	วันตรุษจีน	วันหยุดนักขัตฤกษ์
1641	994	1	17	2566	1	37	f	t	วันตรุษจีน (วันที่ 2)	วันหยุดนักขัตฤกษ์
1642	995	1	17	2566	1	38	f	t	วันตรุษจีน (วันที่ 3)	วันหยุดนักขัตฤกษ์
1643	996	1	17	2566	1	38	t	f	\N	วันทำการ
1644	997	1	17	2566	1	38	f	t	วันวาเลนไทน์	วันหยุดนักขัตฤกษ์
1645	998	1	17	2566	1	38	t	f	\N	วันทำการ
1646	999	1	17	2566	1	38	t	f	\N	วันทำการ
1647	1000	1	17	2566	1	38	f	f	\N	วันหยุด
1648	1001	1	17	2566	1	38	f	f	\N	วันหยุด
1649	1002	1	17	2566	1	39	t	f	\N	วันทำการ
1650	1003	1	17	2566	1	39	t	f	\N	วันทำการ
1651	1004	1	17	2566	1	39	t	f	\N	วันทำการ
1652	1005	1	17	2566	1	39	t	f	\N	วันทำการ
1653	1006	1	17	2566	1	39	t	f	\N	วันทำการ
1654	1007	1	17	2566	1	39	f	t	วันมาฆบูชา	วันหยุดนักขัตฤกษ์
1655	1008	1	17	2566	1	39	f	f	\N	วันหยุด
1656	1009	1	17	2566	1	40	f	t	วันหยุดชดเชยวันมาฆบูชา	วันหยุดนักขัตฤกษ์
1657	1010	1	17	2566	1	40	t	f	\N	วันทำการ
1658	1011	1	17	2566	1	40	t	f	\N	วันทำการ
1659	1012	1	17	2566	1	40	t	f	\N	วันทำการ
1660	1013	1	17	2566	1	40	t	f	\N	วันทำการ
1661	1014	1	17	2566	1	40	f	f	\N	วันหยุด
1662	1015	1	17	2566	1	40	f	f	\N	วันหยุด
1663	1016	1	17	2566	1	41	t	f	\N	วันทำการ
1664	1017	1	17	2566	1	41	t	f	\N	วันทำการ
1665	1018	1	17	2566	1	41	t	f	\N	วันทำการ
1666	1019	1	17	2566	1	41	t	f	\N	วันทำการ
1667	1020	1	17	2566	1	41	t	f	\N	วันทำการ
1668	1021	1	17	2566	1	41	f	f	\N	วันหยุด
1669	1022	1	17	2566	1	41	f	f	\N	วันหยุด
1670	1023	1	17	2566	1	42	t	f	\N	วันทำการ
1671	1024	1	17	2566	1	42	t	f	\N	วันทำการ
1672	1025	1	17	2566	1	42	t	f	\N	วันทำการ
1673	1026	1	17	2566	1	42	t	f	\N	วันทำการ
1674	1027	1	17	2566	1	42	t	f	\N	วันทำการ
1675	1028	1	17	2566	1	42	f	f	\N	วันหยุด
1676	1029	1	17	2566	1	42	f	f	\N	วันหยุด
1677	1030	1	17	2566	1	43	t	f	\N	วันทำการ
1678	1031	1	17	2566	1	43	t	f	\N	วันทำการ
1679	1032	1	17	2566	1	43	t	f	\N	วันทำการ
1680	1033	1	17	2566	1	43	t	f	\N	วันทำการ
1681	1034	1	17	2566	1	43	t	f	\N	วันทำการ
1682	1035	1	17	2566	1	43	f	f	\N	วันหยุด
1683	1036	1	17	2566	1	43	f	f	\N	วันหยุด
1684	1037	1	17	2566	1	44	t	f	\N	วันทำการ
1685	1038	1	17	2566	1	44	t	f	\N	วันทำการ
1686	1039	1	17	2566	1	44	t	f	\N	วันทำการ
1687	1040	1	17	2566	1	44	t	f	\N	วันทำการ
1688	1041	1	17	2566	1	44	t	f	\N	วันทำการ
1689	1042	1	17	2566	1	44	f	f	\N	วันหยุด
1690	1043	1	17	2566	1	44	f	f	\N	วันหยุด
1691	1044	1	17	2566	1	45	t	f	\N	วันทำการ
1692	1045	1	17	2566	1	45	t	f	\N	วันทำการ
1693	1046	1	17	2566	1	45	t	f	\N	วันทำการ
1694	1047	1	17	2566	1	45	t	f	\N	วันทำการ
1695	1048	1	17	2566	1	45	t	f	\N	วันทำการ
1696	1049	1	17	2566	1	45	f	t	วันจักรี	วันหยุดนักขัตฤกษ์
1697	1050	1	17	2566	1	45	f	f	\N	วันหยุด
1698	1051	1	17	2566	1	46	f	t	ชดเชยวันจักรี	วันหยุดนักขัตฤกษ์
1699	1052	1	17	2566	1	46	t	f	\N	วันทำการ
1701	1054	1	17	2566	1	46	t	f	\N	วันทำการ
1702	1055	1	17	2566	1	46	f	t	วันสงกรานต์	วันหยุดนักขัตฤกษ์
1703	1056	1	17	2566	1	46	f	t	วันสงกรานต์	วันหยุดนักขัตฤกษ์
1704	1057	1	17	2566	1	46	f	t	วันสงกรานต์	วันหยุดนักขัตฤกษ์
1705	1058	1	17	2566	1	47	f	t	วันสงกรานต์	วันหยุดนักขัตฤกษ์
1706	1059	1	17	2566	1	47	f	t	ชดเชยวันสงกรานต์	วันหยุดนักขัตฤกษ์
1707	1060	1	17	2566	1	47	t	f	\N	วันทำการ
1708	1061	1	17	2566	1	47	t	f	\N	วันทำการ
1709	1062	1	17	2566	1	47	t	f	\N	วันทำการ
1710	1063	1	17	2566	1	47	f	f	\N	วันหยุด
1711	1064	1	17	2566	1	47	f	f	\N	วันหยุด
1712	1065	1	17	2566	1	48	t	f	\N	วันทำการ
1713	1066	1	17	2566	1	48	f	t	วันวิสาขบูชา	วันหยุดนักขัตฤกษ์
1714	1067	1	17	2566	1	48	t	f	\N	วันทำการ
1715	1068	1	17	2566	1	48	t	f	\N	วันทำการ
1716	1069	1	17	2566	1	48	t	f	\N	วันทำการ
1717	1070	1	17	2566	1	48	f	f	\N	วันหยุด
1718	1071	1	17	2566	1	48	f	f	\N	วันหยุด
1719	1072	1	17	2566	1	49	t	f	\N	วันทำการ
1720	1073	1	17	2566	1	49	t	f	\N	วันทำการ
1721	1074	1	17	2566	1	49	f	t	วันแรงงานแห่งชาติ	วันหยุดนักขัตฤกษ์
1722	1075	1	17	2566	1	49	t	f	\N	วันทำการ
1723	421	1	18	2566	1	1	t	f	\N	วันทำการ
1724	422	1	18	2566	1	1	t	f	\N	วันทำการ
1725	423	1	18	2566	1	1	t	f	\N	วันทำการ
1726	424	1	18	2566	1	1	t	f	\N	วันทำการ
1727	425	1	18	2566	1	1	t	f	\N	วันทำการ
1728	426	1	18	2566	1	1	f	t	วันเฉลิมฯ พระราชินี	วันหยุดนักขัตฤกษ์
1729	427	1	18	2566	1	1	f	f	\N	วันหยุด
1730	428	1	18	2566	1	2	f	t	วันหยุดชดเชยวันวิสาขบูชา	วันหยุดนักขัตฤกษ์
1731	429	1	18	2566	1	2	t	f	\N	วันทำการ
1732	430	1	18	2566	1	2	t	f	\N	วันทำการ
1733	431	1	18	2566	1	2	t	f	\N	วันทำการ
1734	432	1	18	2566	1	2	t	f	\N	วันทำการ
1735	433	1	18	2566	1	2	f	f	\N	วันหยุด
1736	1396	1	18	2566	1	2	f	f	\N	วันหยุด
1737	1397	1	18	2566	1	3	t	f	\N	วันทำการ
1738	1398	1	18	2566	1	3	t	f	\N	วันทำการ
1739	1399	1	18	2566	1	3	t	f	\N	วันทำการ
1740	1400	1	18	2566	1	3	t	f	\N	วันทำการ
1741	1401	1	18	2566	1	3	t	f	\N	วันทำการ
1742	1402	1	18	2566	1	3	f	f	\N	วันหยุด
1743	1403	1	18	2566	1	3	f	f	\N	วันหยุด
1744	1404	1	18	2566	1	4	t	f	\N	วันทำการ
1745	1405	1	18	2566	1	4	t	f	\N	วันทำการ
1746	1406	1	18	2566	1	4	t	f	\N	วันทำการ
1747	1407	1	18	2566	1	4	t	f	\N	วันทำการ
1748	1408	1	18	2566	1	4	t	f	\N	วันทำการ
1749	1409	1	18	2566	1	4	f	f	\N	วันหยุด
1750	1410	1	18	2566	1	4	f	f	\N	วันหยุด
1751	764	1	18	2566	1	5	t	f	\N	วันทำการ
1752	765	1	18	2566	1	5	t	f	\N	วันทำการ
1753	766	1	18	2566	1	5	t	f	\N	วันทำการ
1754	767	1	18	2566	1	5	t	f	\N	วันทำการ
1755	768	1	18	2566	1	5	t	f	\N	วันทำการ
1756	769	1	18	2566	1	5	f	f	\N	วันหยุด
1757	770	1	18	2566	1	5	f	f	\N	วันหยุด
1758	771	1	18	2566	1	6	f	t	วันอาสาฬหบูชา	วันหยุดนักขัตฤกษ์
1759	772	1	18	2566	1	6	f	t	วันเข้าพรรษา	วันหยุดนักขัตฤกษ์
1760	773	1	18	2566	1	6	t	f	\N	วันทำการ
1761	774	1	18	2566	1	6	t	f	\N	วันทำการ
1762	775	1	18	2566	1	6	t	f	\N	วันทำการ
1763	776	1	18	2566	1	6	f	f	\N	วันหยุด
1764	777	1	18	2566	1	6	f	f	\N	วันหยุด
1765	778	1	18	2566	1	7	t	f	\N	วันทำการ
1766	779	1	18	2566	1	7	t	f	\N	วันทำการ
1767	780	1	18	2566	1	7	t	f	\N	วันทำการ
1768	781	1	18	2566	1	7	t	f	\N	วันทำการ
1769	782	1	18	2566	1	7	t	f	\N	วันทำการ
1770	783	1	18	2566	1	7	f	f	\N	วันหยุด
1771	784	1	18	2566	1	7	f	f	\N	วันหยุด
1772	785	1	18	2566	1	8	t	f	\N	วันทำการ
1773	786	1	18	2566	1	8	t	f	\N	วันทำการ
1774	787	1	18	2566	1	8	t	f	\N	วันทำการ
1775	788	1	18	2566	1	8	t	f	\N	วันทำการ
1776	789	1	18	2566	1	8	t	f	\N	วันทำการ
1777	790	1	18	2566	1	8	f	f	\N	วันหยุด
1778	791	1	18	2566	1	8	f	f	\N	วันหยุด
1779	792	1	18	2566	1	9	t	f	\N	วันทำการ
1780	793	1	18	2566	1	9	t	f	\N	วันทำการ
1781	794	1	18	2566	1	9	t	f	\N	วันทำการ
1782	795	1	18	2566	1	9	t	f	\N	วันทำการ
1783	796	1	18	2566	1	9	f	t	วันเฉลิมฯ ร.10	วันหยุดนักขัตฤกษ์
1784	797	1	18	2566	1	9	f	f	\N	วันหยุด
1785	798	1	18	2566	1	9	f	f	\N	วันหยุด
1786	799	1	18	2566	1	10	f	t	นักขัตฤกษ์	วันหยุดนักขัตฤกษ์
1787	800	1	18	2566	1	10	f	t	วันอาสาฬหบูชา	วันหยุดนักขัตฤกษ์
1788	801	1	18	2566	1	10	t	f	\N	วันทำการ
1789	802	1	18	2566	1	10	t	f	\N	วันทำการ
1790	803	1	18	2566	1	10	t	f	\N	วันทำการ
1791	804	1	18	2566	1	10	f	f	\N	วันหยุด
1792	805	1	18	2566	1	10	f	f	\N	วันหยุด
1793	806	1	18	2566	1	11	t	f	\N	วันทำการ
1794	807	1	18	2566	1	11	t	f	\N	วันทำการ
1795	808	1	18	2566	1	11	t	f	\N	วันทำการ
1796	809	1	18	2566	1	11	t	f	\N	วันทำการ
1797	810	1	18	2566	1	11	t	f	\N	วันทำการ
1798	811	1	18	2566	1	11	f	t	วันแม่แห่งชาติ	วันหยุดนักขัตฤกษ์
1799	812	1	18	2566	1	11	f	f	\N	วันหยุด
1800	813	1	18	2566	1	12	f	t	ชดเชยวันแม่แห่งชาติ	วันหยุดนักขัตฤกษ์
1801	814	1	18	2566	1	12	t	f	\N	วันทำการ
1802	815	1	18	2566	1	12	t	f	\N	วันทำการ
1803	816	1	18	2566	1	12	t	f	\N	วันทำการ
1804	817	1	18	2566	1	12	t	f	\N	วันทำการ
1805	818	1	18	2566	1	12	f	f	\N	วันหยุด
1806	819	1	18	2566	1	12	f	f	\N	วันหยุด
1807	820	1	18	2566	1	13	t	f	\N	วันทำการ
1808	821	1	18	2566	1	13	t	f	\N	วันทำการ
1809	822	1	18	2566	1	13	t	f	\N	วันทำการ
1810	823	1	18	2566	1	13	t	f	\N	วันทำการ
1811	824	1	18	2566	1	13	t	f	\N	วันทำการ
1812	825	1	18	2566	1	13	f	f	\N	วันหยุด
1813	826	1	18	2566	1	13	f	f	\N	วันหยุด
1814	827	1	18	2566	1	14	t	f	\N	วันทำการ
1815	828	1	18	2566	1	14	t	f	\N	วันทำการ
1816	829	1	18	2566	1	14	t	f	\N	วันทำการ
1817	830	1	18	2566	1	14	t	f	\N	วันทำการ
1818	831	1	18	2566	1	14	t	f	\N	วันทำการ
1819	832	1	18	2566	1	14	f	f	\N	วันหยุด
1820	833	1	18	2566	1	14	f	f	\N	วันหยุด
1821	834	1	18	2566	1	15	t	f	\N	วันทำการ
1822	835	1	18	2566	1	15	t	f	\N	วันทำการ
1823	836	1	18	2566	1	15	t	f	\N	วันทำการ
1824	837	1	18	2566	1	15	t	f	\N	วันทำการ
1825	838	1	18	2566	1	15	t	f	\N	วันทำการ
1826	839	1	18	2566	1	15	f	f	\N	วันหยุด
1827	840	1	18	2566	1	15	f	f	\N	วันหยุด
1828	841	1	18	2566	1	16	t	f	\N	วันทำการ
1829	842	1	18	2566	1	16	t	f	\N	วันทำการ
1830	843	1	18	2566	1	16	t	f	\N	วันทำการ
1831	844	1	18	2566	1	16	t	f	\N	วันทำการ
1832	845	1	18	2566	1	16	t	f	\N	วันทำการ
1833	846	1	18	2566	1	16	f	f	\N	วันหยุด
1834	847	1	18	2566	1	16	f	f	\N	วันหยุด
1835	848	1	18	2566	1	17	t	f	\N	วันทำการ
1836	849	1	18	2566	1	17	t	f	\N	วันทำการ
1837	850	1	18	2566	1	17	t	f	\N	วันทำการ
1838	851	1	18	2566	1	17	t	f	\N	วันทำการ
1839	852	1	18	2566	1	17	f	t	วันสงขลานครินทร์	วันหยุดนักขัตฤกษ์
1840	853	1	18	2566	1	17	f	f	\N	วันหยุด
1841	854	1	18	2566	1	17	f	f	\N	วันหยุด
1842	855	1	18	2566	1	18	t	f	\N	วันทำการ
1843	856	1	18	2566	1	18	t	f	\N	วันทำการ
1844	857	1	18	2566	1	18	t	f	\N	วันทำการ
1845	858	1	18	2566	1	18	t	f	\N	วันทำการ
1846	859	1	18	2566	1	18	t	f	\N	วันทำการ
1847	860	1	18	2566	1	18	f	f	\N	วันหยุด
1848	861	1	18	2566	1	18	f	f	\N	วันหยุด
1849	862	1	18	2566	1	19	t	f	\N	วันทำการ
1850	863	1	18	2566	1	19	t	f	\N	วันทำการ
1851	864	1	18	2566	1	19	t	f	\N	วันทำการ
1852	865	1	18	2566	1	19	t	f	\N	วันทำการ
1853	866	1	18	2566	1	19	t	f	\N	วันทำการ
1854	867	1	18	2566	1	19	f	f	\N	วันหยุด
1855	868	1	18	2566	1	19	f	f	\N	วันหยุด
1856	869	1	18	2566	1	20	t	f	\N	วันทำการ
1857	870	1	18	2566	1	20	t	f	\N	วันทำการ
1858	871	1	18	2566	1	20	t	f	\N	วันทำการ
1859	872	1	18	2566	1	20	t	f	\N	วันทำการ
1860	873	1	18	2566	1	20	f	t	วันนวมินทรมหาราช	วันหยุดนักขัตฤกษ์
1861	874	1	18	2566	1	20	f	f	\N	วันหยุด
1862	875	1	18	2566	1	20	f	f	\N	วันหยุด
1863	876	1	18	2566	1	21	t	f	\N	วันทำการ
1864	877	1	18	2566	1	21	t	f	\N	วันทำการ
1865	878	1	18	2566	1	21	t	f	\N	วันทำการ
1866	879	1	18	2566	1	21	t	f	\N	วันทำการ
1867	880	1	18	2566	1	21	t	f	\N	วันทำการ
1868	881	1	18	2566	1	21	f	f	\N	วันหยุด
1869	882	1	18	2566	1	21	f	f	\N	วันหยุด
1870	883	1	18	2566	1	22	f	t	วันปิยมหาราช	วันหยุดนักขัตฤกษ์
1871	884	1	18	2566	1	22	t	f	\N	วันทำการ
1872	885	1	18	2566	1	22	t	f	\N	วันทำการ
1873	886	1	18	2566	1	22	t	f	\N	วันทำการ
1874	887	1	18	2566	1	22	t	f	\N	วันทำการ
1875	888	1	18	2566	1	22	f	f	\N	วันหยุด
1876	889	1	18	2566	1	22	f	f	\N	วันหยุด
1877	890	1	18	2566	1	23	t	f	\N	วันทำการ
1878	891	1	18	2566	1	23	t	f	\N	วันทำการ
1879	892	1	18	2566	1	23	t	f	\N	วันทำการ
1880	893	1	18	2566	1	23	t	f	\N	วันทำการ
1881	894	1	18	2566	1	23	t	f	\N	วันทำการ
1882	895	1	18	2566	1	23	f	f	\N	วันหยุด
1883	896	1	18	2566	1	23	f	f	\N	วันหยุด
1884	897	1	18	2566	1	24	t	f	\N	วันทำการ
1885	898	1	18	2566	1	24	t	f	\N	วันทำการ
1886	899	1	18	2566	1	24	t	f	\N	วันทำการ
1887	900	1	18	2566	1	24	t	f	\N	วันทำการ
1888	901	1	18	2566	1	24	t	f	\N	วันทำการ
1889	902	1	18	2566	1	24	f	f	\N	วันหยุด
1890	903	1	18	2566	1	24	f	f	\N	วันหยุด
1891	904	1	18	2566	1	25	t	f	\N	วันทำการ
1892	905	1	18	2566	1	25	t	f	\N	วันทำการ
1893	906	1	18	2566	1	25	t	f	\N	วันทำการ
1894	907	1	18	2566	1	25	t	f	\N	วันทำการ
1895	908	1	18	2566	1	25	t	f	\N	วันทำการ
1896	909	1	18	2566	1	25	f	f	\N	วันหยุด
1897	910	1	18	2566	1	25	f	f	\N	วันหยุด
1898	911	1	18	2566	1	26	t	f	\N	วันทำการ
1899	912	1	18	2566	1	26	t	f	\N	วันทำการ
1900	913	1	18	2566	1	26	t	f	\N	วันทำการ
1901	914	1	18	2566	1	26	t	f	\N	วันทำการ
1902	915	1	18	2566	1	26	t	f	\N	วันทำการ
1903	916	1	18	2566	1	26	f	f	\N	วันหยุด
1904	917	1	18	2566	1	26	f	f	\N	วันหยุด
1905	918	1	18	2566	1	27	t	f	\N	วันทำการ
1906	919	1	18	2566	1	27	t	f	\N	วันทำการ
1907	920	1	18	2566	1	27	t	f	\N	วันทำการ
1908	921	1	18	2566	1	27	t	f	\N	วันทำการ
1909	922	1	18	2566	1	27	t	f	\N	วันทำการ
1910	923	1	18	2566	1	27	f	f	\N	วันหยุด
1911	924	1	18	2566	1	27	f	f	\N	วันหยุด
1912	925	1	18	2566	1	28	t	f	\N	วันทำการ
1913	926	1	18	2566	1	28	f	t	วันพ่อแห่งชาติ	วันหยุดนักขัตฤกษ์
1914	927	1	18	2566	1	28	t	f	\N	วันทำการ
1915	928	1	18	2566	1	28	t	f	\N	วันทำการ
1916	929	1	18	2566	1	28	t	f	\N	วันทำการ
1917	930	1	18	2566	1	28	f	f	\N	วันหยุด
1918	931	1	18	2566	1	28	f	t	วันรัฐธรรมนูญ	วันหยุดนักขัตฤกษ์
1919	932	1	18	2566	1	29	f	t	ชดเชยวันรัฐธรรมนูญ	วันหยุดนักขัตฤกษ์
1920	933	1	18	2566	1	29	t	f	\N	วันทำการ
1921	934	1	18	2566	1	29	t	f	\N	วันทำการ
1922	935	1	18	2566	1	29	t	f	\N	วันทำการ
1923	936	1	18	2566	1	29	t	f	\N	วันทำการ
1924	937	1	18	2566	1	29	f	f	\N	วันหยุด
1925	938	1	18	2566	1	29	f	f	\N	วันหยุด
1926	939	1	18	2566	1	30	t	f	\N	วันทำการ
1927	940	1	18	2566	1	30	t	f	\N	วันทำการ
1928	941	1	18	2566	1	30	t	f	\N	วันทำการ
1929	942	1	18	2566	1	30	t	f	\N	วันทำการ
1930	943	1	18	2566	1	30	t	f	\N	วันทำการ
1931	944	1	18	2566	1	30	f	f	\N	วันหยุด
1932	945	1	18	2566	1	30	f	t	วันคริสต์มาสอีฟ	วันหยุดนักขัตฤกษ์
1933	946	1	18	2566	1	31	f	t	วันคริสต์มาส	วันหยุดนักขัตฤกษ์
1934	947	1	18	2566	1	31	t	f	\N	วันทำการ
1935	948	1	18	2566	1	31	t	f	\N	วันทำการ
1936	949	1	18	2566	1	31	t	f	\N	วันทำการ
1937	950	1	18	2566	1	31	f	t	วันหยุดราชการธันวาคม	วันหยุดนักขัตฤกษ์
1938	951	1	18	2566	1	31	f	f	\N	วันหยุด
1939	952	1	18	2566	1	31	f	t	วันสิ้นปี	วันหยุดนักขัตฤกษ์
1940	953	1	18	2566	1	32	f	t	วันขึ้นปีใหม่	วันหยุดนักขัตฤกษ์
1941	954	1	18	2566	1	32	t	f	\N	วันทำการ
1942	955	1	18	2566	1	32	t	f	\N	วันทำการ
1943	956	1	18	2566	1	32	t	f	\N	วันทำการ
1944	957	1	18	2566	1	32	t	f	\N	วันทำการ
1945	958	1	18	2566	1	32	f	f	\N	วันหยุด
1946	959	1	18	2566	1	32	f	f	\N	วันหยุด
1947	960	1	18	2566	1	33	t	f	\N	วันทำการ
1948	961	1	18	2566	1	33	t	f	\N	วันทำการ
1949	962	1	18	2566	1	33	t	f	\N	วันทำการ
1950	963	1	18	2566	1	33	t	f	\N	วันทำการ
1951	964	1	18	2566	1	33	t	f	\N	วันทำการ
1952	965	1	18	2566	1	33	f	f	\N	วันหยุด
1953	966	1	18	2566	1	33	f	f	\N	วันหยุด
1954	967	1	18	2566	1	34	t	f	\N	วันทำการ
1955	968	1	18	2566	1	34	t	f	\N	วันทำการ
1956	969	1	18	2566	1	34	t	f	\N	วันทำการ
1957	970	1	18	2566	1	34	t	f	\N	วันทำการ
1958	971	1	18	2566	1	34	t	f	\N	วันทำการ
1959	972	1	18	2566	1	34	f	f	\N	วันหยุด
1960	973	1	18	2566	1	34	f	f	\N	วันหยุด
1961	974	1	18	2566	1	35	t	f	\N	วันทำการ
1962	975	1	18	2566	1	35	t	f	\N	วันทำการ
1963	976	1	18	2566	1	35	t	f	\N	วันทำการ
1964	977	1	18	2566	1	35	f	t	วันมาฆบูชา	วันหยุดนักขัตฤกษ์
1965	978	1	18	2566	1	35	t	f	\N	วันทำการ
1966	979	1	18	2566	1	35	f	f	\N	วันหยุด
1967	980	1	18	2566	1	35	f	f	\N	วันหยุด
1968	981	1	18	2566	1	36	t	f	\N	วันทำการ
1969	982	1	18	2566	1	36	t	f	\N	วันทำการ
1970	983	1	18	2566	1	36	t	f	\N	วันทำการ
1971	984	1	18	2566	1	36	t	f	\N	วันทำการ
1972	985	1	18	2566	1	36	t	f	\N	วันทำการ
1973	986	1	18	2566	1	36	f	f	\N	วันหยุด
1974	987	1	18	2566	1	36	f	f	\N	วันหยุด
1975	988	1	18	2566	1	37	t	f	\N	วันทำการ
1976	989	1	18	2566	1	37	t	f	\N	วันทำการ
1977	990	1	18	2566	1	37	t	f	\N	วันทำการ
1978	991	1	18	2566	1	37	t	f	\N	วันทำการ
1979	992	1	18	2566	1	37	t	f	\N	วันทำการ
1980	993	1	18	2566	1	37	f	t	วันตรุษจีน	วันหยุดนักขัตฤกษ์
1981	994	1	18	2566	1	37	f	t	วันตรุษจีน (วันที่ 2)	วันหยุดนักขัตฤกษ์
1982	995	1	18	2566	1	38	f	t	วันตรุษจีน (วันที่ 3)	วันหยุดนักขัตฤกษ์
1983	996	1	18	2566	1	38	t	f	\N	วันทำการ
1984	997	1	18	2566	1	38	f	t	วันวาเลนไทน์	วันหยุดนักขัตฤกษ์
1985	998	1	18	2566	1	38	t	f	\N	วันทำการ
1986	999	1	18	2566	1	38	t	f	\N	วันทำการ
1987	1000	1	18	2566	1	38	f	f	\N	วันหยุด
1988	1001	1	18	2566	1	38	f	f	\N	วันหยุด
1989	1002	1	18	2566	1	39	t	f	\N	วันทำการ
1990	1003	1	18	2566	1	39	t	f	\N	วันทำการ
1991	1004	1	18	2566	1	39	t	f	\N	วันทำการ
1992	1005	1	18	2566	1	39	t	f	\N	วันทำการ
1993	1006	1	18	2566	1	39	t	f	\N	วันทำการ
1994	1007	1	18	2566	1	39	f	t	วันมาฆบูชา	วันหยุดนักขัตฤกษ์
1995	1008	1	18	2566	1	39	f	f	\N	วันหยุด
1996	1009	1	18	2566	1	40	f	t	วันหยุดชดเชยวันมาฆบูชา	วันหยุดนักขัตฤกษ์
1997	1010	1	18	2566	1	40	t	f	\N	วันทำการ
1998	1011	1	18	2566	1	40	t	f	\N	วันทำการ
1999	1012	1	18	2566	1	40	t	f	\N	วันทำการ
2000	1013	1	18	2566	1	40	t	f	\N	วันทำการ
2001	1014	1	18	2566	1	40	f	f	\N	วันหยุด
2002	1015	1	18	2566	1	40	f	f	\N	วันหยุด
2003	1016	1	18	2566	1	41	t	f	\N	วันทำการ
2004	1017	1	18	2566	1	41	t	f	\N	วันทำการ
2005	1018	1	18	2566	1	41	t	f	\N	วันทำการ
2006	1019	1	18	2566	1	41	t	f	\N	วันทำการ
2007	1020	1	18	2566	1	41	t	f	\N	วันทำการ
2008	1021	1	18	2566	1	41	f	f	\N	วันหยุด
2009	1022	1	18	2566	1	41	f	f	\N	วันหยุด
2010	1023	1	18	2566	1	42	t	f	\N	วันทำการ
2011	1024	1	18	2566	1	42	t	f	\N	วันทำการ
2012	1025	1	18	2566	1	42	t	f	\N	วันทำการ
2013	1026	1	18	2566	1	42	t	f	\N	วันทำการ
2014	1027	1	18	2566	1	42	t	f	\N	วันทำการ
2015	1028	1	18	2566	1	42	f	f	\N	วันหยุด
2016	1029	1	18	2566	1	42	f	f	\N	วันหยุด
2017	1030	1	18	2566	1	43	t	f	\N	วันทำการ
2018	1031	1	18	2566	1	43	t	f	\N	วันทำการ
2019	1032	1	18	2566	1	43	t	f	\N	วันทำการ
2020	1033	1	18	2566	1	43	t	f	\N	วันทำการ
2021	1034	1	18	2566	1	43	t	f	\N	วันทำการ
2022	1035	1	18	2566	1	43	f	f	\N	วันหยุด
2023	1036	1	18	2566	1	43	f	f	\N	วันหยุด
2024	1037	1	18	2566	1	44	t	f	\N	วันทำการ
2025	1038	1	18	2566	1	44	t	f	\N	วันทำการ
2026	1039	1	18	2566	1	44	t	f	\N	วันทำการ
2027	1040	1	18	2566	1	44	t	f	\N	วันทำการ
2028	1041	1	18	2566	1	44	t	f	\N	วันทำการ
2029	1042	1	18	2566	1	44	f	f	\N	วันหยุด
2030	1043	1	18	2566	1	44	f	f	\N	วันหยุด
2031	1044	1	18	2566	1	45	t	f	\N	วันทำการ
2032	1045	1	18	2566	1	45	t	f	\N	วันทำการ
2033	1046	1	18	2566	1	45	t	f	\N	วันทำการ
2034	1047	1	18	2566	1	45	t	f	\N	วันทำการ
2035	1048	1	18	2566	1	45	t	f	\N	วันทำการ
2036	1049	1	18	2566	1	45	f	t	วันจักรี	วันหยุดนักขัตฤกษ์
2037	1050	1	18	2566	1	45	f	f	\N	วันหยุด
2038	1051	1	18	2566	1	46	f	t	ชดเชยวันจักรี	วันหยุดนักขัตฤกษ์
2039	1052	1	18	2566	1	46	t	f	\N	วันทำการ
2040	1053	1	18	2566	1	46	t	f	\N	วันทำการ
2041	1054	1	18	2566	1	46	t	f	\N	วันทำการ
2042	1055	1	18	2566	1	46	f	t	วันสงกรานต์	วันหยุดนักขัตฤกษ์
2043	1056	1	18	2566	1	46	f	t	วันสงกรานต์	วันหยุดนักขัตฤกษ์
2044	1057	1	18	2566	1	46	f	t	วันสงกรานต์	วันหยุดนักขัตฤกษ์
2045	1058	1	18	2566	1	47	f	t	วันสงกรานต์	วันหยุดนักขัตฤกษ์
2046	1059	1	18	2566	1	47	f	t	ชดเชยวันสงกรานต์	วันหยุดนักขัตฤกษ์
2047	1060	1	18	2566	1	47	t	f	\N	วันทำการ
2048	1061	1	18	2566	1	47	t	f	\N	วันทำการ
764	764	1	1	2566	1	1	t	f	\N	วันทำการ
765	765	1	1	2566	1	1	t	f	\N	วันทำการ
766	766	1	1	2566	1	1	t	f	\N	วันทำการ
767	767	1	1	2566	1	1	t	f	\N	วันทำการ
768	768	1	1	2566	1	1	t	f	\N	วันทำการ
769	769	1	1	2566	1	1	f	f	\N	วันหยุด
770	770	1	1	2566	1	1	f	f	\N	วันหยุด
771	771	1	1	2566	1	2	f	t	วันอาสาฬหบูชา	วันหยุดนักขัตฤกษ์
772	772	1	1	2566	1	2	f	t	วันเข้าพรรษา	วันหยุดนักขัตฤกษ์
773	773	1	1	2566	1	2	t	f	\N	วันทำการ
774	774	1	1	2566	1	2	t	f	\N	วันทำการ
775	775	1	1	2566	1	2	t	f	\N	วันทำการ
776	776	1	1	2566	1	2	f	f	\N	วันหยุด
777	777	1	1	2566	1	2	f	f	\N	วันหยุด
778	778	1	1	2566	1	3	t	f	\N	วันทำการ
779	779	1	1	2566	1	3	t	f	\N	วันทำการ
780	780	1	1	2566	1	3	t	f	\N	วันทำการ
781	781	1	1	2566	1	3	t	f	\N	วันทำการ
782	782	1	1	2566	1	3	t	f	\N	วันทำการ
783	783	1	1	2566	1	3	f	f	\N	วันหยุด
784	784	1	1	2566	1	3	f	f	\N	วันหยุด
785	785	1	1	2566	1	4	t	f	\N	วันทำการ
786	786	1	1	2566	1	4	t	f	\N	วันทำการ
787	787	1	1	2566	1	4	t	f	\N	วันทำการ
788	788	1	1	2566	1	4	t	f	\N	วันทำการ
789	789	1	1	2566	1	4	t	f	\N	วันทำการ
790	790	1	1	2566	1	4	f	f	\N	วันหยุด
791	791	1	1	2566	1	4	f	f	\N	วันหยุด
792	792	1	1	2566	1	5	t	f	\N	วันทำการ
793	793	1	1	2566	1	5	t	f	\N	วันทำการ
794	794	1	1	2566	1	5	t	f	\N	วันทำการ
795	795	1	1	2566	1	5	t	f	\N	วันทำการ
796	796	1	1	2566	1	5	f	t	วันเฉลิมฯ ร.10	วันหยุดนักขัตฤกษ์
797	797	1	1	2566	1	5	f	f	\N	วันหยุด
798	798	1	1	2566	1	5	f	f	\N	วันหยุด
799	799	1	1	2566	1	6	f	t	นักขัตฤกษ์	วันหยุดนักขัตฤกษ์
800	800	1	1	2566	1	6	f	t	วันอาสาฬหบูชา	วันหยุดนักขัตฤกษ์
801	801	1	1	2566	1	6	t	f	\N	วันทำการ
802	802	1	1	2566	1	6	t	f	\N	วันทำการ
803	803	1	1	2566	1	6	t	f	\N	วันทำการ
804	804	1	1	2566	1	6	f	f	\N	วันหยุด
805	805	1	1	2566	1	6	f	f	\N	วันหยุด
806	806	1	1	2566	1	7	t	f	\N	วันทำการ
807	807	1	1	2566	1	7	t	f	\N	วันทำการ
808	808	1	1	2566	1	7	t	f	\N	วันทำการ
809	809	1	1	2566	1	7	t	f	\N	วันทำการ
810	810	1	1	2566	1	7	t	f	\N	วันทำการ
811	811	1	1	2566	1	7	f	t	วันแม่แห่งชาติ	วันหยุดนักขัตฤกษ์
812	812	1	1	2566	1	7	f	f	\N	วันหยุด
813	813	1	1	2566	1	8	f	t	ชดเชยวันแม่แห่งชาติ	วันหยุดนักขัตฤกษ์
814	814	1	1	2566	1	8	t	f	\N	วันทำการ
815	815	1	1	2566	1	8	t	f	\N	วันทำการ
816	816	1	1	2566	1	8	t	f	\N	วันทำการ
817	817	1	1	2566	1	8	t	f	\N	วันทำการ
818	818	1	1	2566	1	8	f	f	\N	วันหยุด
819	819	1	1	2566	1	8	f	f	\N	วันหยุด
820	820	1	1	2566	1	9	t	f	\N	วันทำการ
821	821	1	1	2566	1	9	t	f	\N	วันทำการ
822	822	1	1	2566	1	9	t	f	\N	วันทำการ
823	823	1	1	2566	1	9	t	f	\N	วันทำการ
824	824	1	1	2566	1	9	t	f	\N	วันทำการ
825	825	1	1	2566	1	9	f	f	\N	วันหยุด
826	826	1	1	2566	1	9	f	f	\N	วันหยุด
827	827	1	1	2566	1	10	t	f	\N	วันทำการ
828	828	1	1	2566	1	10	t	f	\N	วันทำการ
829	829	1	1	2566	1	10	t	f	\N	วันทำการ
830	830	1	1	2566	1	10	t	f	\N	วันทำการ
831	831	1	1	2566	1	10	t	f	\N	วันทำการ
832	832	1	1	2566	1	10	f	f	\N	วันหยุด
833	833	1	1	2566	1	10	f	f	\N	วันหยุด
834	834	1	1	2566	1	11	t	f	\N	วันทำการ
835	835	1	1	2566	1	11	t	f	\N	วันทำการ
836	836	1	1	2566	1	11	t	f	\N	วันทำการ
837	837	1	1	2566	1	11	t	f	\N	วันทำการ
838	838	1	1	2566	1	11	t	f	\N	วันทำการ
839	839	1	1	2566	1	11	f	f	\N	วันหยุด
840	840	1	1	2566	1	11	f	f	\N	วันหยุด
841	841	1	1	2566	1	12	t	f	\N	วันทำการ
842	842	1	1	2566	1	12	t	f	\N	วันทำการ
843	843	1	1	2566	1	12	t	f	\N	วันทำการ
844	844	1	1	2566	1	12	t	f	\N	วันทำการ
845	845	1	1	2566	1	12	t	f	\N	วันทำการ
846	846	1	1	2566	1	12	f	f	\N	วันหยุด
847	847	1	1	2566	1	12	f	f	\N	วันหยุด
848	848	1	1	2566	1	13	t	f	\N	วันทำการ
849	849	1	1	2566	1	13	t	f	\N	วันทำการ
850	850	1	1	2566	1	13	t	f	\N	วันทำการ
851	851	1	1	2566	1	13	t	f	\N	วันทำการ
852	852	1	1	2566	1	13	f	t	วันสงขลานครินทร์	วันหยุดนักขัตฤกษ์
853	853	1	1	2566	1	13	f	f	\N	วันหยุด
854	854	1	1	2566	1	13	f	f	\N	วันหยุด
855	855	1	1	2566	1	14	t	f	\N	วันทำการ
856	856	1	1	2566	1	14	t	f	\N	วันทำการ
857	857	1	1	2566	1	14	t	f	\N	วันทำการ
858	858	1	1	2566	1	14	t	f	\N	วันทำการ
859	859	1	1	2566	1	14	t	f	\N	วันทำการ
860	860	1	1	2566	1	14	f	f	\N	วันหยุด
861	861	1	1	2566	1	14	f	f	\N	วันหยุด
862	862	1	1	2566	1	15	t	f	\N	วันทำการ
863	863	1	1	2566	1	15	t	f	\N	วันทำการ
864	864	1	1	2566	1	15	t	f	\N	วันทำการ
865	865	1	1	2566	1	15	t	f	\N	วันทำการ
866	866	1	1	2566	1	15	t	f	\N	วันทำการ
867	867	1	1	2566	1	15	f	f	\N	วันหยุด
868	868	1	1	2566	1	15	f	f	\N	วันหยุด
869	869	1	1	2566	1	16	t	f	\N	วันทำการ
870	870	1	1	2566	1	16	t	f	\N	วันทำการ
871	871	1	1	2566	1	16	t	f	\N	วันทำการ
872	872	1	1	2566	1	16	t	f	\N	วันทำการ
873	873	1	1	2566	1	16	f	t	วันนวมินทรมหาราช	วันหยุดนักขัตฤกษ์
874	874	1	1	2566	1	16	f	f	\N	วันหยุด
875	875	1	1	2566	1	16	f	f	\N	วันหยุด
876	876	1	1	2566	1	17	t	f	\N	วันทำการ
877	877	1	1	2566	1	17	t	f	\N	วันทำการ
878	878	1	1	2566	1	17	t	f	\N	วันทำการ
879	879	1	1	2566	1	17	t	f	\N	วันทำการ
880	880	1	1	2566	1	17	t	f	\N	วันทำการ
881	881	1	1	2566	1	17	f	f	\N	วันหยุด
882	882	1	1	2566	1	17	f	f	\N	วันหยุด
883	883	1	1	2566	1	18	f	t	วันปิยมหาราช	วันหยุดนักขัตฤกษ์
884	884	1	1	2566	1	18	t	f	\N	วันทำการ
885	885	1	1	2566	1	18	t	f	\N	วันทำการ
886	886	1	1	2566	1	18	t	f	\N	วันทำการ
887	887	1	1	2566	1	18	t	f	\N	วันทำการ
888	888	1	1	2566	1	18	f	f	\N	วันหยุด
889	889	1	1	2566	\N	\N	f	f	\N	วันหยุด
890	890	1	1	2566	\N	\N	f	f	\N	ปิดภาค
891	891	1	1	2566	\N	\N	f	f	\N	ปิดภาค
892	892	1	1	2566	\N	\N	f	f	\N	ปิดภาค
893	893	1	1	2566	\N	\N	f	f	\N	ปิดภาค
894	894	1	1	2566	\N	\N	f	f	\N	ปิดภาค
895	895	1	1	2566	\N	\N	f	f	\N	วันหยุด
896	896	1	1	2566	\N	\N	f	f	\N	วันหยุด
897	897	1	1	2566	\N	\N	f	f	\N	ปิดภาค
898	898	1	1	2566	\N	\N	f	f	\N	ปิดภาค
899	899	1	1	2566	\N	\N	f	f	\N	ปิดภาค
900	900	1	1	2566	\N	\N	f	f	\N	ปิดภาค
901	901	1	1	2566	\N	\N	f	f	\N	ปิดภาค
902	902	1	1	2566	\N	\N	f	f	\N	วันหยุด
903	903	1	1	2566	\N	\N	f	f	\N	วันหยุด
904	904	1	1	2566	\N	\N	f	f	\N	ปิดภาค
905	905	1	1	2566	\N	\N	f	f	\N	ปิดภาค
906	906	1	1	2566	\N	\N	f	f	\N	ปิดภาค
907	907	1	1	2566	\N	\N	f	f	\N	ปิดภาค
908	908	1	1	2566	\N	\N	f	f	\N	ปิดภาค
909	909	1	1	2566	\N	\N	f	f	\N	วันหยุด
910	910	1	1	2566	\N	\N	f	f	\N	วันหยุด
911	911	1	1	2566	2	1	t	f	\N	วันทำการ
912	912	1	1	2566	2	1	t	f	\N	วันทำการ
913	913	1	1	2566	2	1	t	f	\N	วันทำการ
914	914	1	1	2566	2	1	t	f	\N	วันทำการ
915	915	1	1	2566	2	1	t	f	\N	วันทำการ
916	916	1	1	2566	2	1	f	f	\N	วันหยุด
917	917	1	1	2566	2	1	f	f	\N	วันหยุด
918	918	1	1	2566	2	2	t	f	\N	วันทำการ
919	919	1	1	2566	2	2	t	f	\N	วันทำการ
920	920	1	1	2566	2	2	t	f	\N	วันทำการ
921	921	1	1	2566	2	2	t	f	\N	วันทำการ
922	922	1	1	2566	2	2	t	f	\N	วันทำการ
923	923	1	1	2566	2	2	f	f	\N	วันหยุด
924	924	1	1	2566	2	2	f	f	\N	วันหยุด
925	925	1	1	2566	2	3	t	f	\N	วันทำการ
926	926	1	1	2566	2	3	f	t	วันพ่อแห่งชาติ	วันหยุดนักขัตฤกษ์
927	927	1	1	2566	2	3	t	f	\N	วันทำการ
928	928	1	1	2566	2	3	t	f	\N	วันทำการ
929	929	1	1	2566	2	3	t	f	\N	วันทำการ
930	930	1	1	2566	2	3	f	f	\N	วันหยุด
931	931	1	1	2566	2	3	f	t	วันรัฐธรรมนูญ	วันหยุดนักขัตฤกษ์
932	932	1	1	2566	2	4	f	t	ชดเชยวันรัฐธรรมนูญ	วันหยุดนักขัตฤกษ์
933	933	1	1	2566	2	4	t	f	\N	วันทำการ
934	934	1	1	2566	2	4	t	f	\N	วันทำการ
935	935	1	1	2566	2	4	t	f	\N	วันทำการ
936	936	1	1	2566	2	4	t	f	\N	วันทำการ
937	937	1	1	2566	2	4	f	f	\N	วันหยุด
938	938	1	1	2566	2	4	f	f	\N	วันหยุด
939	939	1	1	2566	2	5	t	f	\N	วันทำการ
940	940	1	1	2566	2	5	t	f	\N	วันทำการ
941	941	1	1	2566	2	5	t	f	\N	วันทำการ
942	942	1	1	2566	2	5	t	f	\N	วันทำการ
943	943	1	1	2566	2	5	t	f	\N	วันทำการ
944	944	1	1	2566	2	5	f	f	\N	วันหยุด
945	945	1	1	2566	2	5	f	t	วันคริสต์มาสอีฟ	วันหยุดนักขัตฤกษ์
946	946	1	1	2566	2	6	f	t	วันคริสต์มาส	วันหยุดนักขัตฤกษ์
947	947	1	1	2566	2	6	t	f	\N	วันทำการ
948	948	1	1	2566	2	6	t	f	\N	วันทำการ
949	949	1	1	2566	2	6	t	f	\N	วันทำการ
950	950	1	1	2566	2	6	f	t	วันหยุดราชการธันวาคม	วันหยุดนักขัตฤกษ์
951	951	1	1	2566	2	6	f	f	\N	วันหยุด
952	952	1	1	2566	2	6	f	t	วันสิ้นปี	วันหยุดนักขัตฤกษ์
953	953	1	1	2566	2	7	f	t	วันขึ้นปีใหม่	วันหยุดนักขัตฤกษ์
954	954	1	1	2566	2	7	t	f	\N	วันทำการ
955	955	1	1	2566	2	7	t	f	\N	วันทำการ
956	956	1	1	2566	2	7	t	f	\N	วันทำการ
957	957	1	1	2566	2	7	t	f	\N	วันทำการ
958	958	1	1	2566	2	7	f	f	\N	วันหยุด
959	959	1	1	2566	2	7	f	f	\N	วันหยุด
960	960	1	1	2566	2	8	t	f	\N	วันทำการ
961	961	1	1	2566	2	8	t	f	\N	วันทำการ
962	962	1	1	2566	2	8	t	f	\N	วันทำการ
963	963	1	1	2566	2	8	t	f	\N	วันทำการ
964	964	1	1	2566	2	8	t	f	\N	วันทำการ
965	965	1	1	2566	2	8	f	f	\N	วันหยุด
966	966	1	1	2566	2	8	f	f	\N	วันหยุด
967	967	1	1	2566	2	9	t	f	\N	วันทำการ
968	968	1	1	2566	2	9	t	f	\N	วันทำการ
969	969	1	1	2566	2	9	t	f	\N	วันทำการ
970	970	1	1	2566	2	9	t	f	\N	วันทำการ
971	971	1	1	2566	2	9	t	f	\N	วันทำการ
972	972	1	1	2566	2	9	f	f	\N	วันหยุด
973	973	1	1	2566	2	9	f	f	\N	วันหยุด
974	974	1	1	2566	2	10	t	f	\N	วันทำการ
975	975	1	1	2566	2	10	t	f	\N	วันทำการ
976	976	1	1	2566	2	10	t	f	\N	วันทำการ
977	977	1	1	2566	2	10	f	t	วันมาฆบูชา	วันหยุดนักขัตฤกษ์
978	978	1	1	2566	2	10	t	f	\N	วันทำการ
979	979	1	1	2566	2	10	f	f	\N	วันหยุด
980	980	1	1	2566	2	10	f	f	\N	วันหยุด
981	981	1	1	2566	2	11	t	f	\N	วันทำการ
982	982	1	1	2566	2	11	t	f	\N	วันทำการ
983	983	1	1	2566	2	11	t	f	\N	วันทำการ
984	984	1	1	2566	2	11	t	f	\N	วันทำการ
985	985	1	1	2566	2	11	t	f	\N	วันทำการ
986	986	1	1	2566	2	11	f	f	\N	วันหยุด
987	987	1	1	2566	2	11	f	f	\N	วันหยุด
988	988	1	1	2566	2	12	t	f	\N	วันทำการ
989	989	1	1	2566	2	12	t	f	\N	วันทำการ
990	990	1	1	2566	2	12	t	f	\N	วันทำการ
991	991	1	1	2566	2	12	t	f	\N	วันทำการ
992	992	1	1	2566	2	12	t	f	\N	วันทำการ
993	993	1	1	2566	2	12	f	t	วันตรุษจีน	วันหยุดนักขัตฤกษ์
994	994	1	1	2566	2	12	f	t	วันตรุษจีน (วันที่ 2)	วันหยุดนักขัตฤกษ์
995	995	1	1	2566	2	13	f	t	วันตรุษจีน (วันที่ 3)	วันหยุดนักขัตฤกษ์
996	996	1	1	2566	2	13	t	f	\N	วันทำการ
997	997	1	1	2566	2	13	f	t	วันวาเลนไทน์	วันหยุดนักขัตฤกษ์
998	998	1	1	2566	2	13	t	f	\N	วันทำการ
999	999	1	1	2566	2	13	t	f	\N	วันทำการ
1000	1000	1	1	2566	2	13	f	f	\N	วันหยุด
1001	1001	1	1	2566	2	13	f	f	\N	วันหยุด
1002	1002	1	1	2566	2	14	t	f	\N	วันทำการ
1003	1003	1	1	2566	2	14	t	f	\N	วันทำการ
1004	1004	1	1	2566	2	14	t	f	\N	วันทำการ
1005	1005	1	1	2566	2	14	t	f	\N	วันทำการ
1006	1006	1	1	2566	2	14	t	f	\N	วันทำการ
1007	1007	1	1	2566	2	14	f	t	วันมาฆบูชา	วันหยุดนักขัตฤกษ์
1008	1008	1	1	2566	2	14	f	f	\N	วันหยุด
1009	1009	1	1	2566	2	15	f	t	วันหยุดชดเชยวันมาฆบูชา	วันหยุดนักขัตฤกษ์
1010	1010	1	1	2566	2	15	t	f	\N	วันทำการ
1011	1011	1	1	2566	2	15	t	f	\N	วันทำการ
1012	1012	1	1	2566	2	15	t	f	\N	วันทำการ
1013	1013	1	1	2566	2	15	t	f	\N	วันทำการ
1014	1014	1	1	2566	2	15	f	f	\N	วันหยุด
1015	1015	1	1	2566	2	15	f	f	\N	วันหยุด
1016	1016	1	1	2566	2	16	t	f	\N	วันทำการ
1017	1017	1	1	2566	2	16	t	f	\N	วันทำการ
1018	1018	1	1	2566	2	16	t	f	\N	วันทำการ
1019	1019	1	1	2566	2	16	t	f	\N	วันทำการ
1020	1020	1	1	2566	2	16	t	f	\N	วันทำการ
1021	1021	1	1	2566	2	16	f	f	\N	วันหยุด
1022	1022	1	1	2566	2	16	f	f	\N	วันหยุด
1023	1023	1	1	2566	2	17	t	f	\N	วันทำการ
1024	1024	1	1	2566	2	17	t	f	\N	วันทำการ
1025	1025	1	1	2566	2	17	t	f	\N	วันทำการ
1026	1026	1	1	2566	2	17	t	f	\N	วันทำการ
1027	1027	1	1	2566	2	17	t	f	\N	วันทำการ
1028	1028	1	1	2566	2	17	f	f	\N	วันหยุด
1029	1029	1	1	2566	2	17	f	f	\N	วันหยุด
1030	1030	1	1	2566	2	18	t	f	\N	วันทำการ
1031	1031	1	1	2566	2	18	t	f	\N	วันทำการ
1032	1032	1	1	2566	2	18	t	f	\N	วันทำการ
1033	1033	1	1	2566	2	18	t	f	\N	วันทำการ
1034	1034	1	1	2566	2	18	t	f	\N	วันทำการ
1035	1035	1	1	2566	2	18	f	f	\N	วันหยุด
1036	1036	1	1	2566	\N	\N	f	f	\N	วันหยุด
1037	1037	1	1	2566	\N	\N	f	f	\N	ปิดภาค
1038	1038	1	1	2566	\N	\N	f	f	\N	ปิดภาค
1039	1039	1	1	2566	\N	\N	f	f	\N	ปิดภาค
1040	1040	1	1	2566	\N	\N	f	f	\N	ปิดภาค
1041	1041	1	1	2566	\N	\N	f	f	\N	ปิดภาค
1042	1042	1	1	2566	\N	\N	f	f	\N	วันหยุด
1043	1043	1	1	2566	\N	\N	f	f	\N	วันหยุด
1044	1044	1	1	2566	\N	\N	f	f	\N	ปิดภาค
1045	1045	1	1	2566	\N	\N	f	f	\N	ปิดภาค
1046	1046	1	1	2566	\N	\N	f	f	\N	ปิดภาค
1047	1047	1	1	2566	\N	\N	f	f	\N	ปิดภาค
1048	1048	1	1	2566	\N	\N	f	f	\N	ปิดภาค
1049	1049	1	1	2566	\N	\N	f	t	วันจักรี	วันหยุดนักขัตฤกษ์
1050	1050	1	1	2566	\N	\N	f	f	\N	วันหยุด
1051	1051	1	1	2566	\N	\N	f	t	ชดเชยวันจักรี	วันหยุดนักขัตฤกษ์
1052	1052	1	1	2566	\N	\N	f	f	\N	ปิดภาค
1053	1053	1	1	2566	\N	\N	f	f	\N	ปิดภาค
1054	1054	1	1	2566	\N	\N	f	f	\N	ปิดภาค
1055	1055	1	1	2566	\N	\N	f	t	วันสงกรานต์	วันหยุดนักขัตฤกษ์
1056	1056	1	1	2566	\N	\N	f	t	วันสงกรานต์	วันหยุดนักขัตฤกษ์
1057	1057	1	1	2566	\N	\N	f	t	วันสงกรานต์	วันหยุดนักขัตฤกษ์
1058	1058	1	1	2566	\N	\N	f	t	วันสงกรานต์	วันหยุดนักขัตฤกษ์
1059	1059	1	1	2566	\N	\N	f	t	ชดเชยวันสงกรานต์	วันหยุดนักขัตฤกษ์
1060	1060	1	1	2566	3	1	t	f	\N	วันทำการ
1061	1061	1	1	2566	3	1	t	f	\N	วันทำการ
1062	1062	1	1	2566	3	1	t	f	\N	วันทำการ
1063	1063	1	1	2566	3	1	f	f	\N	วันหยุด
1064	1064	1	1	2566	3	1	f	f	\N	วันหยุด
1065	1065	1	1	2566	3	2	t	f	\N	วันทำการ
1066	1066	1	1	2566	3	2	f	t	วันวิสาขบูชา	วันหยุดนักขัตฤกษ์
1067	1067	1	1	2566	3	2	t	f	\N	วันทำการ
1068	1068	1	1	2566	3	2	t	f	\N	วันทำการ
1069	1069	1	1	2566	3	2	t	f	\N	วันทำการ
1070	1070	1	1	2566	3	2	f	f	\N	วันหยุด
1071	1071	1	1	2566	3	2	f	f	\N	วันหยุด
1072	1072	1	1	2566	3	3	t	f	\N	วันทำการ
1073	1073	1	1	2566	3	3	t	f	\N	วันทำการ
1074	1074	1	1	2566	3	3	f	t	วันแรงงานแห่งชาติ	วันหยุดนักขัตฤกษ์
1075	1075	1	1	2566	3	3	t	f	\N	วันทำการ
1076	1076	1	1	2566	3	3	t	f	\N	วันทำการ
1077	1077	1	1	2566	3	3	f	t	วันฉัตรมงคล	วันหยุดนักขัตฤกษ์
1078	1078	1	1	2566	3	3	f	f	\N	วันหยุด
1079	1079	1	1	2566	3	4	f	t	วันหยุดชดเชยวันฉัตรมงคล	วันหยุดนักขัตฤกษ์
1080	1080	1	1	2566	3	4	t	f	\N	วันทำการ
1081	1081	1	1	2566	3	4	t	f	\N	วันทำการ
1082	1082	1	1	2566	3	4	t	f	\N	วันทำการ
1083	1083	1	1	2566	3	4	f	t	วันพืชมงคล	วันหยุดนักขัตฤกษ์
1084	1084	1	1	2566	3	4	f	f	\N	วันหยุด
1085	1085	1	1	2566	3	4	f	f	\N	วันหยุด
1086	1086	1	1	2566	3	5	t	f	\N	วันทำการ
1087	1087	1	1	2566	3	5	t	f	\N	วันทำการ
1088	1088	1	1	2566	3	5	t	f	\N	วันทำการ
1089	1089	1	1	2566	3	5	t	f	\N	วันทำการ
1090	1090	1	1	2566	3	5	t	f	\N	วันทำการ
1091	1091	1	1	2566	3	5	f	f	\N	วันหยุด
1092	1092	1	1	2566	3	5	f	f	\N	วันหยุด
1093	1093	1	1	2566	3	6	t	f	\N	วันทำการ
1094	1094	1	1	2566	3	6	t	f	\N	วันทำการ
1095	1095	1	1	2566	3	6	f	t	วันวิสาขบูชา	วันหยุดนักขัตฤกษ์
1096	1096	1	1	2566	3	6	t	f	\N	วันทำการ
1097	1097	1	1	2566	3	6	t	f	\N	วันทำการ
1098	1098	1	1	2566	3	6	f	f	\N	วันหยุด
1099	1099	1	1	2566	3	6	f	f	\N	วันหยุด
1100	1100	1	1	2566	3	7	t	f	\N	วันทำการ
1101	1101	1	1	2566	3	7	t	f	\N	วันทำการ
1102	1102	1	1	2566	3	7	t	f	\N	วันทำการ
1103	1103	1	1	2566	3	7	t	f	\N	วันทำการ
1104	1104	1	1	2566	3	7	t	f	\N	วันทำการ
1105	1105	1	1	2566	3	7	f	f	\N	วันหยุด
1106	1106	1	1	2566	3	7	f	f	\N	วันหยุด
1107	1107	1	1	2566	3	8	f	t	วันเฉลิมฯ พระราชินี	วันหยุดนักขัตฤกษ์
1108	1108	1	1	2566	3	8	t	f	\N	วันทำการ
1109	1109	1	1	2566	3	8	t	f	\N	วันทำการ
1110	1110	1	1	2566	3	8	t	f	\N	วันทำการ
1111	1111	1	1	2566	3	8	t	f	\N	วันทำการ
1112	1112	1	1	2566	3	8	f	f	\N	วันหยุด
3683	764	4	1	2566	1	1	t	f	\N	วันทำการ
3684	765	4	1	2566	1	1	t	f	\N	วันทำการ
3685	766	4	1	2566	1	1	t	f	\N	วันทำการ
3686	767	4	1	2566	1	1	t	f	\N	วันทำการ
3687	768	4	1	2566	1	1	t	f	\N	วันทำการ
3688	769	4	1	2566	1	1	f	f	\N	วันหยุด
3689	770	4	1	2566	1	1	f	f	\N	วันหยุด
3690	771	4	1	2566	1	2	f	t	วันอาสาฬหบูชา	วันหยุดนักขัตฤกษ์
3691	772	4	1	2566	1	2	f	t	วันเข้าพรรษา	วันหยุดนักขัตฤกษ์
3692	773	4	1	2566	1	2	t	f	\N	วันทำการ
3693	774	4	1	2566	1	2	t	f	\N	วันทำการ
3694	775	4	1	2566	1	2	t	f	\N	วันทำการ
3695	776	4	1	2566	1	2	f	f	\N	วันหยุด
3696	777	4	1	2566	1	2	f	f	\N	วันหยุด
3697	778	4	1	2566	1	3	t	f	\N	วันทำการ
3698	779	4	1	2566	1	3	t	f	\N	วันทำการ
3699	780	4	1	2566	1	3	t	f	\N	วันทำการ
3700	781	4	1	2566	1	3	t	f	\N	วันทำการ
3701	782	4	1	2566	1	3	t	f	\N	วันทำการ
3702	783	4	1	2566	1	3	f	f	\N	วันหยุด
3703	784	4	1	2566	1	3	f	f	\N	วันหยุด
3704	785	4	1	2566	1	4	t	f	\N	วันทำการ
3705	786	4	1	2566	1	4	t	f	\N	วันทำการ
3706	787	4	1	2566	1	4	t	f	\N	วันทำการ
3707	788	4	1	2566	1	4	t	f	\N	วันทำการ
3708	789	4	1	2566	1	4	t	f	\N	วันทำการ
3709	790	4	1	2566	1	4	f	f	\N	วันหยุด
3710	791	4	1	2566	1	4	f	f	\N	วันหยุด
3711	792	4	1	2566	1	5	t	f	\N	วันทำการ
3712	793	4	1	2566	1	5	t	f	\N	วันทำการ
3713	794	4	1	2566	1	5	t	f	\N	วันทำการ
3714	795	4	1	2566	1	5	t	f	\N	วันทำการ
3715	796	4	1	2566	1	5	f	t	วันเฉลิมฯ ร.10	วันหยุดนักขัตฤกษ์
3716	797	4	1	2566	1	5	f	f	\N	วันหยุด
3717	798	4	1	2566	1	5	f	f	\N	วันหยุด
3718	799	4	1	2566	1	6	f	t	นักขัตฤกษ์	วันหยุดนักขัตฤกษ์
3719	800	4	1	2566	1	6	f	t	วันอาสาฬหบูชา	วันหยุดนักขัตฤกษ์
3720	801	4	1	2566	1	6	t	f	\N	วันทำการ
3721	802	4	1	2566	1	6	t	f	\N	วันทำการ
3722	803	4	1	2566	1	6	t	f	\N	วันทำการ
3723	804	4	1	2566	1	6	f	f	\N	วันหยุด
3724	805	4	1	2566	1	6	f	f	\N	วันหยุด
3725	806	4	1	2566	1	7	t	f	\N	วันทำการ
3726	807	4	1	2566	1	7	t	f	\N	วันทำการ
3727	808	4	1	2566	1	7	t	f	\N	วันทำการ
3728	809	4	1	2566	1	7	t	f	\N	วันทำการ
3729	810	4	1	2566	1	7	t	f	\N	วันทำการ
3730	811	4	1	2566	1	7	f	t	วันแม่แห่งชาติ	วันหยุดนักขัตฤกษ์
3731	812	4	1	2566	1	7	f	f	\N	วันหยุด
3732	813	4	1	2566	1	8	f	t	ชดเชยวันแม่แห่งชาติ	วันหยุดนักขัตฤกษ์
3733	814	4	1	2566	1	8	t	f	\N	วันทำการ
3734	815	4	1	2566	1	8	t	f	\N	วันทำการ
3735	816	4	1	2566	1	8	t	f	\N	วันทำการ
3736	817	4	1	2566	1	8	t	f	\N	วันทำการ
3737	818	4	1	2566	1	8	f	f	\N	วันหยุด
3738	819	4	1	2566	1	8	f	f	\N	วันหยุด
3739	820	4	1	2566	1	9	t	f	\N	วันทำการ
3740	821	4	1	2566	1	9	t	f	\N	วันทำการ
3741	822	4	1	2566	1	9	t	f	\N	วันทำการ
3742	823	4	1	2566	1	9	t	f	\N	วันทำการ
3743	824	4	1	2566	1	9	t	f	\N	วันทำการ
3744	825	4	1	2566	1	9	f	f	\N	วันหยุด
3745	826	4	1	2566	1	9	f	f	\N	วันหยุด
3746	827	4	1	2566	1	10	t	f	\N	วันทำการ
3747	828	4	1	2566	1	10	t	f	\N	วันทำการ
3748	829	4	1	2566	1	10	t	f	\N	วันทำการ
3749	830	4	1	2566	1	10	t	f	\N	วันทำการ
3750	831	4	1	2566	1	10	t	f	\N	วันทำการ
3751	832	4	1	2566	1	10	f	f	\N	วันหยุด
3752	833	4	1	2566	1	10	f	f	\N	วันหยุด
3753	834	4	1	2566	1	11	t	f	\N	วันทำการ
3754	835	4	1	2566	1	11	t	f	\N	วันทำการ
3755	836	4	1	2566	1	11	t	f	\N	วันทำการ
3756	837	4	1	2566	1	11	t	f	\N	วันทำการ
3757	838	4	1	2566	1	11	t	f	\N	วันทำการ
3758	839	4	1	2566	1	11	f	f	\N	วันหยุด
3759	840	4	1	2566	1	11	f	f	\N	วันหยุด
3760	841	4	1	2566	1	12	t	f	\N	วันทำการ
3761	842	4	1	2566	1	12	t	f	\N	วันทำการ
3762	843	4	1	2566	1	12	t	f	\N	วันทำการ
3763	844	4	1	2566	1	12	t	f	\N	วันทำการ
3764	845	4	1	2566	1	12	t	f	\N	วันทำการ
3765	846	4	1	2566	1	12	f	f	\N	วันหยุด
3766	847	4	1	2566	1	12	f	f	\N	วันหยุด
3767	848	4	1	2566	1	13	t	f	\N	วันทำการ
3768	849	4	1	2566	1	13	t	f	\N	วันทำการ
3769	850	4	1	2566	1	13	t	f	\N	วันทำการ
3770	851	4	1	2566	1	13	t	f	\N	วันทำการ
3771	852	4	1	2566	1	13	f	t	วันสงขลานครินทร์	วันหยุดนักขัตฤกษ์
3772	853	4	1	2566	1	13	f	f	\N	วันหยุด
3773	854	4	1	2566	1	13	f	f	\N	วันหยุด
3774	855	4	1	2566	1	14	t	f	\N	วันทำการ
3775	856	4	1	2566	1	14	t	f	\N	วันทำการ
3776	857	4	1	2566	1	14	t	f	\N	วันทำการ
3777	858	4	1	2566	1	14	t	f	\N	วันทำการ
3778	859	4	1	2566	1	14	t	f	\N	วันทำการ
3779	860	4	1	2566	1	14	f	f	\N	วันหยุด
3780	861	4	1	2566	1	14	f	f	\N	วันหยุด
3781	862	4	1	2566	1	15	t	f	\N	วันทำการ
3782	863	4	1	2566	1	15	t	f	\N	วันทำการ
3783	864	4	1	2566	1	15	t	f	\N	วันทำการ
3784	865	4	1	2566	1	15	t	f	\N	วันทำการ
3785	866	4	1	2566	1	15	t	f	\N	วันทำการ
3786	867	4	1	2566	1	15	f	f	\N	วันหยุด
3787	868	4	1	2566	1	15	f	f	\N	วันหยุด
3788	869	4	1	2566	1	16	t	f	\N	วันทำการ
3789	870	4	1	2566	1	16	t	f	\N	วันทำการ
3790	871	4	1	2566	1	16	t	f	\N	วันทำการ
3791	872	4	1	2566	1	16	t	f	\N	วันทำการ
3792	873	4	1	2566	1	16	f	t	วันนวมินทรมหาราช	วันหยุดนักขัตฤกษ์
3793	874	4	1	2566	1	16	f	f	\N	วันหยุด
3794	875	4	1	2566	1	16	f	f	\N	วันหยุด
3795	876	4	1	2566	1	17	t	f	\N	วันทำการ
3796	877	4	1	2566	1	17	t	f	\N	วันทำการ
3797	878	4	1	2566	1	17	t	f	\N	วันทำการ
3798	879	4	1	2566	1	17	t	f	\N	วันทำการ
3799	880	4	1	2566	1	17	t	f	\N	วันทำการ
3800	881	4	1	2566	1	17	f	f	\N	วันหยุด
3801	882	4	1	2566	1	17	f	f	\N	วันหยุด
3802	883	4	1	2566	1	18	f	t	วันปิยมหาราช	วันหยุดนักขัตฤกษ์
3803	884	4	1	2566	1	18	t	f	\N	วันทำการ
3804	885	4	1	2566	1	18	t	f	\N	วันทำการ
3805	886	4	1	2566	1	18	t	f	\N	วันทำการ
3806	887	4	1	2566	1	18	t	f	\N	วันทำการ
3807	888	4	1	2566	1	18	f	f	\N	วันหยุด
3808	889	4	1	2566	\N	\N	f	f	\N	วันหยุด
3809	890	4	1	2566	\N	\N	f	f	\N	ปิดภาค
3810	891	4	1	2566	\N	\N	f	f	\N	ปิดภาค
3811	892	4	1	2566	\N	\N	f	f	\N	ปิดภาค
3812	893	4	1	2566	\N	\N	f	f	\N	ปิดภาค
3813	894	4	1	2566	\N	\N	f	f	\N	ปิดภาค
3814	895	4	1	2566	\N	\N	f	f	\N	วันหยุด
3815	896	4	1	2566	\N	\N	f	f	\N	วันหยุด
3816	897	4	1	2566	\N	\N	f	f	\N	ปิดภาค
3817	898	4	1	2566	\N	\N	f	f	\N	ปิดภาค
3818	899	4	1	2566	\N	\N	f	f	\N	ปิดภาค
3819	900	4	1	2566	\N	\N	f	f	\N	ปิดภาค
3820	901	4	1	2566	\N	\N	f	f	\N	ปิดภาค
3821	902	4	1	2566	\N	\N	f	f	\N	วันหยุด
3822	903	4	1	2566	\N	\N	f	f	\N	วันหยุด
3823	904	4	1	2566	\N	\N	f	f	\N	ปิดภาค
3824	905	4	1	2566	\N	\N	f	f	\N	ปิดภาค
3825	906	4	1	2566	\N	\N	f	f	\N	ปิดภาค
3826	907	4	1	2566	\N	\N	f	f	\N	ปิดภาค
3827	908	4	1	2566	\N	\N	f	f	\N	ปิดภาค
3828	909	4	1	2566	\N	\N	f	f	\N	วันหยุด
3829	910	4	1	2566	\N	\N	f	f	\N	วันหยุด
3830	911	4	1	2566	2	1	t	f	\N	วันทำการ
3831	912	4	1	2566	2	1	t	f	\N	วันทำการ
3832	913	4	1	2566	2	1	t	f	\N	วันทำการ
3833	914	4	1	2566	2	1	t	f	\N	วันทำการ
3834	915	4	1	2566	2	1	t	f	\N	วันทำการ
3835	916	4	1	2566	2	1	f	f	\N	วันหยุด
3836	917	4	1	2566	2	1	f	f	\N	วันหยุด
3837	918	4	1	2566	2	2	t	f	\N	วันทำการ
3838	919	4	1	2566	2	2	t	f	\N	วันทำการ
3839	920	4	1	2566	2	2	t	f	\N	วันทำการ
3840	921	4	1	2566	2	2	t	f	\N	วันทำการ
3841	922	4	1	2566	2	2	t	f	\N	วันทำการ
3842	923	4	1	2566	2	2	f	f	\N	วันหยุด
3843	924	4	1	2566	2	2	f	f	\N	วันหยุด
3844	925	4	1	2566	2	3	t	f	\N	วันทำการ
3845	926	4	1	2566	2	3	f	t	วันพ่อแห่งชาติ	วันหยุดนักขัตฤกษ์
3846	927	4	1	2566	2	3	t	f	\N	วันทำการ
3847	928	4	1	2566	2	3	t	f	\N	วันทำการ
3848	929	4	1	2566	2	3	t	f	\N	วันทำการ
3849	930	4	1	2566	2	3	f	f	\N	วันหยุด
3850	931	4	1	2566	2	3	f	t	วันรัฐธรรมนูญ	วันหยุดนักขัตฤกษ์
3851	932	4	1	2566	2	4	f	t	ชดเชยวันรัฐธรรมนูญ	วันหยุดนักขัตฤกษ์
3852	933	4	1	2566	2	4	t	f	\N	วันทำการ
3853	934	4	1	2566	2	4	t	f	\N	วันทำการ
3854	935	4	1	2566	2	4	t	f	\N	วันทำการ
3855	936	4	1	2566	2	4	t	f	\N	วันทำการ
3856	937	4	1	2566	2	4	f	f	\N	วันหยุด
3857	938	4	1	2566	2	4	f	f	\N	วันหยุด
3858	939	4	1	2566	2	5	t	f	\N	วันทำการ
3859	940	4	1	2566	2	5	t	f	\N	วันทำการ
3860	941	4	1	2566	2	5	t	f	\N	วันทำการ
3861	942	4	1	2566	2	5	t	f	\N	วันทำการ
3862	943	4	1	2566	2	5	t	f	\N	วันทำการ
3863	944	4	1	2566	2	5	f	f	\N	วันหยุด
3864	945	4	1	2566	2	5	f	t	วันคริสต์มาสอีฟ	วันหยุดนักขัตฤกษ์
3865	946	4	1	2566	2	6	f	t	วันคริสต์มาส	วันหยุดนักขัตฤกษ์
3866	947	4	1	2566	2	6	t	f	\N	วันทำการ
3867	948	4	1	2566	2	6	t	f	\N	วันทำการ
3868	949	4	1	2566	2	6	t	f	\N	วันทำการ
3869	950	4	1	2566	2	6	f	t	วันหยุดราชการธันวาคม	วันหยุดนักขัตฤกษ์
3870	951	4	1	2566	2	6	f	f	\N	วันหยุด
3871	952	4	1	2566	2	6	f	t	วันสิ้นปี	วันหยุดนักขัตฤกษ์
3872	953	4	1	2566	2	7	f	t	วันขึ้นปีใหม่	วันหยุดนักขัตฤกษ์
3873	954	4	1	2566	2	7	t	f	\N	วันทำการ
3874	955	4	1	2566	2	7	t	f	\N	วันทำการ
3875	956	4	1	2566	2	7	t	f	\N	วันทำการ
3876	957	4	1	2566	2	7	t	f	\N	วันทำการ
3877	958	4	1	2566	2	7	f	f	\N	วันหยุด
3878	959	4	1	2566	2	7	f	f	\N	วันหยุด
3879	960	4	1	2566	2	8	t	f	\N	วันทำการ
3880	961	4	1	2566	2	8	t	f	\N	วันทำการ
3881	962	4	1	2566	2	8	t	f	\N	วันทำการ
3882	963	4	1	2566	2	8	t	f	\N	วันทำการ
3883	964	4	1	2566	2	8	t	f	\N	วันทำการ
3884	965	4	1	2566	2	8	f	f	\N	วันหยุด
3885	966	4	1	2566	2	8	f	f	\N	วันหยุด
3886	967	4	1	2566	2	9	t	f	\N	วันทำการ
3887	968	4	1	2566	2	9	t	f	\N	วันทำการ
3888	969	4	1	2566	2	9	t	f	\N	วันทำการ
3889	970	4	1	2566	2	9	t	f	\N	วันทำการ
3890	971	4	1	2566	2	9	t	f	\N	วันทำการ
3891	972	4	1	2566	2	9	f	f	\N	วันหยุด
3892	973	4	1	2566	2	9	f	f	\N	วันหยุด
3893	974	4	1	2566	2	10	t	f	\N	วันทำการ
3894	975	4	1	2566	2	10	t	f	\N	วันทำการ
3895	976	4	1	2566	2	10	t	f	\N	วันทำการ
3896	977	4	1	2566	2	10	f	t	วันมาฆบูชา	วันหยุดนักขัตฤกษ์
3897	978	4	1	2566	2	10	t	f	\N	วันทำการ
3898	979	4	1	2566	2	10	f	f	\N	วันหยุด
3899	980	4	1	2566	2	10	f	f	\N	วันหยุด
3900	981	4	1	2566	2	11	t	f	\N	วันทำการ
3901	982	4	1	2566	2	11	t	f	\N	วันทำการ
3902	983	4	1	2566	2	11	t	f	\N	วันทำการ
3903	984	4	1	2566	2	11	t	f	\N	วันทำการ
3904	985	4	1	2566	2	11	t	f	\N	วันทำการ
3905	986	4	1	2566	2	11	f	f	\N	วันหยุด
3906	987	4	1	2566	2	11	f	f	\N	วันหยุด
3907	988	4	1	2566	2	12	t	f	\N	วันทำการ
3908	989	4	1	2566	2	12	t	f	\N	วันทำการ
3909	990	4	1	2566	2	12	t	f	\N	วันทำการ
3910	991	4	1	2566	2	12	t	f	\N	วันทำการ
3911	992	4	1	2566	2	12	t	f	\N	วันทำการ
3912	993	4	1	2566	2	12	f	t	วันตรุษจีน	วันหยุดนักขัตฤกษ์
3913	994	4	1	2566	2	12	f	t	วันตรุษจีน (วันที่ 2)	วันหยุดนักขัตฤกษ์
3914	995	4	1	2566	2	13	f	t	วันตรุษจีน (วันที่ 3)	วันหยุดนักขัตฤกษ์
3915	996	4	1	2566	2	13	t	f	\N	วันทำการ
3916	997	4	1	2566	2	13	f	t	วันวาเลนไทน์	วันหยุดนักขัตฤกษ์
3917	998	4	1	2566	2	13	t	f	\N	วันทำการ
3918	999	4	1	2566	2	13	t	f	\N	วันทำการ
3919	1000	4	1	2566	2	13	f	f	\N	วันหยุด
3920	1001	4	1	2566	2	13	f	f	\N	วันหยุด
3921	1002	4	1	2566	2	14	t	f	\N	วันทำการ
3922	1003	4	1	2566	2	14	t	f	\N	วันทำการ
3923	1004	4	1	2566	2	14	t	f	\N	วันทำการ
3924	1005	4	1	2566	2	14	t	f	\N	วันทำการ
3925	1006	4	1	2566	2	14	t	f	\N	วันทำการ
3926	1007	4	1	2566	2	14	f	t	วันมาฆบูชา	วันหยุดนักขัตฤกษ์
3927	1008	4	1	2566	2	14	f	f	\N	วันหยุด
3928	1009	4	1	2566	2	15	f	t	วันหยุดชดเชยวันมาฆบูชา	วันหยุดนักขัตฤกษ์
3929	1010	4	1	2566	2	15	t	f	\N	วันทำการ
3930	1011	4	1	2566	2	15	t	f	\N	วันทำการ
3931	1012	4	1	2566	2	15	t	f	\N	วันทำการ
3932	1013	4	1	2566	2	15	t	f	\N	วันทำการ
3933	1014	4	1	2566	2	15	f	f	\N	วันหยุด
3934	1015	4	1	2566	2	15	f	f	\N	วันหยุด
3935	1016	4	1	2566	2	16	t	f	\N	วันทำการ
3936	1017	4	1	2566	2	16	t	f	\N	วันทำการ
3937	1018	4	1	2566	2	16	t	f	\N	วันทำการ
3938	1019	4	1	2566	2	16	t	f	\N	วันทำการ
3939	1020	4	1	2566	2	16	t	f	\N	วันทำการ
3940	1021	4	1	2566	2	16	f	f	\N	วันหยุด
3941	1022	4	1	2566	2	16	f	f	\N	วันหยุด
3942	1023	4	1	2566	2	17	t	f	\N	วันทำการ
3943	1024	4	1	2566	2	17	t	f	\N	วันทำการ
3944	1025	4	1	2566	2	17	t	f	\N	วันทำการ
3945	1026	4	1	2566	2	17	t	f	\N	วันทำการ
3946	1027	4	1	2566	2	17	t	f	\N	วันทำการ
3947	1028	4	1	2566	2	17	f	f	\N	วันหยุด
3948	1029	4	1	2566	2	17	f	f	\N	วันหยุด
3949	1030	4	1	2566	2	18	t	f	\N	วันทำการ
3950	1031	4	1	2566	2	18	t	f	\N	วันทำการ
3951	1032	4	1	2566	2	18	t	f	\N	วันทำการ
3952	1033	4	1	2566	2	18	t	f	\N	วันทำการ
3953	1034	4	1	2566	2	18	t	f	\N	วันทำการ
3954	1035	4	1	2566	2	18	f	f	\N	วันหยุด
3955	1036	4	1	2566	\N	\N	f	f	\N	วันหยุด
3956	1037	4	1	2566	\N	\N	f	f	\N	ปิดภาค
3957	1038	4	1	2566	\N	\N	f	f	\N	ปิดภาค
3958	1039	4	1	2566	\N	\N	f	f	\N	ปิดภาค
3959	1040	4	1	2566	\N	\N	f	f	\N	ปิดภาค
3960	1041	4	1	2566	\N	\N	f	f	\N	ปิดภาค
3961	1042	4	1	2566	\N	\N	f	f	\N	วันหยุด
3962	1043	4	1	2566	\N	\N	f	f	\N	วันหยุด
3963	1044	4	1	2566	\N	\N	f	f	\N	ปิดภาค
3964	1045	4	1	2566	\N	\N	f	f	\N	ปิดภาค
3965	1046	4	1	2566	\N	\N	f	f	\N	ปิดภาค
3966	1047	4	1	2566	\N	\N	f	f	\N	ปิดภาค
3967	1048	4	1	2566	\N	\N	f	f	\N	ปิดภาค
3968	1049	4	1	2566	\N	\N	f	t	วันจักรี	วันหยุดนักขัตฤกษ์
3969	1050	4	1	2566	\N	\N	f	f	\N	วันหยุด
3970	1051	4	1	2566	\N	\N	f	t	ชดเชยวันจักรี	วันหยุดนักขัตฤกษ์
3971	1052	4	1	2566	\N	\N	f	f	\N	ปิดภาค
3972	1053	4	1	2566	\N	\N	f	f	\N	ปิดภาค
3973	1054	4	1	2566	\N	\N	f	f	\N	ปิดภาค
3974	1055	4	1	2566	\N	\N	f	t	วันสงกรานต์	วันหยุดนักขัตฤกษ์
3975	1056	4	1	2566	\N	\N	f	t	วันสงกรานต์	วันหยุดนักขัตฤกษ์
3976	1057	4	1	2566	\N	\N	f	t	วันสงกรานต์	วันหยุดนักขัตฤกษ์
3977	1058	4	1	2566	\N	\N	f	t	วันสงกรานต์	วันหยุดนักขัตฤกษ์
3978	1059	4	1	2566	\N	\N	f	t	ชดเชยวันสงกรานต์	วันหยุดนักขัตฤกษ์
3979	1060	4	1	2566	3	1	t	f	\N	วันทำการ
3980	1061	4	1	2566	3	1	t	f	\N	วันทำการ
3981	1062	4	1	2566	3	1	t	f	\N	วันทำการ
3982	1063	4	1	2566	3	1	f	f	\N	วันหยุด
3983	1064	4	1	2566	3	1	f	f	\N	วันหยุด
3984	1065	4	1	2566	3	2	t	f	\N	วันทำการ
3985	1066	4	1	2566	3	2	f	t	วันวิสาขบูชา	วันหยุดนักขัตฤกษ์
3986	1067	4	1	2566	3	2	t	f	\N	วันทำการ
3987	1068	4	1	2566	3	2	t	f	\N	วันทำการ
3988	1069	4	1	2566	3	2	t	f	\N	วันทำการ
3989	1070	4	1	2566	3	2	f	f	\N	วันหยุด
3990	1071	4	1	2566	3	2	f	f	\N	วันหยุด
3991	1072	4	1	2566	3	3	t	f	\N	วันทำการ
3992	1073	4	1	2566	3	3	t	f	\N	วันทำการ
3993	1074	4	1	2566	3	3	f	t	วันแรงงานแห่งชาติ	วันหยุดนักขัตฤกษ์
3994	1075	4	1	2566	3	3	t	f	\N	วันทำการ
3995	1076	4	1	2566	3	3	t	f	\N	วันทำการ
3996	1077	4	1	2566	3	3	f	t	วันฉัตรมงคล	วันหยุดนักขัตฤกษ์
3997	1078	4	1	2566	3	3	f	f	\N	วันหยุด
3998	1079	4	1	2566	3	4	f	t	วันหยุดชดเชยวันฉัตรมงคล	วันหยุดนักขัตฤกษ์
3999	1080	4	1	2566	3	4	t	f	\N	วันทำการ
4000	1081	4	1	2566	3	4	t	f	\N	วันทำการ
4001	1082	4	1	2566	3	4	t	f	\N	วันทำการ
4002	1083	4	1	2566	3	4	f	t	วันพืชมงคล	วันหยุดนักขัตฤกษ์
4003	1084	4	1	2566	3	4	f	f	\N	วันหยุด
4004	1085	4	1	2566	3	4	f	f	\N	วันหยุด
4005	1086	4	1	2566	3	5	t	f	\N	วันทำการ
4006	1087	4	1	2566	3	5	t	f	\N	วันทำการ
4007	1088	4	1	2566	3	5	t	f	\N	วันทำการ
4008	1089	4	1	2566	3	5	t	f	\N	วันทำการ
4009	1090	4	1	2566	3	5	t	f	\N	วันทำการ
4010	1091	4	1	2566	3	5	f	f	\N	วันหยุด
4011	1092	4	1	2566	3	5	f	f	\N	วันหยุด
4012	1093	4	1	2566	3	6	t	f	\N	วันทำการ
4013	1094	4	1	2566	3	6	t	f	\N	วันทำการ
4014	1095	4	1	2566	3	6	f	t	วันวิสาขบูชา	วันหยุดนักขัตฤกษ์
4015	1096	4	1	2566	3	6	t	f	\N	วันทำการ
4016	1097	4	1	2566	3	6	t	f	\N	วันทำการ
4017	1098	4	1	2566	3	6	f	f	\N	วันหยุด
4018	1099	4	1	2566	3	6	f	f	\N	วันหยุด
4019	1100	4	1	2566	3	7	t	f	\N	วันทำการ
4020	1101	4	1	2566	3	7	t	f	\N	วันทำการ
4021	1102	4	1	2566	3	7	t	f	\N	วันทำการ
4022	1103	4	1	2566	3	7	t	f	\N	วันทำการ
4023	1104	4	1	2566	3	7	t	f	\N	วันทำการ
4024	1105	4	1	2566	3	7	f	f	\N	วันหยุด
4025	1106	4	1	2566	3	7	f	f	\N	วันหยุด
4026	1107	4	1	2566	3	8	f	t	วันเฉลิมฯ พระราชินี	วันหยุดนักขัตฤกษ์
4027	1108	4	1	2566	3	8	t	f	\N	วันทำการ
4028	1109	4	1	2566	3	8	t	f	\N	วันทำการ
4029	1110	4	1	2566	3	8	t	f	\N	วันทำการ
4030	1111	4	1	2566	3	8	t	f	\N	วันทำการ
4031	1112	4	1	2566	3	8	f	f	\N	วันหยุด
4032	764	5	1	2566	1	1	t	f	\N	วันทำการ
4033	765	5	1	2566	1	1	t	f	\N	วันทำการ
4034	766	5	1	2566	1	1	t	f	\N	วันทำการ
4035	767	5	1	2566	1	1	t	f	\N	วันทำการ
4036	768	5	1	2566	1	1	t	f	\N	วันทำการ
4037	769	5	1	2566	1	1	f	f	\N	วันหยุด
4038	770	5	1	2566	1	1	f	f	\N	วันหยุด
4039	771	5	1	2566	1	2	f	t	วันอาสาฬหบูชา	วันหยุดนักขัตฤกษ์
4040	772	5	1	2566	1	2	f	t	วันเข้าพรรษา	วันหยุดนักขัตฤกษ์
4041	773	5	1	2566	1	2	t	f	\N	วันทำการ
4042	774	5	1	2566	1	2	t	f	\N	วันทำการ
4043	775	5	1	2566	1	2	t	f	\N	วันทำการ
4044	776	5	1	2566	1	2	f	f	\N	วันหยุด
4045	777	5	1	2566	1	2	f	f	\N	วันหยุด
4046	778	5	1	2566	1	3	t	f	\N	วันทำการ
4047	779	5	1	2566	1	3	t	f	\N	วันทำการ
4048	780	5	1	2566	1	3	t	f	\N	วันทำการ
4049	781	5	1	2566	1	3	t	f	\N	วันทำการ
4050	782	5	1	2566	1	3	t	f	\N	วันทำการ
4051	783	5	1	2566	1	3	f	f	\N	วันหยุด
4052	784	5	1	2566	1	3	f	f	\N	วันหยุด
4053	785	5	1	2566	1	4	t	f	\N	วันทำการ
4054	786	5	1	2566	1	4	t	f	\N	วันทำการ
4055	787	5	1	2566	1	4	t	f	\N	วันทำการ
4056	788	5	1	2566	1	4	t	f	\N	วันทำการ
4057	789	5	1	2566	1	4	t	f	\N	วันทำการ
4058	790	5	1	2566	1	4	f	f	\N	วันหยุด
4059	791	5	1	2566	1	4	f	f	\N	วันหยุด
4060	792	5	1	2566	1	5	t	f	\N	วันทำการ
4061	793	5	1	2566	1	5	t	f	\N	วันทำการ
4062	794	5	1	2566	1	5	t	f	\N	วันทำการ
4063	795	5	1	2566	1	5	t	f	\N	วันทำการ
4064	796	5	1	2566	1	5	f	t	วันเฉลิมฯ ร.10	วันหยุดนักขัตฤกษ์
4065	797	5	1	2566	1	5	f	f	\N	วันหยุด
4066	798	5	1	2566	1	5	f	f	\N	วันหยุด
4067	799	5	1	2566	1	6	f	t	นักขัตฤกษ์	วันหยุดนักขัตฤกษ์
4068	800	5	1	2566	1	6	f	t	วันอาสาฬหบูชา	วันหยุดนักขัตฤกษ์
4069	801	5	1	2566	1	6	t	f	\N	วันทำการ
4070	802	5	1	2566	1	6	t	f	\N	วันทำการ
4071	803	5	1	2566	1	6	t	f	\N	วันทำการ
4072	804	5	1	2566	1	6	f	f	\N	วันหยุด
4073	805	5	1	2566	1	6	f	f	\N	วันหยุด
4074	806	5	1	2566	1	7	t	f	\N	วันทำการ
4075	807	5	1	2566	1	7	t	f	\N	วันทำการ
4076	808	5	1	2566	1	7	t	f	\N	วันทำการ
4077	809	5	1	2566	1	7	t	f	\N	วันทำการ
4078	810	5	1	2566	1	7	t	f	\N	วันทำการ
4079	811	5	1	2566	1	7	f	t	วันแม่แห่งชาติ	วันหยุดนักขัตฤกษ์
4080	812	5	1	2566	1	7	f	f	\N	วันหยุด
4081	813	5	1	2566	1	8	f	t	ชดเชยวันแม่แห่งชาติ	วันหยุดนักขัตฤกษ์
4082	814	5	1	2566	1	8	t	f	\N	วันทำการ
4083	815	5	1	2566	1	8	t	f	\N	วันทำการ
4084	816	5	1	2566	1	8	t	f	\N	วันทำการ
4085	817	5	1	2566	1	8	t	f	\N	วันทำการ
4086	818	5	1	2566	1	8	f	f	\N	วันหยุด
4087	819	5	1	2566	1	8	f	f	\N	วันหยุด
4088	820	5	1	2566	1	9	t	f	\N	วันทำการ
4089	821	5	1	2566	1	9	t	f	\N	วันทำการ
4090	822	5	1	2566	1	9	t	f	\N	วันทำการ
4091	823	5	1	2566	1	9	t	f	\N	วันทำการ
4092	824	5	1	2566	1	9	t	f	\N	วันทำการ
4093	825	5	1	2566	1	9	f	f	\N	วันหยุด
4094	826	5	1	2566	1	9	f	f	\N	วันหยุด
4095	827	5	1	2566	1	10	t	f	\N	วันทำการ
4096	828	5	1	2566	1	10	t	f	\N	วันทำการ
4097	829	5	1	2566	1	10	t	f	\N	วันทำการ
4098	830	5	1	2566	1	10	t	f	\N	วันทำการ
4099	831	5	1	2566	1	10	t	f	\N	วันทำการ
4100	832	5	1	2566	1	10	f	f	\N	วันหยุด
4101	833	5	1	2566	1	10	f	f	\N	วันหยุด
4102	834	5	1	2566	1	11	t	f	\N	วันทำการ
4103	835	5	1	2566	1	11	t	f	\N	วันทำการ
4104	836	5	1	2566	1	11	t	f	\N	วันทำการ
4105	837	5	1	2566	1	11	t	f	\N	วันทำการ
4106	838	5	1	2566	1	11	t	f	\N	วันทำการ
4107	839	5	1	2566	1	11	f	f	\N	วันหยุด
4108	840	5	1	2566	1	11	f	f	\N	วันหยุด
4109	841	5	1	2566	1	12	t	f	\N	วันทำการ
4110	842	5	1	2566	1	12	t	f	\N	วันทำการ
4111	843	5	1	2566	1	12	t	f	\N	วันทำการ
4112	844	5	1	2566	1	12	t	f	\N	วันทำการ
4113	845	5	1	2566	1	12	t	f	\N	วันทำการ
4114	846	5	1	2566	1	12	f	f	\N	วันหยุด
4115	847	5	1	2566	1	12	f	f	\N	วันหยุด
4116	848	5	1	2566	1	13	t	f	\N	วันทำการ
4117	849	5	1	2566	1	13	t	f	\N	วันทำการ
4118	850	5	1	2566	1	13	t	f	\N	วันทำการ
4119	851	5	1	2566	1	13	t	f	\N	วันทำการ
4120	852	5	1	2566	1	13	f	t	วันสงขลานครินทร์	วันหยุดนักขัตฤกษ์
4121	853	5	1	2566	1	13	f	f	\N	วันหยุด
4122	854	5	1	2566	1	13	f	f	\N	วันหยุด
4123	855	5	1	2566	1	14	t	f	\N	วันทำการ
4124	856	5	1	2566	1	14	t	f	\N	วันทำการ
4125	857	5	1	2566	1	14	t	f	\N	วันทำการ
4126	858	5	1	2566	1	14	t	f	\N	วันทำการ
4127	859	5	1	2566	1	14	t	f	\N	วันทำการ
4128	860	5	1	2566	1	14	f	f	\N	วันหยุด
4129	861	5	1	2566	1	14	f	f	\N	วันหยุด
4130	862	5	1	2566	1	15	t	f	\N	วันทำการ
4131	863	5	1	2566	1	15	t	f	\N	วันทำการ
4132	864	5	1	2566	1	15	t	f	\N	วันทำการ
4133	865	5	1	2566	1	15	t	f	\N	วันทำการ
4134	866	5	1	2566	1	15	t	f	\N	วันทำการ
4135	867	5	1	2566	1	15	f	f	\N	วันหยุด
4136	868	5	1	2566	1	15	f	f	\N	วันหยุด
4137	869	5	1	2566	1	16	t	f	\N	วันทำการ
4138	870	5	1	2566	1	16	t	f	\N	วันทำการ
4139	871	5	1	2566	1	16	t	f	\N	วันทำการ
4140	872	5	1	2566	1	16	t	f	\N	วันทำการ
4141	873	5	1	2566	1	16	f	t	วันนวมินทรมหาราช	วันหยุดนักขัตฤกษ์
4142	874	5	1	2566	1	16	f	f	\N	วันหยุด
4143	875	5	1	2566	1	16	f	f	\N	วันหยุด
4144	876	5	1	2566	1	17	t	f	\N	วันทำการ
4145	877	5	1	2566	1	17	t	f	\N	วันทำการ
4146	878	5	1	2566	1	17	t	f	\N	วันทำการ
4147	879	5	1	2566	1	17	t	f	\N	วันทำการ
4148	880	5	1	2566	1	17	t	f	\N	วันทำการ
4149	881	5	1	2566	1	17	f	f	\N	วันหยุด
4150	882	5	1	2566	1	17	f	f	\N	วันหยุด
4151	883	5	1	2566	1	18	f	t	วันปิยมหาราช	วันหยุดนักขัตฤกษ์
4152	884	5	1	2566	1	18	t	f	\N	วันทำการ
4153	885	5	1	2566	1	18	t	f	\N	วันทำการ
4154	886	5	1	2566	1	18	t	f	\N	วันทำการ
4155	887	5	1	2566	1	18	t	f	\N	วันทำการ
4156	888	5	1	2566	1	18	f	f	\N	วันหยุด
4157	889	5	1	2566	\N	\N	f	f	\N	วันหยุด
4158	890	5	1	2566	\N	\N	f	f	\N	ปิดภาค
4159	891	5	1	2566	\N	\N	f	f	\N	ปิดภาค
4160	892	5	1	2566	\N	\N	f	f	\N	ปิดภาค
4161	893	5	1	2566	\N	\N	f	f	\N	ปิดภาค
4162	894	5	1	2566	\N	\N	f	f	\N	ปิดภาค
4163	895	5	1	2566	\N	\N	f	f	\N	วันหยุด
4164	896	5	1	2566	\N	\N	f	f	\N	วันหยุด
4165	897	5	1	2566	\N	\N	f	f	\N	ปิดภาค
4166	898	5	1	2566	\N	\N	f	f	\N	ปิดภาค
4167	899	5	1	2566	\N	\N	f	f	\N	ปิดภาค
4168	900	5	1	2566	\N	\N	f	f	\N	ปิดภาค
4169	901	5	1	2566	\N	\N	f	f	\N	ปิดภาค
4170	902	5	1	2566	\N	\N	f	f	\N	วันหยุด
4171	903	5	1	2566	\N	\N	f	f	\N	วันหยุด
4172	904	5	1	2566	\N	\N	f	f	\N	ปิดภาค
4173	905	5	1	2566	\N	\N	f	f	\N	ปิดภาค
4174	906	5	1	2566	\N	\N	f	f	\N	ปิดภาค
4175	907	5	1	2566	\N	\N	f	f	\N	ปิดภาค
4176	908	5	1	2566	\N	\N	f	f	\N	ปิดภาค
4177	909	5	1	2566	\N	\N	f	f	\N	วันหยุด
4178	910	5	1	2566	\N	\N	f	f	\N	วันหยุด
4179	911	5	1	2566	2	1	t	f	\N	วันทำการ
4180	912	5	1	2566	2	1	t	f	\N	วันทำการ
4181	913	5	1	2566	2	1	t	f	\N	วันทำการ
4182	914	5	1	2566	2	1	t	f	\N	วันทำการ
4183	915	5	1	2566	2	1	t	f	\N	วันทำการ
4184	916	5	1	2566	2	1	f	f	\N	วันหยุด
4185	917	5	1	2566	2	1	f	f	\N	วันหยุด
4186	918	5	1	2566	2	2	t	f	\N	วันทำการ
4187	919	5	1	2566	2	2	t	f	\N	วันทำการ
4188	920	5	1	2566	2	2	t	f	\N	วันทำการ
4189	921	5	1	2566	2	2	t	f	\N	วันทำการ
4190	922	5	1	2566	2	2	t	f	\N	วันทำการ
4191	923	5	1	2566	2	2	f	f	\N	วันหยุด
4192	924	5	1	2566	2	2	f	f	\N	วันหยุด
4193	925	5	1	2566	2	3	t	f	\N	วันทำการ
4194	926	5	1	2566	2	3	f	t	วันพ่อแห่งชาติ	วันหยุดนักขัตฤกษ์
4195	927	5	1	2566	2	3	t	f	\N	วันทำการ
4196	928	5	1	2566	2	3	t	f	\N	วันทำการ
4197	929	5	1	2566	2	3	t	f	\N	วันทำการ
4198	930	5	1	2566	2	3	f	f	\N	วันหยุด
4199	931	5	1	2566	2	3	f	t	วันรัฐธรรมนูญ	วันหยุดนักขัตฤกษ์
4200	932	5	1	2566	2	4	f	t	ชดเชยวันรัฐธรรมนูญ	วันหยุดนักขัตฤกษ์
4201	933	5	1	2566	2	4	t	f	\N	วันทำการ
4202	934	5	1	2566	2	4	t	f	\N	วันทำการ
4203	935	5	1	2566	2	4	t	f	\N	วันทำการ
4204	936	5	1	2566	2	4	t	f	\N	วันทำการ
4205	937	5	1	2566	2	4	f	f	\N	วันหยุด
4206	938	5	1	2566	2	4	f	f	\N	วันหยุด
4207	939	5	1	2566	2	5	t	f	\N	วันทำการ
4208	940	5	1	2566	2	5	t	f	\N	วันทำการ
4209	941	5	1	2566	2	5	t	f	\N	วันทำการ
4210	942	5	1	2566	2	5	t	f	\N	วันทำการ
4211	943	5	1	2566	2	5	t	f	\N	วันทำการ
4212	944	5	1	2566	2	5	f	f	\N	วันหยุด
4213	945	5	1	2566	2	5	f	t	วันคริสต์มาสอีฟ	วันหยุดนักขัตฤกษ์
4214	946	5	1	2566	2	6	f	t	วันคริสต์มาส	วันหยุดนักขัตฤกษ์
4215	947	5	1	2566	2	6	t	f	\N	วันทำการ
4216	948	5	1	2566	2	6	t	f	\N	วันทำการ
4217	949	5	1	2566	2	6	t	f	\N	วันทำการ
4218	950	5	1	2566	2	6	f	t	วันหยุดราชการธันวาคม	วันหยุดนักขัตฤกษ์
4219	951	5	1	2566	2	6	f	f	\N	วันหยุด
4220	952	5	1	2566	2	6	f	t	วันสิ้นปี	วันหยุดนักขัตฤกษ์
4221	953	5	1	2566	2	7	f	t	วันขึ้นปีใหม่	วันหยุดนักขัตฤกษ์
4222	954	5	1	2566	2	7	t	f	\N	วันทำการ
4223	955	5	1	2566	2	7	t	f	\N	วันทำการ
4224	956	5	1	2566	2	7	t	f	\N	วันทำการ
4225	957	5	1	2566	2	7	t	f	\N	วันทำการ
4226	958	5	1	2566	2	7	f	f	\N	วันหยุด
4227	959	5	1	2566	2	7	f	f	\N	วันหยุด
4228	960	5	1	2566	2	8	t	f	\N	วันทำการ
4229	961	5	1	2566	2	8	t	f	\N	วันทำการ
4230	962	5	1	2566	2	8	t	f	\N	วันทำการ
4231	963	5	1	2566	2	8	t	f	\N	วันทำการ
4232	964	5	1	2566	2	8	t	f	\N	วันทำการ
4233	965	5	1	2566	2	8	f	f	\N	วันหยุด
4234	966	5	1	2566	2	8	f	f	\N	วันหยุด
4235	967	5	1	2566	2	9	t	f	\N	วันทำการ
4236	968	5	1	2566	2	9	t	f	\N	วันทำการ
4237	969	5	1	2566	2	9	t	f	\N	วันทำการ
4238	970	5	1	2566	2	9	t	f	\N	วันทำการ
4239	971	5	1	2566	2	9	t	f	\N	วันทำการ
4240	972	5	1	2566	2	9	f	f	\N	วันหยุด
4241	973	5	1	2566	2	9	f	f	\N	วันหยุด
4242	974	5	1	2566	2	10	t	f	\N	วันทำการ
4243	975	5	1	2566	2	10	t	f	\N	วันทำการ
4244	976	5	1	2566	2	10	t	f	\N	วันทำการ
4245	977	5	1	2566	2	10	f	t	วันมาฆบูชา	วันหยุดนักขัตฤกษ์
4246	978	5	1	2566	2	10	t	f	\N	วันทำการ
4247	979	5	1	2566	2	10	f	f	\N	วันหยุด
4248	980	5	1	2566	2	10	f	f	\N	วันหยุด
4249	981	5	1	2566	2	11	t	f	\N	วันทำการ
4250	982	5	1	2566	2	11	t	f	\N	วันทำการ
4251	983	5	1	2566	2	11	t	f	\N	วันทำการ
4252	984	5	1	2566	2	11	t	f	\N	วันทำการ
4253	985	5	1	2566	2	11	t	f	\N	วันทำการ
4254	986	5	1	2566	2	11	f	f	\N	วันหยุด
4255	987	5	1	2566	2	11	f	f	\N	วันหยุด
4256	988	5	1	2566	2	12	t	f	\N	วันทำการ
4257	989	5	1	2566	2	12	t	f	\N	วันทำการ
4258	990	5	1	2566	2	12	t	f	\N	วันทำการ
4259	991	5	1	2566	2	12	t	f	\N	วันทำการ
4260	992	5	1	2566	2	12	t	f	\N	วันทำการ
4261	993	5	1	2566	2	12	f	t	วันตรุษจีน	วันหยุดนักขัตฤกษ์
4262	994	5	1	2566	2	12	f	t	วันตรุษจีน (วันที่ 2)	วันหยุดนักขัตฤกษ์
4263	995	5	1	2566	2	13	f	t	วันตรุษจีน (วันที่ 3)	วันหยุดนักขัตฤกษ์
4264	996	5	1	2566	2	13	t	f	\N	วันทำการ
4265	997	5	1	2566	2	13	f	t	วันวาเลนไทน์	วันหยุดนักขัตฤกษ์
4266	998	5	1	2566	2	13	t	f	\N	วันทำการ
4267	999	5	1	2566	2	13	t	f	\N	วันทำการ
4268	1000	5	1	2566	2	13	f	f	\N	วันหยุด
4269	1001	5	1	2566	2	13	f	f	\N	วันหยุด
4270	1002	5	1	2566	2	14	t	f	\N	วันทำการ
4271	1003	5	1	2566	2	14	t	f	\N	วันทำการ
4272	1004	5	1	2566	2	14	t	f	\N	วันทำการ
4273	1005	5	1	2566	2	14	t	f	\N	วันทำการ
4274	1006	5	1	2566	2	14	t	f	\N	วันทำการ
4275	1007	5	1	2566	2	14	f	t	วันมาฆบูชา	วันหยุดนักขัตฤกษ์
4276	1008	5	1	2566	2	14	f	f	\N	วันหยุด
4277	1009	5	1	2566	2	15	f	t	วันหยุดชดเชยวันมาฆบูชา	วันหยุดนักขัตฤกษ์
4278	1010	5	1	2566	2	15	t	f	\N	วันทำการ
4279	1011	5	1	2566	2	15	t	f	\N	วันทำการ
4280	1012	5	1	2566	2	15	t	f	\N	วันทำการ
4281	1013	5	1	2566	2	15	t	f	\N	วันทำการ
4282	1014	5	1	2566	2	15	f	f	\N	วันหยุด
4283	1015	5	1	2566	2	15	f	f	\N	วันหยุด
4284	1016	5	1	2566	2	16	t	f	\N	วันทำการ
4285	1017	5	1	2566	2	16	t	f	\N	วันทำการ
4286	1018	5	1	2566	2	16	t	f	\N	วันทำการ
4287	1019	5	1	2566	2	16	t	f	\N	วันทำการ
4288	1020	5	1	2566	2	16	t	f	\N	วันทำการ
4289	1021	5	1	2566	2	16	f	f	\N	วันหยุด
4290	1022	5	1	2566	2	16	f	f	\N	วันหยุด
4291	1023	5	1	2566	2	17	t	f	\N	วันทำการ
4292	1024	5	1	2566	2	17	t	f	\N	วันทำการ
4293	1025	5	1	2566	2	17	t	f	\N	วันทำการ
4294	1026	5	1	2566	2	17	t	f	\N	วันทำการ
4295	1027	5	1	2566	2	17	t	f	\N	วันทำการ
4296	1028	5	1	2566	2	17	f	f	\N	วันหยุด
4297	1029	5	1	2566	2	17	f	f	\N	วันหยุด
4298	1030	5	1	2566	2	18	t	f	\N	วันทำการ
4299	1031	5	1	2566	2	18	t	f	\N	วันทำการ
4300	1032	5	1	2566	2	18	t	f	\N	วันทำการ
4301	1033	5	1	2566	2	18	t	f	\N	วันทำการ
4302	1034	5	1	2566	2	18	t	f	\N	วันทำการ
4303	1035	5	1	2566	2	18	f	f	\N	วันหยุด
4304	1036	5	1	2566	\N	\N	f	f	\N	วันหยุด
4305	1037	5	1	2566	\N	\N	f	f	\N	ปิดภาค
4306	1038	5	1	2566	\N	\N	f	f	\N	ปิดภาค
4307	1039	5	1	2566	\N	\N	f	f	\N	ปิดภาค
4308	1040	5	1	2566	\N	\N	f	f	\N	ปิดภาค
4309	1041	5	1	2566	\N	\N	f	f	\N	ปิดภาค
4310	1042	5	1	2566	\N	\N	f	f	\N	วันหยุด
4311	1043	5	1	2566	\N	\N	f	f	\N	วันหยุด
4312	1044	5	1	2566	\N	\N	f	f	\N	ปิดภาค
4313	1045	5	1	2566	\N	\N	f	f	\N	ปิดภาค
4314	1046	5	1	2566	\N	\N	f	f	\N	ปิดภาค
4315	1047	5	1	2566	\N	\N	f	f	\N	ปิดภาค
4316	1048	5	1	2566	\N	\N	f	f	\N	ปิดภาค
4317	1049	5	1	2566	\N	\N	f	t	วันจักรี	วันหยุดนักขัตฤกษ์
4318	1050	5	1	2566	\N	\N	f	f	\N	วันหยุด
4319	1051	5	1	2566	\N	\N	f	t	ชดเชยวันจักรี	วันหยุดนักขัตฤกษ์
4320	1052	5	1	2566	\N	\N	f	f	\N	ปิดภาค
4321	1053	5	1	2566	\N	\N	f	f	\N	ปิดภาค
4322	1054	5	1	2566	\N	\N	f	f	\N	ปิดภาค
4323	1055	5	1	2566	\N	\N	f	t	วันสงกรานต์	วันหยุดนักขัตฤกษ์
4324	1056	5	1	2566	\N	\N	f	t	วันสงกรานต์	วันหยุดนักขัตฤกษ์
4325	1057	5	1	2566	\N	\N	f	t	วันสงกรานต์	วันหยุดนักขัตฤกษ์
4326	1058	5	1	2566	\N	\N	f	t	วันสงกรานต์	วันหยุดนักขัตฤกษ์
4327	1059	5	1	2566	\N	\N	f	t	ชดเชยวันสงกรานต์	วันหยุดนักขัตฤกษ์
4328	1060	5	1	2566	3	1	t	f	\N	วันทำการ
4329	1061	5	1	2566	3	1	t	f	\N	วันทำการ
4330	1062	5	1	2566	3	1	t	f	\N	วันทำการ
4331	1063	5	1	2566	3	1	f	f	\N	วันหยุด
4332	1064	5	1	2566	3	1	f	f	\N	วันหยุด
4333	1065	5	1	2566	3	2	t	f	\N	วันทำการ
4334	1066	5	1	2566	3	2	f	t	วันวิสาขบูชา	วันหยุดนักขัตฤกษ์
4335	1067	5	1	2566	3	2	t	f	\N	วันทำการ
4336	1068	5	1	2566	3	2	t	f	\N	วันทำการ
4337	1069	5	1	2566	3	2	t	f	\N	วันทำการ
4338	1070	5	1	2566	3	2	f	f	\N	วันหยุด
4339	1071	5	1	2566	3	2	f	f	\N	วันหยุด
4340	1072	5	1	2566	3	3	t	f	\N	วันทำการ
4341	1073	5	1	2566	3	3	t	f	\N	วันทำการ
4342	1074	5	1	2566	3	3	f	t	วันแรงงานแห่งชาติ	วันหยุดนักขัตฤกษ์
4343	1075	5	1	2566	3	3	t	f	\N	วันทำการ
4344	1076	5	1	2566	3	3	t	f	\N	วันทำการ
4345	1077	5	1	2566	3	3	f	t	วันฉัตรมงคล	วันหยุดนักขัตฤกษ์
4346	1078	5	1	2566	3	3	f	f	\N	วันหยุด
4347	1079	5	1	2566	3	4	f	t	วันหยุดชดเชยวันฉัตรมงคล	วันหยุดนักขัตฤกษ์
4348	1080	5	1	2566	3	4	t	f	\N	วันทำการ
4349	1081	5	1	2566	3	4	t	f	\N	วันทำการ
4350	1082	5	1	2566	3	4	t	f	\N	วันทำการ
4351	1083	5	1	2566	3	4	f	t	วันพืชมงคล	วันหยุดนักขัตฤกษ์
4352	1084	5	1	2566	3	4	f	f	\N	วันหยุด
4353	1085	5	1	2566	3	4	f	f	\N	วันหยุด
4354	1086	5	1	2566	3	5	t	f	\N	วันทำการ
4355	1087	5	1	2566	3	5	t	f	\N	วันทำการ
4356	1088	5	1	2566	3	5	t	f	\N	วันทำการ
4357	1089	5	1	2566	3	5	t	f	\N	วันทำการ
4358	1090	5	1	2566	3	5	t	f	\N	วันทำการ
4359	1091	5	1	2566	3	5	f	f	\N	วันหยุด
4360	1092	5	1	2566	3	5	f	f	\N	วันหยุด
4361	1093	5	1	2566	3	6	t	f	\N	วันทำการ
4362	1094	5	1	2566	3	6	t	f	\N	วันทำการ
4363	1095	5	1	2566	3	6	f	t	วันวิสาขบูชา	วันหยุดนักขัตฤกษ์
4364	1096	5	1	2566	3	6	t	f	\N	วันทำการ
4365	1097	5	1	2566	3	6	t	f	\N	วันทำการ
4366	1098	5	1	2566	3	6	f	f	\N	วันหยุด
4367	1099	5	1	2566	3	6	f	f	\N	วันหยุด
4368	1100	5	1	2566	3	7	t	f	\N	วันทำการ
4369	1101	5	1	2566	3	7	t	f	\N	วันทำการ
4370	1102	5	1	2566	3	7	t	f	\N	วันทำการ
4371	1103	5	1	2566	3	7	t	f	\N	วันทำการ
4372	1104	5	1	2566	3	7	t	f	\N	วันทำการ
4373	1105	5	1	2566	3	7	f	f	\N	วันหยุด
4374	1106	5	1	2566	3	7	f	f	\N	วันหยุด
4375	1107	5	1	2566	3	8	f	t	วันเฉลิมฯ พระราชินี	วันหยุดนักขัตฤกษ์
4376	1108	5	1	2566	3	8	t	f	\N	วันทำการ
4377	1109	5	1	2566	3	8	t	f	\N	วันทำการ
4378	1110	5	1	2566	3	8	t	f	\N	วันทำการ
4379	1111	5	1	2566	3	8	t	f	\N	วันทำการ
4380	1112	5	1	2566	3	8	f	f	\N	วันหยุด
4381	764	6	1	2566	1	1	t	f	\N	วันทำการ
4382	765	6	1	2566	1	1	t	f	\N	วันทำการ
4383	766	6	1	2566	1	1	t	f	\N	วันทำการ
4384	767	6	1	2566	1	1	t	f	\N	วันทำการ
4385	768	6	1	2566	1	1	t	f	\N	วันทำการ
4386	769	6	1	2566	1	1	f	f	\N	วันหยุด
4387	770	6	1	2566	1	1	f	f	\N	วันหยุด
4388	771	6	1	2566	1	2	f	t	วันอาสาฬหบูชา	วันหยุดนักขัตฤกษ์
4389	772	6	1	2566	1	2	f	t	วันเข้าพรรษา	วันหยุดนักขัตฤกษ์
4390	773	6	1	2566	1	2	t	f	\N	วันทำการ
4391	774	6	1	2566	1	2	t	f	\N	วันทำการ
4392	775	6	1	2566	1	2	t	f	\N	วันทำการ
4393	776	6	1	2566	1	2	f	f	\N	วันหยุด
4394	777	6	1	2566	1	2	f	f	\N	วันหยุด
4395	778	6	1	2566	1	3	t	f	\N	วันทำการ
4396	779	6	1	2566	1	3	t	f	\N	วันทำการ
4397	780	6	1	2566	1	3	t	f	\N	วันทำการ
4398	781	6	1	2566	1	3	t	f	\N	วันทำการ
4399	782	6	1	2566	1	3	t	f	\N	วันทำการ
4400	783	6	1	2566	1	3	f	f	\N	วันหยุด
4401	784	6	1	2566	1	3	f	f	\N	วันหยุด
4402	785	6	1	2566	1	4	t	f	\N	วันทำการ
4403	786	6	1	2566	1	4	t	f	\N	วันทำการ
4404	787	6	1	2566	1	4	t	f	\N	วันทำการ
4405	788	6	1	2566	1	4	t	f	\N	วันทำการ
4406	789	6	1	2566	1	4	t	f	\N	วันทำการ
4407	790	6	1	2566	1	4	f	f	\N	วันหยุด
4408	791	6	1	2566	1	4	f	f	\N	วันหยุด
4409	792	6	1	2566	1	5	t	f	\N	วันทำการ
4410	793	6	1	2566	1	5	t	f	\N	วันทำการ
4411	794	6	1	2566	1	5	t	f	\N	วันทำการ
4412	795	6	1	2566	1	5	t	f	\N	วันทำการ
4413	796	6	1	2566	1	5	f	t	วันเฉลิมฯ ร.10	วันหยุดนักขัตฤกษ์
4414	797	6	1	2566	1	5	f	f	\N	วันหยุด
4415	798	6	1	2566	1	5	f	f	\N	วันหยุด
4416	799	6	1	2566	1	6	f	t	นักขัตฤกษ์	วันหยุดนักขัตฤกษ์
4417	800	6	1	2566	1	6	f	t	วันอาสาฬหบูชา	วันหยุดนักขัตฤกษ์
4418	801	6	1	2566	1	6	t	f	\N	วันทำการ
4419	802	6	1	2566	1	6	t	f	\N	วันทำการ
4420	803	6	1	2566	1	6	t	f	\N	วันทำการ
4421	804	6	1	2566	1	6	f	f	\N	วันหยุด
4422	805	6	1	2566	1	6	f	f	\N	วันหยุด
4423	806	6	1	2566	1	7	t	f	\N	วันทำการ
4424	807	6	1	2566	1	7	t	f	\N	วันทำการ
4425	808	6	1	2566	1	7	t	f	\N	วันทำการ
4426	809	6	1	2566	1	7	t	f	\N	วันทำการ
4427	810	6	1	2566	1	7	t	f	\N	วันทำการ
4428	811	6	1	2566	1	7	f	t	วันแม่แห่งชาติ	วันหยุดนักขัตฤกษ์
4429	812	6	1	2566	1	7	f	f	\N	วันหยุด
4430	813	6	1	2566	1	8	f	t	ชดเชยวันแม่แห่งชาติ	วันหยุดนักขัตฤกษ์
4431	814	6	1	2566	1	8	t	f	\N	วันทำการ
4432	815	6	1	2566	1	8	t	f	\N	วันทำการ
4433	816	6	1	2566	1	8	t	f	\N	วันทำการ
4434	817	6	1	2566	1	8	t	f	\N	วันทำการ
4435	818	6	1	2566	1	8	f	f	\N	วันหยุด
4436	819	6	1	2566	1	8	f	f	\N	วันหยุด
4437	820	6	1	2566	1	9	t	f	\N	วันทำการ
4438	821	6	1	2566	1	9	t	f	\N	วันทำการ
4439	822	6	1	2566	1	9	t	f	\N	วันทำการ
4440	823	6	1	2566	1	9	t	f	\N	วันทำการ
4441	824	6	1	2566	1	9	t	f	\N	วันทำการ
4442	825	6	1	2566	1	9	f	f	\N	วันหยุด
4443	826	6	1	2566	1	9	f	f	\N	วันหยุด
4444	827	6	1	2566	1	10	t	f	\N	วันทำการ
4445	828	6	1	2566	1	10	t	f	\N	วันทำการ
4446	829	6	1	2566	1	10	t	f	\N	วันทำการ
4447	830	6	1	2566	1	10	t	f	\N	วันทำการ
4448	831	6	1	2566	1	10	t	f	\N	วันทำการ
4449	832	6	1	2566	1	10	f	f	\N	วันหยุด
4450	833	6	1	2566	1	10	f	f	\N	วันหยุด
4451	834	6	1	2566	1	11	t	f	\N	วันทำการ
4452	835	6	1	2566	1	11	t	f	\N	วันทำการ
4453	836	6	1	2566	1	11	t	f	\N	วันทำการ
4454	837	6	1	2566	1	11	t	f	\N	วันทำการ
4455	838	6	1	2566	1	11	t	f	\N	วันทำการ
4456	839	6	1	2566	1	11	f	f	\N	วันหยุด
4457	840	6	1	2566	1	11	f	f	\N	วันหยุด
4458	841	6	1	2566	1	12	t	f	\N	วันทำการ
4459	842	6	1	2566	1	12	t	f	\N	วันทำการ
4460	843	6	1	2566	1	12	t	f	\N	วันทำการ
4461	844	6	1	2566	1	12	t	f	\N	วันทำการ
4462	845	6	1	2566	1	12	t	f	\N	วันทำการ
4463	846	6	1	2566	1	12	f	f	\N	วันหยุด
4464	847	6	1	2566	1	12	f	f	\N	วันหยุด
4465	848	6	1	2566	1	13	t	f	\N	วันทำการ
4466	849	6	1	2566	1	13	t	f	\N	วันทำการ
4467	850	6	1	2566	1	13	t	f	\N	วันทำการ
4468	851	6	1	2566	1	13	t	f	\N	วันทำการ
4469	852	6	1	2566	1	13	f	t	วันสงขลานครินทร์	วันหยุดนักขัตฤกษ์
4470	853	6	1	2566	1	13	f	f	\N	วันหยุด
4471	854	6	1	2566	1	13	f	f	\N	วันหยุด
4472	855	6	1	2566	1	14	t	f	\N	วันทำการ
4473	856	6	1	2566	1	14	t	f	\N	วันทำการ
4474	857	6	1	2566	1	14	t	f	\N	วันทำการ
4475	858	6	1	2566	1	14	t	f	\N	วันทำการ
4476	859	6	1	2566	1	14	t	f	\N	วันทำการ
4477	860	6	1	2566	1	14	f	f	\N	วันหยุด
4478	861	6	1	2566	1	14	f	f	\N	วันหยุด
4479	862	6	1	2566	1	15	t	f	\N	วันทำการ
4480	863	6	1	2566	1	15	t	f	\N	วันทำการ
4481	864	6	1	2566	1	15	t	f	\N	วันทำการ
4482	865	6	1	2566	1	15	t	f	\N	วันทำการ
4483	866	6	1	2566	1	15	t	f	\N	วันทำการ
4484	867	6	1	2566	1	15	f	f	\N	วันหยุด
4485	868	6	1	2566	1	15	f	f	\N	วันหยุด
4486	869	6	1	2566	1	16	t	f	\N	วันทำการ
4487	870	6	1	2566	1	16	t	f	\N	วันทำการ
4488	871	6	1	2566	1	16	t	f	\N	วันทำการ
4489	872	6	1	2566	1	16	t	f	\N	วันทำการ
4490	873	6	1	2566	1	16	f	t	วันนวมินทรมหาราช	วันหยุดนักขัตฤกษ์
4491	874	6	1	2566	1	16	f	f	\N	วันหยุด
4492	875	6	1	2566	1	16	f	f	\N	วันหยุด
4493	876	6	1	2566	1	17	t	f	\N	วันทำการ
4494	877	6	1	2566	1	17	t	f	\N	วันทำการ
4495	878	6	1	2566	1	17	t	f	\N	วันทำการ
4496	879	6	1	2566	1	17	t	f	\N	วันทำการ
4497	880	6	1	2566	1	17	t	f	\N	วันทำการ
4498	881	6	1	2566	1	17	f	f	\N	วันหยุด
4499	882	6	1	2566	1	17	f	f	\N	วันหยุด
4500	883	6	1	2566	1	18	f	t	วันปิยมหาราช	วันหยุดนักขัตฤกษ์
4501	884	6	1	2566	1	18	t	f	\N	วันทำการ
4502	885	6	1	2566	1	18	t	f	\N	วันทำการ
4503	886	6	1	2566	1	18	t	f	\N	วันทำการ
4504	887	6	1	2566	1	18	t	f	\N	วันทำการ
4505	888	6	1	2566	1	18	f	f	\N	วันหยุด
4506	889	6	1	2566	\N	\N	f	f	\N	วันหยุด
4507	890	6	1	2566	\N	\N	f	f	\N	ปิดภาค
4508	891	6	1	2566	\N	\N	f	f	\N	ปิดภาค
4509	892	6	1	2566	\N	\N	f	f	\N	ปิดภาค
4510	893	6	1	2566	\N	\N	f	f	\N	ปิดภาค
4511	894	6	1	2566	\N	\N	f	f	\N	ปิดภาค
4512	895	6	1	2566	\N	\N	f	f	\N	วันหยุด
4513	896	6	1	2566	\N	\N	f	f	\N	วันหยุด
4514	897	6	1	2566	\N	\N	f	f	\N	ปิดภาค
4515	898	6	1	2566	\N	\N	f	f	\N	ปิดภาค
4516	899	6	1	2566	\N	\N	f	f	\N	ปิดภาค
4517	900	6	1	2566	\N	\N	f	f	\N	ปิดภาค
4518	901	6	1	2566	\N	\N	f	f	\N	ปิดภาค
4519	902	6	1	2566	\N	\N	f	f	\N	วันหยุด
4520	903	6	1	2566	\N	\N	f	f	\N	วันหยุด
4521	904	6	1	2566	\N	\N	f	f	\N	ปิดภาค
4522	905	6	1	2566	\N	\N	f	f	\N	ปิดภาค
4523	906	6	1	2566	\N	\N	f	f	\N	ปิดภาค
4524	907	6	1	2566	\N	\N	f	f	\N	ปิดภาค
4525	908	6	1	2566	\N	\N	f	f	\N	ปิดภาค
4526	909	6	1	2566	\N	\N	f	f	\N	วันหยุด
4527	910	6	1	2566	\N	\N	f	f	\N	วันหยุด
4528	911	6	1	2566	2	1	t	f	\N	วันทำการ
4529	912	6	1	2566	2	1	t	f	\N	วันทำการ
4530	913	6	1	2566	2	1	t	f	\N	วันทำการ
4531	914	6	1	2566	2	1	t	f	\N	วันทำการ
4532	915	6	1	2566	2	1	t	f	\N	วันทำการ
4533	916	6	1	2566	2	1	f	f	\N	วันหยุด
4534	917	6	1	2566	2	1	f	f	\N	วันหยุด
4535	918	6	1	2566	2	2	t	f	\N	วันทำการ
4536	919	6	1	2566	2	2	t	f	\N	วันทำการ
4537	920	6	1	2566	2	2	t	f	\N	วันทำการ
4538	921	6	1	2566	2	2	t	f	\N	วันทำการ
4539	922	6	1	2566	2	2	t	f	\N	วันทำการ
4540	923	6	1	2566	2	2	f	f	\N	วันหยุด
4541	924	6	1	2566	2	2	f	f	\N	วันหยุด
4542	925	6	1	2566	2	3	t	f	\N	วันทำการ
4543	926	6	1	2566	2	3	f	t	วันพ่อแห่งชาติ	วันหยุดนักขัตฤกษ์
4544	927	6	1	2566	2	3	t	f	\N	วันทำการ
4545	928	6	1	2566	2	3	t	f	\N	วันทำการ
4546	929	6	1	2566	2	3	t	f	\N	วันทำการ
4547	930	6	1	2566	2	3	f	f	\N	วันหยุด
4548	931	6	1	2566	2	3	f	t	วันรัฐธรรมนูญ	วันหยุดนักขัตฤกษ์
4549	932	6	1	2566	2	4	f	t	ชดเชยวันรัฐธรรมนูญ	วันหยุดนักขัตฤกษ์
4550	933	6	1	2566	2	4	t	f	\N	วันทำการ
4551	934	6	1	2566	2	4	t	f	\N	วันทำการ
4552	935	6	1	2566	2	4	t	f	\N	วันทำการ
4553	936	6	1	2566	2	4	t	f	\N	วันทำการ
4554	937	6	1	2566	2	4	f	f	\N	วันหยุด
4555	938	6	1	2566	2	4	f	f	\N	วันหยุด
4556	939	6	1	2566	2	5	t	f	\N	วันทำการ
4557	940	6	1	2566	2	5	t	f	\N	วันทำการ
4558	941	6	1	2566	2	5	t	f	\N	วันทำการ
4559	942	6	1	2566	2	5	t	f	\N	วันทำการ
4560	943	6	1	2566	2	5	t	f	\N	วันทำการ
4561	944	6	1	2566	2	5	f	f	\N	วันหยุด
4562	945	6	1	2566	2	5	f	t	วันคริสต์มาสอีฟ	วันหยุดนักขัตฤกษ์
4563	946	6	1	2566	2	6	f	t	วันคริสต์มาส	วันหยุดนักขัตฤกษ์
4564	947	6	1	2566	2	6	t	f	\N	วันทำการ
4565	948	6	1	2566	2	6	t	f	\N	วันทำการ
4566	949	6	1	2566	2	6	t	f	\N	วันทำการ
4567	950	6	1	2566	2	6	f	t	วันหยุดราชการธันวาคม	วันหยุดนักขัตฤกษ์
4568	951	6	1	2566	2	6	f	f	\N	วันหยุด
4569	952	6	1	2566	2	6	f	t	วันสิ้นปี	วันหยุดนักขัตฤกษ์
4570	953	6	1	2566	2	7	f	t	วันขึ้นปีใหม่	วันหยุดนักขัตฤกษ์
4571	954	6	1	2566	2	7	t	f	\N	วันทำการ
4572	955	6	1	2566	2	7	t	f	\N	วันทำการ
4573	956	6	1	2566	2	7	t	f	\N	วันทำการ
4574	957	6	1	2566	2	7	t	f	\N	วันทำการ
4575	958	6	1	2566	2	7	f	f	\N	วันหยุด
4576	959	6	1	2566	2	7	f	f	\N	วันหยุด
4577	960	6	1	2566	2	8	t	f	\N	วันทำการ
4578	961	6	1	2566	2	8	t	f	\N	วันทำการ
4579	962	6	1	2566	2	8	t	f	\N	วันทำการ
4580	963	6	1	2566	2	8	t	f	\N	วันทำการ
4581	964	6	1	2566	2	8	t	f	\N	วันทำการ
4582	965	6	1	2566	2	8	f	f	\N	วันหยุด
4583	966	6	1	2566	2	8	f	f	\N	วันหยุด
4584	967	6	1	2566	2	9	t	f	\N	วันทำการ
4585	968	6	1	2566	2	9	t	f	\N	วันทำการ
4586	969	6	1	2566	2	9	t	f	\N	วันทำการ
4587	970	6	1	2566	2	9	t	f	\N	วันทำการ
4588	971	6	1	2566	2	9	t	f	\N	วันทำการ
4589	972	6	1	2566	2	9	f	f	\N	วันหยุด
4590	973	6	1	2566	2	9	f	f	\N	วันหยุด
4591	974	6	1	2566	2	10	t	f	\N	วันทำการ
4592	975	6	1	2566	2	10	t	f	\N	วันทำการ
4593	976	6	1	2566	2	10	t	f	\N	วันทำการ
4594	977	6	1	2566	2	10	f	t	วันมาฆบูชา	วันหยุดนักขัตฤกษ์
4595	978	6	1	2566	2	10	t	f	\N	วันทำการ
4596	979	6	1	2566	2	10	f	f	\N	วันหยุด
4597	980	6	1	2566	2	10	f	f	\N	วันหยุด
4598	981	6	1	2566	2	11	t	f	\N	วันทำการ
4599	982	6	1	2566	2	11	t	f	\N	วันทำการ
4600	983	6	1	2566	2	11	t	f	\N	วันทำการ
4601	984	6	1	2566	2	11	t	f	\N	วันทำการ
4602	985	6	1	2566	2	11	t	f	\N	วันทำการ
4603	986	6	1	2566	2	11	f	f	\N	วันหยุด
4604	987	6	1	2566	2	11	f	f	\N	วันหยุด
4605	988	6	1	2566	2	12	t	f	\N	วันทำการ
4606	989	6	1	2566	2	12	t	f	\N	วันทำการ
4607	990	6	1	2566	2	12	t	f	\N	วันทำการ
4608	991	6	1	2566	2	12	t	f	\N	วันทำการ
4609	992	6	1	2566	2	12	t	f	\N	วันทำการ
4610	993	6	1	2566	2	12	f	t	วันตรุษจีน	วันหยุดนักขัตฤกษ์
4611	994	6	1	2566	2	12	f	t	วันตรุษจีน (วันที่ 2)	วันหยุดนักขัตฤกษ์
4612	995	6	1	2566	2	13	f	t	วันตรุษจีน (วันที่ 3)	วันหยุดนักขัตฤกษ์
4613	996	6	1	2566	2	13	t	f	\N	วันทำการ
4614	997	6	1	2566	2	13	f	t	วันวาเลนไทน์	วันหยุดนักขัตฤกษ์
4615	998	6	1	2566	2	13	t	f	\N	วันทำการ
4616	999	6	1	2566	2	13	t	f	\N	วันทำการ
4617	1000	6	1	2566	2	13	f	f	\N	วันหยุด
4618	1001	6	1	2566	2	13	f	f	\N	วันหยุด
4619	1002	6	1	2566	2	14	t	f	\N	วันทำการ
4620	1003	6	1	2566	2	14	t	f	\N	วันทำการ
4621	1004	6	1	2566	2	14	t	f	\N	วันทำการ
4622	1005	6	1	2566	2	14	t	f	\N	วันทำการ
4623	1006	6	1	2566	2	14	t	f	\N	วันทำการ
4624	1007	6	1	2566	2	14	f	t	วันมาฆบูชา	วันหยุดนักขัตฤกษ์
4625	1008	6	1	2566	2	14	f	f	\N	วันหยุด
4626	1009	6	1	2566	2	15	f	t	วันหยุดชดเชยวันมาฆบูชา	วันหยุดนักขัตฤกษ์
4627	1010	6	1	2566	2	15	t	f	\N	วันทำการ
4628	1011	6	1	2566	2	15	t	f	\N	วันทำการ
4629	1012	6	1	2566	2	15	t	f	\N	วันทำการ
4630	1013	6	1	2566	2	15	t	f	\N	วันทำการ
4631	1014	6	1	2566	2	15	f	f	\N	วันหยุด
4632	1015	6	1	2566	2	15	f	f	\N	วันหยุด
4633	1016	6	1	2566	2	16	t	f	\N	วันทำการ
4634	1017	6	1	2566	2	16	t	f	\N	วันทำการ
4635	1018	6	1	2566	2	16	t	f	\N	วันทำการ
4636	1019	6	1	2566	2	16	t	f	\N	วันทำการ
4637	1020	6	1	2566	2	16	t	f	\N	วันทำการ
4638	1021	6	1	2566	2	16	f	f	\N	วันหยุด
4639	1022	6	1	2566	2	16	f	f	\N	วันหยุด
4640	1023	6	1	2566	2	17	t	f	\N	วันทำการ
4641	1024	6	1	2566	2	17	t	f	\N	วันทำการ
4642	1025	6	1	2566	2	17	t	f	\N	วันทำการ
4643	1026	6	1	2566	2	17	t	f	\N	วันทำการ
4644	1027	6	1	2566	2	17	t	f	\N	วันทำการ
4645	1028	6	1	2566	2	17	f	f	\N	วันหยุด
4646	1029	6	1	2566	2	17	f	f	\N	วันหยุด
4647	1030	6	1	2566	2	18	t	f	\N	วันทำการ
4648	1031	6	1	2566	2	18	t	f	\N	วันทำการ
4649	1032	6	1	2566	2	18	t	f	\N	วันทำการ
4650	1033	6	1	2566	2	18	t	f	\N	วันทำการ
4651	1034	6	1	2566	2	18	t	f	\N	วันทำการ
4652	1035	6	1	2566	2	18	f	f	\N	วันหยุด
4653	1036	6	1	2566	\N	\N	f	f	\N	วันหยุด
4654	1037	6	1	2566	\N	\N	f	f	\N	ปิดภาค
4655	1038	6	1	2566	\N	\N	f	f	\N	ปิดภาค
4656	1039	6	1	2566	\N	\N	f	f	\N	ปิดภาค
4657	1040	6	1	2566	\N	\N	f	f	\N	ปิดภาค
4658	1041	6	1	2566	\N	\N	f	f	\N	ปิดภาค
4659	1042	6	1	2566	\N	\N	f	f	\N	วันหยุด
4660	1043	6	1	2566	\N	\N	f	f	\N	วันหยุด
4661	1044	6	1	2566	\N	\N	f	f	\N	ปิดภาค
4662	1045	6	1	2566	\N	\N	f	f	\N	ปิดภาค
4663	1046	6	1	2566	\N	\N	f	f	\N	ปิดภาค
4664	1047	6	1	2566	\N	\N	f	f	\N	ปิดภาค
4665	1048	6	1	2566	\N	\N	f	f	\N	ปิดภาค
4666	1049	6	1	2566	\N	\N	f	t	วันจักรี	วันหยุดนักขัตฤกษ์
4667	1050	6	1	2566	\N	\N	f	f	\N	วันหยุด
4668	1051	6	1	2566	\N	\N	f	t	ชดเชยวันจักรี	วันหยุดนักขัตฤกษ์
4669	1052	6	1	2566	\N	\N	f	f	\N	ปิดภาค
4670	1053	6	1	2566	\N	\N	f	f	\N	ปิดภาค
4671	1054	6	1	2566	\N	\N	f	f	\N	ปิดภาค
4672	1055	6	1	2566	\N	\N	f	t	วันสงกรานต์	วันหยุดนักขัตฤกษ์
4673	1056	6	1	2566	\N	\N	f	t	วันสงกรานต์	วันหยุดนักขัตฤกษ์
4674	1057	6	1	2566	\N	\N	f	t	วันสงกรานต์	วันหยุดนักขัตฤกษ์
4675	1058	6	1	2566	\N	\N	f	t	วันสงกรานต์	วันหยุดนักขัตฤกษ์
4676	1059	6	1	2566	\N	\N	f	t	ชดเชยวันสงกรานต์	วันหยุดนักขัตฤกษ์
4677	1060	6	1	2566	3	1	t	f	\N	วันทำการ
4678	1061	6	1	2566	3	1	t	f	\N	วันทำการ
4679	1062	6	1	2566	3	1	t	f	\N	วันทำการ
4680	1063	6	1	2566	3	1	f	f	\N	วันหยุด
4681	1064	6	1	2566	3	1	f	f	\N	วันหยุด
4682	1065	6	1	2566	3	2	t	f	\N	วันทำการ
4683	1066	6	1	2566	3	2	f	t	วันวิสาขบูชา	วันหยุดนักขัตฤกษ์
4684	1067	6	1	2566	3	2	t	f	\N	วันทำการ
4685	1068	6	1	2566	3	2	t	f	\N	วันทำการ
4686	1069	6	1	2566	3	2	t	f	\N	วันทำการ
4687	1070	6	1	2566	3	2	f	f	\N	วันหยุด
4688	1071	6	1	2566	3	2	f	f	\N	วันหยุด
4689	1072	6	1	2566	3	3	t	f	\N	วันทำการ
4690	1073	6	1	2566	3	3	t	f	\N	วันทำการ
4691	1074	6	1	2566	3	3	f	t	วันแรงงานแห่งชาติ	วันหยุดนักขัตฤกษ์
4692	1075	6	1	2566	3	3	t	f	\N	วันทำการ
4693	1076	6	1	2566	3	3	t	f	\N	วันทำการ
4694	1077	6	1	2566	3	3	f	t	วันฉัตรมงคล	วันหยุดนักขัตฤกษ์
4695	1078	6	1	2566	3	3	f	f	\N	วันหยุด
4696	1079	6	1	2566	3	4	f	t	วันหยุดชดเชยวันฉัตรมงคล	วันหยุดนักขัตฤกษ์
4697	1080	6	1	2566	3	4	t	f	\N	วันทำการ
4698	1081	6	1	2566	3	4	t	f	\N	วันทำการ
4699	1082	6	1	2566	3	4	t	f	\N	วันทำการ
4700	1083	6	1	2566	3	4	f	t	วันพืชมงคล	วันหยุดนักขัตฤกษ์
4701	1084	6	1	2566	3	4	f	f	\N	วันหยุด
4702	1085	6	1	2566	3	4	f	f	\N	วันหยุด
4703	1086	6	1	2566	3	5	t	f	\N	วันทำการ
4704	1087	6	1	2566	3	5	t	f	\N	วันทำการ
4705	1088	6	1	2566	3	5	t	f	\N	วันทำการ
4706	1089	6	1	2566	3	5	t	f	\N	วันทำการ
4707	1090	6	1	2566	3	5	t	f	\N	วันทำการ
4708	1091	6	1	2566	3	5	f	f	\N	วันหยุด
4709	1092	6	1	2566	3	5	f	f	\N	วันหยุด
4710	1093	6	1	2566	3	6	t	f	\N	วันทำการ
4711	1094	6	1	2566	3	6	t	f	\N	วันทำการ
4712	1095	6	1	2566	3	6	f	t	วันวิสาขบูชา	วันหยุดนักขัตฤกษ์
4713	1096	6	1	2566	3	6	t	f	\N	วันทำการ
4714	1097	6	1	2566	3	6	t	f	\N	วันทำการ
4715	1098	6	1	2566	3	6	f	f	\N	วันหยุด
4716	1099	6	1	2566	3	6	f	f	\N	วันหยุด
4717	1100	6	1	2566	3	7	t	f	\N	วันทำการ
4718	1101	6	1	2566	3	7	t	f	\N	วันทำการ
4719	1102	6	1	2566	3	7	t	f	\N	วันทำการ
4720	1103	6	1	2566	3	7	t	f	\N	วันทำการ
4721	1104	6	1	2566	3	7	t	f	\N	วันทำการ
4722	1105	6	1	2566	3	7	f	f	\N	วันหยุด
4723	1106	6	1	2566	3	7	f	f	\N	วันหยุด
4724	1107	6	1	2566	3	8	f	t	วันเฉลิมฯ พระราชินี	วันหยุดนักขัตฤกษ์
4725	1108	6	1	2566	3	8	t	f	\N	วันทำการ
4726	1109	6	1	2566	3	8	t	f	\N	วันทำการ
4727	1110	6	1	2566	3	8	t	f	\N	วันทำการ
4728	1111	6	1	2566	3	8	t	f	\N	วันทำการ
4729	1112	6	1	2566	3	8	f	f	\N	วันหยุด
4730	764	7	1	2566	1	1	t	f	\N	วันทำการ
4731	765	7	1	2566	1	1	t	f	\N	วันทำการ
4732	766	7	1	2566	1	1	t	f	\N	วันทำการ
4733	767	7	1	2566	1	1	t	f	\N	วันทำการ
4734	768	7	1	2566	1	1	t	f	\N	วันทำการ
4735	769	7	1	2566	1	1	f	f	\N	วันหยุด
4736	770	7	1	2566	1	1	f	f	\N	วันหยุด
4737	771	7	1	2566	1	2	f	t	วันอาสาฬหบูชา	วันหยุดนักขัตฤกษ์
4738	772	7	1	2566	1	2	f	t	วันเข้าพรรษา	วันหยุดนักขัตฤกษ์
4739	773	7	1	2566	1	2	t	f	\N	วันทำการ
4740	774	7	1	2566	1	2	t	f	\N	วันทำการ
4741	775	7	1	2566	1	2	t	f	\N	วันทำการ
4742	776	7	1	2566	1	2	f	f	\N	วันหยุด
4743	777	7	1	2566	1	2	f	f	\N	วันหยุด
4744	778	7	1	2566	1	3	t	f	\N	วันทำการ
4745	779	7	1	2566	1	3	t	f	\N	วันทำการ
4746	780	7	1	2566	1	3	t	f	\N	วันทำการ
4747	781	7	1	2566	1	3	t	f	\N	วันทำการ
4748	782	7	1	2566	1	3	t	f	\N	วันทำการ
4749	783	7	1	2566	1	3	f	f	\N	วันหยุด
4750	784	7	1	2566	1	3	f	f	\N	วันหยุด
4751	785	7	1	2566	1	4	t	f	\N	วันทำการ
4752	786	7	1	2566	1	4	t	f	\N	วันทำการ
4753	787	7	1	2566	1	4	t	f	\N	วันทำการ
4754	788	7	1	2566	1	4	t	f	\N	วันทำการ
4755	789	7	1	2566	1	4	t	f	\N	วันทำการ
4756	790	7	1	2566	1	4	f	f	\N	วันหยุด
4757	791	7	1	2566	1	4	f	f	\N	วันหยุด
4758	792	7	1	2566	1	5	t	f	\N	วันทำการ
4759	793	7	1	2566	1	5	t	f	\N	วันทำการ
4760	794	7	1	2566	1	5	t	f	\N	วันทำการ
4761	795	7	1	2566	1	5	t	f	\N	วันทำการ
4762	796	7	1	2566	1	5	f	t	วันเฉลิมฯ ร.10	วันหยุดนักขัตฤกษ์
4763	797	7	1	2566	1	5	f	f	\N	วันหยุด
4764	798	7	1	2566	1	5	f	f	\N	วันหยุด
4765	799	7	1	2566	1	6	f	t	นักขัตฤกษ์	วันหยุดนักขัตฤกษ์
4766	800	7	1	2566	1	6	f	t	วันอาสาฬหบูชา	วันหยุดนักขัตฤกษ์
4767	801	7	1	2566	1	6	t	f	\N	วันทำการ
4768	802	7	1	2566	1	6	t	f	\N	วันทำการ
4769	803	7	1	2566	1	6	t	f	\N	วันทำการ
4770	804	7	1	2566	1	6	f	f	\N	วันหยุด
4771	805	7	1	2566	1	6	f	f	\N	วันหยุด
4772	806	7	1	2566	1	7	t	f	\N	วันทำการ
4773	807	7	1	2566	1	7	t	f	\N	วันทำการ
4774	808	7	1	2566	1	7	t	f	\N	วันทำการ
4775	809	7	1	2566	1	7	t	f	\N	วันทำการ
4776	810	7	1	2566	1	7	t	f	\N	วันทำการ
4777	811	7	1	2566	1	7	f	t	วันแม่แห่งชาติ	วันหยุดนักขัตฤกษ์
4778	812	7	1	2566	1	7	f	f	\N	วันหยุด
4779	813	7	1	2566	1	8	f	t	ชดเชยวันแม่แห่งชาติ	วันหยุดนักขัตฤกษ์
4780	814	7	1	2566	1	8	t	f	\N	วันทำการ
4781	815	7	1	2566	1	8	t	f	\N	วันทำการ
4782	816	7	1	2566	1	8	t	f	\N	วันทำการ
4783	817	7	1	2566	1	8	t	f	\N	วันทำการ
4784	818	7	1	2566	1	8	f	f	\N	วันหยุด
4785	819	7	1	2566	1	8	f	f	\N	วันหยุด
4786	820	7	1	2566	1	9	t	f	\N	วันทำการ
4787	821	7	1	2566	1	9	t	f	\N	วันทำการ
4788	822	7	1	2566	1	9	t	f	\N	วันทำการ
4789	823	7	1	2566	1	9	t	f	\N	วันทำการ
4790	824	7	1	2566	1	9	t	f	\N	วันทำการ
4791	825	7	1	2566	1	9	f	f	\N	วันหยุด
4792	826	7	1	2566	1	9	f	f	\N	วันหยุด
4793	827	7	1	2566	1	10	t	f	\N	วันทำการ
4794	828	7	1	2566	1	10	t	f	\N	วันทำการ
4795	829	7	1	2566	1	10	t	f	\N	วันทำการ
4796	830	7	1	2566	1	10	t	f	\N	วันทำการ
4797	831	7	1	2566	1	10	t	f	\N	วันทำการ
4798	832	7	1	2566	1	10	f	f	\N	วันหยุด
4799	833	7	1	2566	1	10	f	f	\N	วันหยุด
4800	834	7	1	2566	1	11	t	f	\N	วันทำการ
4801	835	7	1	2566	1	11	t	f	\N	วันทำการ
4802	836	7	1	2566	1	11	t	f	\N	วันทำการ
4803	837	7	1	2566	1	11	t	f	\N	วันทำการ
4804	838	7	1	2566	1	11	t	f	\N	วันทำการ
4805	839	7	1	2566	1	11	f	f	\N	วันหยุด
4806	840	7	1	2566	1	11	f	f	\N	วันหยุด
4807	841	7	1	2566	1	12	t	f	\N	วันทำการ
4808	842	7	1	2566	1	12	t	f	\N	วันทำการ
4809	843	7	1	2566	1	12	t	f	\N	วันทำการ
4810	844	7	1	2566	1	12	t	f	\N	วันทำการ
4811	845	7	1	2566	1	12	t	f	\N	วันทำการ
4812	846	7	1	2566	1	12	f	f	\N	วันหยุด
4813	847	7	1	2566	1	12	f	f	\N	วันหยุด
4814	848	7	1	2566	1	13	t	f	\N	วันทำการ
4815	849	7	1	2566	1	13	t	f	\N	วันทำการ
4816	850	7	1	2566	1	13	t	f	\N	วันทำการ
4817	851	7	1	2566	1	13	t	f	\N	วันทำการ
4818	852	7	1	2566	1	13	f	t	วันสงขลานครินทร์	วันหยุดนักขัตฤกษ์
4819	853	7	1	2566	1	13	f	f	\N	วันหยุด
4820	854	7	1	2566	1	13	f	f	\N	วันหยุด
4821	855	7	1	2566	1	14	t	f	\N	วันทำการ
4822	856	7	1	2566	1	14	t	f	\N	วันทำการ
4823	857	7	1	2566	1	14	t	f	\N	วันทำการ
4824	858	7	1	2566	1	14	t	f	\N	วันทำการ
4825	859	7	1	2566	1	14	t	f	\N	วันทำการ
4826	860	7	1	2566	1	14	f	f	\N	วันหยุด
4827	861	7	1	2566	1	14	f	f	\N	วันหยุด
4828	862	7	1	2566	1	15	t	f	\N	วันทำการ
4829	863	7	1	2566	1	15	t	f	\N	วันทำการ
4830	864	7	1	2566	1	15	t	f	\N	วันทำการ
4831	865	7	1	2566	1	15	t	f	\N	วันทำการ
4832	866	7	1	2566	1	15	t	f	\N	วันทำการ
4833	867	7	1	2566	1	15	f	f	\N	วันหยุด
4834	868	7	1	2566	1	15	f	f	\N	วันหยุด
4835	869	7	1	2566	1	16	t	f	\N	วันทำการ
4836	870	7	1	2566	1	16	t	f	\N	วันทำการ
4837	871	7	1	2566	1	16	t	f	\N	วันทำการ
4838	872	7	1	2566	1	16	t	f	\N	วันทำการ
4839	873	7	1	2566	1	16	f	t	วันนวมินทรมหาราช	วันหยุดนักขัตฤกษ์
4840	874	7	1	2566	1	16	f	f	\N	วันหยุด
4841	875	7	1	2566	1	16	f	f	\N	วันหยุด
4842	876	7	1	2566	1	17	t	f	\N	วันทำการ
4843	877	7	1	2566	1	17	t	f	\N	วันทำการ
4844	878	7	1	2566	1	17	t	f	\N	วันทำการ
4845	879	7	1	2566	1	17	t	f	\N	วันทำการ
4846	880	7	1	2566	1	17	t	f	\N	วันทำการ
4847	881	7	1	2566	1	17	f	f	\N	วันหยุด
4848	882	7	1	2566	1	17	f	f	\N	วันหยุด
4849	883	7	1	2566	1	18	f	t	วันปิยมหาราช	วันหยุดนักขัตฤกษ์
4850	884	7	1	2566	1	18	t	f	\N	วันทำการ
4851	885	7	1	2566	1	18	t	f	\N	วันทำการ
4852	886	7	1	2566	1	18	t	f	\N	วันทำการ
4853	887	7	1	2566	1	18	t	f	\N	วันทำการ
4854	888	7	1	2566	1	18	f	f	\N	วันหยุด
4855	889	7	1	2566	\N	\N	f	f	\N	วันหยุด
4856	890	7	1	2566	\N	\N	f	f	\N	ปิดภาค
4857	891	7	1	2566	\N	\N	f	f	\N	ปิดภาค
4858	892	7	1	2566	\N	\N	f	f	\N	ปิดภาค
4859	893	7	1	2566	\N	\N	f	f	\N	ปิดภาค
4860	894	7	1	2566	\N	\N	f	f	\N	ปิดภาค
4861	895	7	1	2566	\N	\N	f	f	\N	วันหยุด
4862	896	7	1	2566	\N	\N	f	f	\N	วันหยุด
4863	897	7	1	2566	\N	\N	f	f	\N	ปิดภาค
4864	898	7	1	2566	\N	\N	f	f	\N	ปิดภาค
4865	899	7	1	2566	\N	\N	f	f	\N	ปิดภาค
4866	900	7	1	2566	\N	\N	f	f	\N	ปิดภาค
4867	901	7	1	2566	\N	\N	f	f	\N	ปิดภาค
4868	902	7	1	2566	\N	\N	f	f	\N	วันหยุด
4869	903	7	1	2566	\N	\N	f	f	\N	วันหยุด
4870	904	7	1	2566	\N	\N	f	f	\N	ปิดภาค
4871	905	7	1	2566	\N	\N	f	f	\N	ปิดภาค
4872	906	7	1	2566	\N	\N	f	f	\N	ปิดภาค
4873	907	7	1	2566	\N	\N	f	f	\N	ปิดภาค
4874	908	7	1	2566	\N	\N	f	f	\N	ปิดภาค
4875	909	7	1	2566	\N	\N	f	f	\N	วันหยุด
4876	910	7	1	2566	\N	\N	f	f	\N	วันหยุด
4877	911	7	1	2566	2	1	t	f	\N	วันทำการ
4878	912	7	1	2566	2	1	t	f	\N	วันทำการ
4879	913	7	1	2566	2	1	t	f	\N	วันทำการ
4880	914	7	1	2566	2	1	t	f	\N	วันทำการ
4881	915	7	1	2566	2	1	t	f	\N	วันทำการ
4882	916	7	1	2566	2	1	f	f	\N	วันหยุด
4883	917	7	1	2566	2	1	f	f	\N	วันหยุด
4884	918	7	1	2566	2	2	t	f	\N	วันทำการ
4885	919	7	1	2566	2	2	t	f	\N	วันทำการ
4886	920	7	1	2566	2	2	t	f	\N	วันทำการ
4887	921	7	1	2566	2	2	t	f	\N	วันทำการ
4888	922	7	1	2566	2	2	t	f	\N	วันทำการ
4889	923	7	1	2566	2	2	f	f	\N	วันหยุด
4890	924	7	1	2566	2	2	f	f	\N	วันหยุด
4891	925	7	1	2566	2	3	t	f	\N	วันทำการ
4892	926	7	1	2566	2	3	f	t	วันพ่อแห่งชาติ	วันหยุดนักขัตฤกษ์
4893	927	7	1	2566	2	3	t	f	\N	วันทำการ
4894	928	7	1	2566	2	3	t	f	\N	วันทำการ
4895	929	7	1	2566	2	3	t	f	\N	วันทำการ
4896	930	7	1	2566	2	3	f	f	\N	วันหยุด
4897	931	7	1	2566	2	3	f	t	วันรัฐธรรมนูญ	วันหยุดนักขัตฤกษ์
4898	932	7	1	2566	2	4	f	t	ชดเชยวันรัฐธรรมนูญ	วันหยุดนักขัตฤกษ์
4899	933	7	1	2566	2	4	t	f	\N	วันทำการ
4900	934	7	1	2566	2	4	t	f	\N	วันทำการ
4901	935	7	1	2566	2	4	t	f	\N	วันทำการ
4902	936	7	1	2566	2	4	t	f	\N	วันทำการ
4903	937	7	1	2566	2	4	f	f	\N	วันหยุด
4904	938	7	1	2566	2	4	f	f	\N	วันหยุด
4905	939	7	1	2566	2	5	t	f	\N	วันทำการ
4906	940	7	1	2566	2	5	t	f	\N	วันทำการ
4907	941	7	1	2566	2	5	t	f	\N	วันทำการ
4908	942	7	1	2566	2	5	t	f	\N	วันทำการ
4909	943	7	1	2566	2	5	t	f	\N	วันทำการ
4910	944	7	1	2566	2	5	f	f	\N	วันหยุด
4911	945	7	1	2566	2	5	f	t	วันคริสต์มาสอีฟ	วันหยุดนักขัตฤกษ์
4912	946	7	1	2566	2	6	f	t	วันคริสต์มาส	วันหยุดนักขัตฤกษ์
4913	947	7	1	2566	2	6	t	f	\N	วันทำการ
4914	948	7	1	2566	2	6	t	f	\N	วันทำการ
4915	949	7	1	2566	2	6	t	f	\N	วันทำการ
4916	950	7	1	2566	2	6	f	t	วันหยุดราชการธันวาคม	วันหยุดนักขัตฤกษ์
4917	951	7	1	2566	2	6	f	f	\N	วันหยุด
4918	952	7	1	2566	2	6	f	t	วันสิ้นปี	วันหยุดนักขัตฤกษ์
4919	953	7	1	2566	2	7	f	t	วันขึ้นปีใหม่	วันหยุดนักขัตฤกษ์
4920	954	7	1	2566	2	7	t	f	\N	วันทำการ
4921	955	7	1	2566	2	7	t	f	\N	วันทำการ
4922	956	7	1	2566	2	7	t	f	\N	วันทำการ
4923	957	7	1	2566	2	7	t	f	\N	วันทำการ
4924	958	7	1	2566	2	7	f	f	\N	วันหยุด
4925	959	7	1	2566	2	7	f	f	\N	วันหยุด
4926	960	7	1	2566	2	8	t	f	\N	วันทำการ
4927	961	7	1	2566	2	8	t	f	\N	วันทำการ
4928	962	7	1	2566	2	8	t	f	\N	วันทำการ
4929	963	7	1	2566	2	8	t	f	\N	วันทำการ
4930	964	7	1	2566	2	8	t	f	\N	วันทำการ
4931	965	7	1	2566	2	8	f	f	\N	วันหยุด
4932	966	7	1	2566	2	8	f	f	\N	วันหยุด
4933	967	7	1	2566	2	9	t	f	\N	วันทำการ
4934	968	7	1	2566	2	9	t	f	\N	วันทำการ
4935	969	7	1	2566	2	9	t	f	\N	วันทำการ
4936	970	7	1	2566	2	9	t	f	\N	วันทำการ
4937	971	7	1	2566	2	9	t	f	\N	วันทำการ
4938	972	7	1	2566	2	9	f	f	\N	วันหยุด
4939	973	7	1	2566	2	9	f	f	\N	วันหยุด
4940	974	7	1	2566	2	10	t	f	\N	วันทำการ
4941	975	7	1	2566	2	10	t	f	\N	วันทำการ
4942	976	7	1	2566	2	10	t	f	\N	วันทำการ
4943	977	7	1	2566	2	10	f	t	วันมาฆบูชา	วันหยุดนักขัตฤกษ์
4944	978	7	1	2566	2	10	t	f	\N	วันทำการ
4945	979	7	1	2566	2	10	f	f	\N	วันหยุด
4946	980	7	1	2566	2	10	f	f	\N	วันหยุด
4947	981	7	1	2566	2	11	t	f	\N	วันทำการ
4948	982	7	1	2566	2	11	t	f	\N	วันทำการ
4949	983	7	1	2566	2	11	t	f	\N	วันทำการ
4950	984	7	1	2566	2	11	t	f	\N	วันทำการ
4951	985	7	1	2566	2	11	t	f	\N	วันทำการ
4952	986	7	1	2566	2	11	f	f	\N	วันหยุด
4953	987	7	1	2566	2	11	f	f	\N	วันหยุด
4954	988	7	1	2566	2	12	t	f	\N	วันทำการ
4955	989	7	1	2566	2	12	t	f	\N	วันทำการ
4956	990	7	1	2566	2	12	t	f	\N	วันทำการ
4957	991	7	1	2566	2	12	t	f	\N	วันทำการ
4958	992	7	1	2566	2	12	t	f	\N	วันทำการ
4959	993	7	1	2566	2	12	f	t	วันตรุษจีน	วันหยุดนักขัตฤกษ์
4960	994	7	1	2566	2	12	f	t	วันตรุษจีน (วันที่ 2)	วันหยุดนักขัตฤกษ์
4961	995	7	1	2566	2	13	f	t	วันตรุษจีน (วันที่ 3)	วันหยุดนักขัตฤกษ์
4962	996	7	1	2566	2	13	t	f	\N	วันทำการ
4963	997	7	1	2566	2	13	f	t	วันวาเลนไทน์	วันหยุดนักขัตฤกษ์
4964	998	7	1	2566	2	13	t	f	\N	วันทำการ
4965	999	7	1	2566	2	13	t	f	\N	วันทำการ
4966	1000	7	1	2566	2	13	f	f	\N	วันหยุด
4967	1001	7	1	2566	2	13	f	f	\N	วันหยุด
4968	1002	7	1	2566	2	14	t	f	\N	วันทำการ
4969	1003	7	1	2566	2	14	t	f	\N	วันทำการ
4970	1004	7	1	2566	2	14	t	f	\N	วันทำการ
4971	1005	7	1	2566	2	14	t	f	\N	วันทำการ
4972	1006	7	1	2566	2	14	t	f	\N	วันทำการ
4973	1007	7	1	2566	2	14	f	t	วันมาฆบูชา	วันหยุดนักขัตฤกษ์
4974	1008	7	1	2566	2	14	f	f	\N	วันหยุด
4975	1009	7	1	2566	2	15	f	t	วันหยุดชดเชยวันมาฆบูชา	วันหยุดนักขัตฤกษ์
4976	1010	7	1	2566	2	15	t	f	\N	วันทำการ
4977	1011	7	1	2566	2	15	t	f	\N	วันทำการ
4978	1012	7	1	2566	2	15	t	f	\N	วันทำการ
4979	1013	7	1	2566	2	15	t	f	\N	วันทำการ
4980	1014	7	1	2566	2	15	f	f	\N	วันหยุด
4981	1015	7	1	2566	2	15	f	f	\N	วันหยุด
4982	1016	7	1	2566	2	16	t	f	\N	วันทำการ
4983	1017	7	1	2566	2	16	t	f	\N	วันทำการ
4984	1018	7	1	2566	2	16	t	f	\N	วันทำการ
4985	1019	7	1	2566	2	16	t	f	\N	วันทำการ
4986	1020	7	1	2566	2	16	t	f	\N	วันทำการ
4987	1021	7	1	2566	2	16	f	f	\N	วันหยุด
4988	1022	7	1	2566	2	16	f	f	\N	วันหยุด
4989	1023	7	1	2566	2	17	t	f	\N	วันทำการ
4990	1024	7	1	2566	2	17	t	f	\N	วันทำการ
4991	1025	7	1	2566	2	17	t	f	\N	วันทำการ
4992	1026	7	1	2566	2	17	t	f	\N	วันทำการ
4993	1027	7	1	2566	2	17	t	f	\N	วันทำการ
4994	1028	7	1	2566	2	17	f	f	\N	วันหยุด
4995	1029	7	1	2566	2	17	f	f	\N	วันหยุด
4996	1030	7	1	2566	2	18	t	f	\N	วันทำการ
4997	1031	7	1	2566	2	18	t	f	\N	วันทำการ
4998	1032	7	1	2566	2	18	t	f	\N	วันทำการ
4999	1033	7	1	2566	2	18	t	f	\N	วันทำการ
5000	1034	7	1	2566	2	18	t	f	\N	วันทำการ
5001	1035	7	1	2566	2	18	f	f	\N	วันหยุด
5002	1036	7	1	2566	\N	\N	f	f	\N	วันหยุด
5003	1037	7	1	2566	\N	\N	f	f	\N	ปิดภาค
5004	1038	7	1	2566	\N	\N	f	f	\N	ปิดภาค
5005	1039	7	1	2566	\N	\N	f	f	\N	ปิดภาค
5006	1040	7	1	2566	\N	\N	f	f	\N	ปิดภาค
5007	1041	7	1	2566	\N	\N	f	f	\N	ปิดภาค
5008	1042	7	1	2566	\N	\N	f	f	\N	วันหยุด
5009	1043	7	1	2566	\N	\N	f	f	\N	วันหยุด
5010	1044	7	1	2566	\N	\N	f	f	\N	ปิดภาค
5011	1045	7	1	2566	\N	\N	f	f	\N	ปิดภาค
5012	1046	7	1	2566	\N	\N	f	f	\N	ปิดภาค
5013	1047	7	1	2566	\N	\N	f	f	\N	ปิดภาค
5014	1048	7	1	2566	\N	\N	f	f	\N	ปิดภาค
5015	1049	7	1	2566	\N	\N	f	t	วันจักรี	วันหยุดนักขัตฤกษ์
5016	1050	7	1	2566	\N	\N	f	f	\N	วันหยุด
5017	1051	7	1	2566	\N	\N	f	t	ชดเชยวันจักรี	วันหยุดนักขัตฤกษ์
5018	1052	7	1	2566	\N	\N	f	f	\N	ปิดภาค
5019	1053	7	1	2566	\N	\N	f	f	\N	ปิดภาค
5020	1054	7	1	2566	\N	\N	f	f	\N	ปิดภาค
5021	1055	7	1	2566	\N	\N	f	t	วันสงกรานต์	วันหยุดนักขัตฤกษ์
5022	1056	7	1	2566	\N	\N	f	t	วันสงกรานต์	วันหยุดนักขัตฤกษ์
5023	1057	7	1	2566	\N	\N	f	t	วันสงกรานต์	วันหยุดนักขัตฤกษ์
5024	1058	7	1	2566	\N	\N	f	t	วันสงกรานต์	วันหยุดนักขัตฤกษ์
5025	1059	7	1	2566	\N	\N	f	t	ชดเชยวันสงกรานต์	วันหยุดนักขัตฤกษ์
5026	1060	7	1	2566	3	1	t	f	\N	วันทำการ
5027	1061	7	1	2566	3	1	t	f	\N	วันทำการ
5028	1062	7	1	2566	3	1	t	f	\N	วันทำการ
5029	1063	7	1	2566	3	1	f	f	\N	วันหยุด
5030	1064	7	1	2566	3	1	f	f	\N	วันหยุด
5031	1065	7	1	2566	3	2	t	f	\N	วันทำการ
5032	1066	7	1	2566	3	2	f	t	วันวิสาขบูชา	วันหยุดนักขัตฤกษ์
5033	1067	7	1	2566	3	2	t	f	\N	วันทำการ
5034	1068	7	1	2566	3	2	t	f	\N	วันทำการ
5035	1069	7	1	2566	3	2	t	f	\N	วันทำการ
5036	1070	7	1	2566	3	2	f	f	\N	วันหยุด
5037	1071	7	1	2566	3	2	f	f	\N	วันหยุด
5038	1072	7	1	2566	3	3	t	f	\N	วันทำการ
5039	1073	7	1	2566	3	3	t	f	\N	วันทำการ
5040	1074	7	1	2566	3	3	f	t	วันแรงงานแห่งชาติ	วันหยุดนักขัตฤกษ์
5041	1075	7	1	2566	3	3	t	f	\N	วันทำการ
5042	1076	7	1	2566	3	3	t	f	\N	วันทำการ
5043	1077	7	1	2566	3	3	f	t	วันฉัตรมงคล	วันหยุดนักขัตฤกษ์
5044	1078	7	1	2566	3	3	f	f	\N	วันหยุด
5045	1079	7	1	2566	3	4	f	t	วันหยุดชดเชยวันฉัตรมงคล	วันหยุดนักขัตฤกษ์
5046	1080	7	1	2566	3	4	t	f	\N	วันทำการ
5047	1081	7	1	2566	3	4	t	f	\N	วันทำการ
5048	1082	7	1	2566	3	4	t	f	\N	วันทำการ
5049	1083	7	1	2566	3	4	f	t	วันพืชมงคล	วันหยุดนักขัตฤกษ์
5050	1084	7	1	2566	3	4	f	f	\N	วันหยุด
5051	1085	7	1	2566	3	4	f	f	\N	วันหยุด
5052	1086	7	1	2566	3	5	t	f	\N	วันทำการ
5053	1087	7	1	2566	3	5	t	f	\N	วันทำการ
5054	1088	7	1	2566	3	5	t	f	\N	วันทำการ
5055	1089	7	1	2566	3	5	t	f	\N	วันทำการ
5056	1090	7	1	2566	3	5	t	f	\N	วันทำการ
5057	1091	7	1	2566	3	5	f	f	\N	วันหยุด
5058	1092	7	1	2566	3	5	f	f	\N	วันหยุด
5059	1093	7	1	2566	3	6	t	f	\N	วันทำการ
5060	1094	7	1	2566	3	6	t	f	\N	วันทำการ
5061	1095	7	1	2566	3	6	f	t	วันวิสาขบูชา	วันหยุดนักขัตฤกษ์
5062	1096	7	1	2566	3	6	t	f	\N	วันทำการ
5063	1097	7	1	2566	3	6	t	f	\N	วันทำการ
5064	1098	7	1	2566	3	6	f	f	\N	วันหยุด
5065	1099	7	1	2566	3	6	f	f	\N	วันหยุด
5066	1100	7	1	2566	3	7	t	f	\N	วันทำการ
5067	1101	7	1	2566	3	7	t	f	\N	วันทำการ
5068	1102	7	1	2566	3	7	t	f	\N	วันทำการ
5069	1103	7	1	2566	3	7	t	f	\N	วันทำการ
5070	1104	7	1	2566	3	7	t	f	\N	วันทำการ
5071	1105	7	1	2566	3	7	f	f	\N	วันหยุด
5072	1106	7	1	2566	3	7	f	f	\N	วันหยุด
5073	1107	7	1	2566	3	8	f	t	วันเฉลิมฯ พระราชินี	วันหยุดนักขัตฤกษ์
5074	1108	7	1	2566	3	8	t	f	\N	วันทำการ
5075	1109	7	1	2566	3	8	t	f	\N	วันทำการ
5076	1110	7	1	2566	3	8	t	f	\N	วันทำการ
5077	1111	7	1	2566	3	8	t	f	\N	วันทำการ
5078	1112	7	1	2566	3	8	f	f	\N	วันหยุด
5567	4359	1	16	2567	\N	\N	f	f	\N	วันหยุด
5429	4221	1	16	2567	1	1	t	f	\N	วันทำการ
5430	4222	1	16	2567	1	1	t	f	\N	วันทำการ
5431	4223	1	16	2567	1	1	t	f	\N	วันทำการ
5432	4224	1	16	2567	1	1	t	f	\N	วันทำการ
5433	4225	1	16	2567	1	1	f	f	\N	วันหยุด
5434	4226	1	16	2567	1	1	f	f	\N	วันหยุด
5435	4227	1	16	2567	1	2	t	f	\N	วันทำการ
5436	4228	1	16	2567	1	2	t	f	\N	วันทำการ
5437	4229	1	16	2567	1	2	t	f	\N	วันทำการ
5438	4230	1	16	2567	1	2	t	f	\N	วันทำการ
5439	4231	1	16	2567	1	2	t	f	\N	วันทำการ
5440	4232	1	16	2567	1	2	f	f	\N	วันหยุด
5441	4233	1	16	2567	1	2	f	f	\N	วันหยุด
5442	4234	1	16	2567	1	3	t	f	\N	วันทำการ
5443	4235	1	16	2567	1	3	t	f	\N	วันทำการ
5444	4236	1	16	2567	1	3	t	f	\N	วันทำการ
5445	4237	1	16	2567	1	3	t	f	\N	วันทำการ
5446	4238	1	16	2567	1	3	t	f	\N	วันทำการ
5447	4239	1	16	2567	1	3	f	f	\N	วันหยุด
5448	4240	1	16	2567	1	3	f	f	\N	วันหยุด
5449	4241	1	16	2567	1	4	t	f	\N	วันทำการ
5450	4242	1	16	2567	1	4	t	f	\N	วันทำการ
5451	4243	1	16	2567	1	4	t	f	\N	วันทำการ
5452	4244	1	16	2567	1	4	t	f	\N	วันทำการ
5453	4245	1	16	2567	1	4	t	f	\N	วันทำการ
5454	4246	1	16	2567	1	4	f	f	\N	วันหยุด
5455	4247	1	16	2567	1	4	f	f	\N	วันหยุด
5456	4248	1	16	2567	1	5	t	f	\N	วันทำการ
5457	4249	1	16	2567	1	5	t	f	\N	วันทำการ
5458	4250	1	16	2567	1	5	t	f	\N	วันทำการ
5459	4251	1	16	2567	1	5	t	f	\N	วันทำการ
5460	4252	1	16	2567	1	5	t	f	\N	วันทำการ
5461	4253	1	16	2567	1	5	f	f	\N	วันหยุด
5462	4254	1	16	2567	1	5	f	f	\N	วันหยุด
5463	4255	1	16	2567	1	6	t	f	\N	วันทำการ
5464	4256	1	16	2567	1	6	t	f	\N	วันทำการ
5465	4257	1	16	2567	1	6	f	t	วันรับปริญญา	วันหยุดนักขัตฤกษ์
5466	4258	1	16	2567	1	6	t	f	\N	วันทำการ
5467	4259	1	16	2567	1	6	t	f	\N	วันทำการ
5468	4260	1	16	2567	1	6	f	f	\N	วันหยุด
5469	4261	1	16	2567	1	6	f	t	วันสงขลานครินทร์	วันหยุดนักขัตฤกษ์
5470	4262	1	16	2567	1	7	f	t	ชดเชยวันสงขลานครินทร์	วันหยุดนักขัตฤกษ์
5471	4263	1	16	2567	1	7	t	f	\N	วันทำการ
5472	4264	1	16	2567	1	7	t	f	\N	วันทำการ
5473	4265	1	16	2567	1	7	t	f	\N	วันทำการ
5474	4266	1	16	2567	1	7	t	f	\N	วันทำการ
5475	4267	1	16	2567	1	7	f	f	\N	วันหยุด
5476	4268	1	16	2567	1	7	f	f	\N	วันหยุด
5477	4269	1	16	2567	1	8	t	f	\N	วันทำการ
5478	4270	1	16	2567	1	8	t	f	\N	วันทำการ
5479	4271	1	16	2567	1	8	t	f	\N	วันทำการ
5480	4272	1	16	2567	1	8	t	f	\N	วันทำการ
5481	4273	1	16	2567	1	8	t	f	\N	วันทำการ
5482	4274	1	16	2567	1	8	f	f	\N	วันหยุด
5483	4275	1	16	2567	1	8	f	f	\N	วันหยุด
5484	4276	1	16	2567	1	9	t	f	\N	วันทำการ
5485	4277	1	16	2567	1	9	t	f	\N	วันทำการ
5486	4278	1	16	2567	1	9	t	f	\N	วันทำการ
5487	4279	1	16	2567	1	9	t	f	\N	วันทำการ
5488	4280	1	16	2567	1	9	t	f	\N	วันทำการ
5489	4281	1	16	2567	1	9	f	f	\N	วันหยุด
5490	4282	1	16	2567	1	9	f	t	วันนวมินทรมหาราช	วันหยุดนักขัตฤกษ์
5568	4360	1	16	2567	\N	\N	f	t	วันหยุดราชการธันวาคม	วันหยุดนักขัตฤกษ์
5645	4437	1	16	2567	2	11	t	f	\N	วันทำการ
5491	4283	1	16	2567	1	10	f	t	วันหยุดชดเชยวันคล้ายวันสวรรคตของพระบาทสมเด็จพระปรมินทรมหาภูมิพลอดุลยเดชบรมนาถบพิตร	วันหยุดนักขัตฤกษ์
5492	4284	1	16	2567	1	10	t	f	\N	วันทำการ
5493	4285	1	16	2567	1	10	t	f	\N	วันทำการ
5494	4286	1	16	2567	1	10	t	f	\N	วันทำการ
5495	4287	1	16	2567	1	10	t	f	\N	วันทำการ
5496	4288	1	16	2567	1	10	f	f	\N	วันหยุด
5497	4289	1	16	2567	1	10	f	f	\N	วันหยุด
5498	4290	1	16	2567	1	11	t	f	\N	วันทำการ
5499	4291	1	16	2567	1	11	t	f	\N	วันทำการ
5500	4292	1	16	2567	1	11	f	t	วันปิยมหาราช	วันหยุดนักขัตฤกษ์
5501	4293	1	16	2567	1	11	t	f	\N	วันทำการ
5502	4294	1	16	2567	1	11	t	f	\N	วันทำการ
5503	4295	1	16	2567	1	11	f	f	\N	วันหยุด
5504	4296	1	16	2567	1	11	f	f	\N	วันหยุด
5505	4297	1	16	2567	1	12	t	f	\N	วันทำการ
5506	4298	1	16	2567	1	12	t	f	\N	วันทำการ
5507	4299	1	16	2567	1	12	t	f	\N	วันทำการ
5508	4300	1	16	2567	1	12	t	f	\N	วันทำการ
5509	4301	1	16	2567	1	12	t	f	\N	วันทำการ
5510	4302	1	16	2567	1	12	f	f	\N	วันหยุด
5511	4303	1	16	2567	1	12	f	f	\N	วันหยุด
5512	4304	1	16	2567	1	13	t	f	\N	วันทำการ
5513	4305	1	16	2567	1	13	t	f	\N	วันทำการ
5514	4306	1	16	2567	1	13	t	f	\N	วันทำการ
5515	4307	1	16	2567	1	13	t	f	\N	วันทำการ
5516	4308	1	16	2567	1	13	t	f	\N	วันทำการ
5517	4309	1	16	2567	1	13	f	f	\N	วันหยุด
5518	4310	1	16	2567	1	13	f	f	\N	วันหยุด
5519	4311	1	16	2567	1	14	t	f	\N	วันทำการ
5520	4312	1	16	2567	1	14	t	f	\N	วันทำการ
5521	4313	1	16	2567	1	14	t	f	\N	วันทำการ
5522	4314	1	16	2567	1	14	t	f	\N	วันทำการ
5523	4315	1	16	2567	1	14	t	f	\N	วันทำการ
5524	4316	1	16	2567	1	14	f	f	\N	วันหยุด
5525	4317	1	16	2567	1	14	f	f	\N	วันหยุด
5526	4318	1	16	2567	1	15	t	f	\N	วันทำการ
5527	4319	1	16	2567	1	15	t	f	\N	วันทำการ
5528	4320	1	16	2567	1	15	t	f	\N	วันทำการ
5529	4321	1	16	2567	1	15	t	f	\N	วันทำการ
5530	4322	1	16	2567	1	15	t	f	\N	วันทำการ
5531	4323	1	16	2567	1	15	f	f	\N	วันหยุด
5532	4324	1	16	2567	1	15	f	f	\N	วันหยุด
5533	4325	1	16	2567	1	16	t	f	\N	วันทำการ
5534	4326	1	16	2567	1	16	t	f	\N	วันทำการ
5535	4327	1	16	2567	1	16	t	f	\N	วันทำการ
5536	4328	1	16	2567	1	16	t	f	\N	วันทำการ
5537	4329	1	16	2567	1	16	t	f	\N	วันทำการ
5538	4330	1	16	2567	1	16	f	f	\N	วันหยุด
5539	4331	1	16	2567	1	16	f	f	\N	วันหยุด
5540	4332	1	16	2567	1	17	t	f	\N	วันทำการ
5541	4333	1	16	2567	1	17	t	f	\N	วันทำการ
5542	4334	1	16	2567	1	17	t	f	\N	วันทำการ
5543	4335	1	16	2567	1	17	f	t	วันพ่อแห่งชาติ	วันหยุดนักขัตฤกษ์
5544	4336	1	16	2567	1	17	t	f	\N	วันทำการ
5545	4337	1	16	2567	1	17	f	f	\N	วันหยุด
5546	4338	1	16	2567	1	17	f	f	\N	วันหยุด
5547	4339	1	16	2567	1	18	t	f	\N	วันทำการ
5548	4340	1	16	2567	1	18	f	t	วันรัฐธรรมนูญ	วันหยุดนักขัตฤกษ์
5549	4341	1	16	2567	1	18	t	f	\N	วันทำการ
5550	4342	1	16	2567	1	18	t	f	\N	วันทำการ
5551	4343	1	16	2567	1	18	t	f	\N	วันทำการ
5552	4344	1	16	2567	1	18	f	f	\N	วันหยุด
5553	4345	1	16	2567	\N	\N	f	f	\N	วันหยุด
5554	4346	1	16	2567	\N	\N	f	f	\N	ปิดภาค
5555	4347	1	16	2567	\N	\N	f	f	\N	ปิดภาค
5556	4348	1	16	2567	\N	\N	f	f	\N	ปิดภาค
5557	4349	1	16	2567	\N	\N	f	f	\N	ปิดภาค
5558	4350	1	16	2567	\N	\N	f	f	\N	ปิดภาค
5559	4351	1	16	2567	\N	\N	f	f	\N	วันหยุด
5560	4352	1	16	2567	\N	\N	f	f	\N	วันหยุด
5561	4353	1	16	2567	\N	\N	f	f	\N	ปิดภาค
5562	4354	1	16	2567	\N	\N	f	t	วันคริสต์มาสอีฟ	วันหยุดนักขัตฤกษ์
5563	4355	1	16	2567	\N	\N	f	t	วันคริสต์มาส	วันหยุดนักขัตฤกษ์
5564	4356	1	16	2567	\N	\N	f	f	\N	ปิดภาค
5565	4357	1	16	2567	\N	\N	f	f	\N	ปิดภาค
5566	4358	1	16	2567	\N	\N	f	f	\N	วันหยุด
5569	4361	1	16	2567	\N	\N	f	t	วันสิ้นปี	วันหยุดนักขัตฤกษ์
5570	4362	1	16	2567	\N	\N	f	t	วันขึ้นปีใหม่	วันหยุดนักขัตฤกษ์
5571	4363	1	16	2567	\N	\N	f	t	วันหยุดพิเศษ (ครม.)	วันหยุดนักขัตฤกษ์
5572	4364	1	16	2567	\N	\N	f	f	\N	ปิดภาค
5573	4365	1	16	2567	\N	\N	f	f	\N	วันหยุด
5574	4366	1	16	2567	\N	\N	f	f	\N	วันหยุด
5575	4367	1	16	2567	2	1	t	f	\N	วันทำการ
5576	4368	1	16	2567	2	1	t	f	\N	วันทำการ
5577	4369	1	16	2567	2	1	t	f	\N	วันทำการ
5578	4370	1	16	2567	2	1	t	f	\N	วันทำการ
5579	4371	1	16	2567	2	1	t	f	\N	วันทำการ
5580	4372	1	16	2567	2	1	f	f	\N	วันหยุด
5581	4373	1	16	2567	2	1	f	f	\N	วันหยุด
5582	4374	1	16	2567	2	2	t	f	\N	วันทำการ
5583	4375	1	16	2567	2	2	t	f	\N	วันทำการ
5584	4376	1	16	2567	2	2	t	f	\N	วันทำการ
5585	4377	1	16	2567	2	2	t	f	\N	วันทำการ
5586	4378	1	16	2567	2	2	t	f	\N	วันทำการ
5587	4379	1	16	2567	2	2	f	f	\N	วันหยุด
5588	4380	1	16	2567	2	2	f	f	\N	วันหยุด
5589	4381	1	16	2567	2	3	t	f	\N	วันทำการ
5590	4382	1	16	2567	2	3	t	f	\N	วันทำการ
5591	4383	1	16	2567	2	3	t	f	\N	วันทำการ
5592	4384	1	16	2567	2	3	t	f	\N	วันทำการ
5593	4385	1	16	2567	2	3	t	f	\N	วันทำการ
5594	4386	1	16	2567	2	3	f	f	\N	วันหยุด
5595	4387	1	16	2567	2	3	f	f	\N	วันหยุด
5596	4388	1	16	2567	2	4	t	f	\N	วันทำการ
5597	4389	1	16	2567	2	4	t	f	\N	วันทำการ
5598	4390	1	16	2567	2	4	f	t	วันตรุษจีน	วันหยุดนักขัตฤกษ์
5599	4391	1	16	2567	2	4	f	t	วันตรุษจีน (วันที่ 2)	วันหยุดนักขัตฤกษ์
5600	4392	1	16	2567	2	4	f	t	วันตรุษจีน (วันที่ 3)	วันหยุดนักขัตฤกษ์
5601	4393	1	16	2567	2	4	f	f	\N	วันหยุด
5602	4394	1	16	2567	2	4	f	f	\N	วันหยุด
5603	4395	1	16	2567	2	5	t	f	\N	วันทำการ
5604	4396	1	16	2567	2	5	t	f	\N	วันทำการ
5605	4397	1	16	2567	2	5	t	f	\N	วันทำการ
5606	4398	1	16	2567	2	5	t	f	\N	วันทำการ
5607	4399	1	16	2567	2	5	t	f	\N	วันทำการ
5608	4400	1	16	2567	2	5	f	f	\N	วันหยุด
5609	4401	1	16	2567	2	5	f	f	\N	วันหยุด
5610	4402	1	16	2567	2	6	t	f	\N	วันทำการ
5611	4403	1	16	2567	2	6	t	f	\N	วันทำการ
5612	4404	1	16	2567	2	6	f	t	วันมาฆบูชา	วันหยุดนักขัตฤกษ์
5613	4405	1	16	2567	2	6	t	f	\N	วันทำการ
5614	4406	1	16	2567	2	6	f	t	วันวาเลนไทน์	วันหยุดนักขัตฤกษ์
5615	4407	1	16	2567	2	6	f	f	\N	วันหยุด
5616	4408	1	16	2567	2	6	f	f	\N	วันหยุด
5617	4409	1	16	2567	2	7	t	f	\N	วันทำการ
5618	4410	1	16	2567	2	7	t	f	\N	วันทำการ
5619	4411	1	16	2567	2	7	t	f	\N	วันทำการ
5620	4412	1	16	2567	2	7	t	f	\N	วันทำการ
5621	4413	1	16	2567	2	7	t	f	\N	วันทำการ
5622	4414	1	16	2567	2	7	f	f	\N	วันหยุด
5623	4415	1	16	2567	2	7	f	f	\N	วันหยุด
5624	4416	1	16	2567	2	8	t	f	\N	วันทำการ
5625	4417	1	16	2567	2	8	t	f	\N	วันทำการ
5626	4418	1	16	2567	2	8	t	f	\N	วันทำการ
5627	4419	1	16	2567	2	8	t	f	\N	วันทำการ
5628	4420	1	16	2567	2	8	t	f	\N	วันทำการ
5629	4421	1	16	2567	2	8	f	f	\N	วันหยุด
5630	4422	1	16	2567	2	8	f	f	\N	วันหยุด
5631	4423	1	16	2567	2	9	t	f	\N	วันทำการ
5632	4424	1	16	2567	2	9	t	f	\N	วันทำการ
5633	4425	1	16	2567	2	9	t	f	\N	วันทำการ
5634	4426	1	16	2567	2	9	t	f	\N	วันทำการ
5635	4427	1	16	2567	2	9	t	f	\N	วันทำการ
5636	4428	1	16	2567	2	9	f	f	\N	วันหยุด
5637	4429	1	16	2567	2	9	f	f	\N	วันหยุด
5638	4430	1	16	2567	2	10	t	f	\N	วันทำการ
5639	4431	1	16	2567	2	10	t	f	\N	วันทำการ
5640	4432	1	16	2567	2	10	t	f	\N	วันทำการ
5641	4433	1	16	2567	2	10	t	f	\N	วันทำการ
5642	4434	1	16	2567	2	10	t	f	\N	วันทำการ
5643	4435	1	16	2567	2	10	f	f	\N	วันหยุด
5644	4436	1	16	2567	2	10	f	f	\N	วันหยุด
5646	4438	1	16	2567	2	11	t	f	\N	วันทำการ
5647	4439	1	16	2567	2	11	t	f	\N	วันทำการ
5648	4440	1	16	2567	2	11	t	f	\N	วันทำการ
5649	4441	1	16	2567	2	11	t	f	\N	วันทำการ
5650	4442	1	16	2567	2	11	f	f	\N	วันหยุด
5651	4443	1	16	2567	2	11	f	f	\N	วันหยุด
5652	4444	1	16	2567	2	12	t	f	\N	วันทำการ
5653	4445	1	16	2567	2	12	t	f	\N	วันทำการ
5654	4446	1	16	2567	2	12	t	f	\N	วันทำการ
5655	4447	1	16	2567	2	12	t	f	\N	วันทำการ
5656	4448	1	16	2567	2	12	t	f	\N	วันทำการ
5657	4449	1	16	2567	2	12	f	f	\N	วันหยุด
5658	4450	1	16	2567	2	12	f	f	\N	วันหยุด
5659	4451	1	16	2567	2	13	f	t	วันรายออีดี้ลฟิตรี	วันหยุดนักขัตฤกษ์
5660	4452	1	16	2567	2	13	t	f	\N	วันทำการ
5661	4453	1	16	2567	2	13	t	f	\N	วันทำการ
5662	4454	1	16	2567	2	13	t	f	\N	วันทำการ
5663	4455	1	16	2567	2	13	t	f	\N	วันทำการ
5664	4456	1	16	2567	2	13	f	f	\N	วันหยุด
5665	4457	1	16	2567	2	13	f	t	วันจักรี	วันหยุดนักขัตฤกษ์
5666	4458	1	16	2567	2	14	f	t	ชดเชยวันจักรี	วันหยุดนักขัตฤกษ์
5667	4459	1	16	2567	2	14	t	f	\N	วันทำการ
5668	4460	1	16	2567	2	14	t	f	\N	วันทำการ
5669	4461	1	16	2567	2	14	t	f	\N	วันทำการ
5670	4462	1	16	2567	2	14	t	f	\N	วันทำการ
5671	4463	1	16	2567	2	14	f	f	\N	วันหยุด
5672	4464	1	16	2567	2	14	f	t	วันสงกรานต์	วันหยุดนักขัตฤกษ์
5673	4465	1	16	2567	2	15	f	t	วันสงกรานต์	วันหยุดนักขัตฤกษ์
5674	4466	1	16	2567	2	15	f	t	วันสงกรานต์	วันหยุดนักขัตฤกษ์
5675	4467	1	16	2567	2	15	f	t	วันหยุดชดเชยวันสงกรานต์	วันหยุดนักขัตฤกษ์
5676	4468	1	16	2567	2	15	t	f	\N	วันทำการ
5677	4469	1	16	2567	2	15	t	f	\N	วันทำการ
5678	4470	1	16	2567	2	15	f	f	\N	วันหยุด
5679	4471	1	16	2567	2	15	f	f	\N	วันหยุด
5680	4472	1	16	2567	2	16	t	f	\N	วันทำการ
5681	4473	1	16	2567	2	16	t	f	\N	วันทำการ
5682	4474	1	16	2567	2	16	t	f	\N	วันทำการ
5683	4475	1	16	2567	2	16	t	f	\N	วันทำการ
5684	4476	1	16	2567	2	16	t	f	\N	วันทำการ
5685	4477	1	16	2567	2	16	f	f	\N	วันหยุด
5686	4478	1	16	2567	2	16	f	f	\N	วันหยุด
5687	4479	1	16	2567	2	17	t	f	\N	วันทำการ
5688	4480	1	16	2567	2	17	t	f	\N	วันทำการ
5689	4481	1	16	2567	2	17	t	f	\N	วันทำการ
5690	4482	1	16	2567	2	17	f	t	วันแรงงานแห่งชาติ	วันหยุดนักขัตฤกษ์
5691	4483	1	16	2567	2	17	t	f	\N	วันทำการ
5692	4484	1	16	2567	2	17	f	f	\N	วันหยุด
5693	4485	1	16	2567	2	17	f	t	วันฉัตรมงคล	วันหยุดนักขัตฤกษ์
5694	4486	1	16	2567	2	18	f	t	ชดเชยวันฉัตรมงคล	วันหยุดนักขัตฤกษ์
5695	4487	1	16	2567	2	18	t	f	\N	วันทำการ
5696	4488	1	16	2567	2	18	t	f	\N	วันทำการ
5697	4489	1	16	2567	2	18	t	f	\N	วันทำการ
5698	4490	1	16	2567	2	18	f	t	วันพืชมงคล	วันหยุดนักขัตฤกษ์
5699	4491	1	16	2567	2	18	f	f	\N	วันหยุด
5700	1100	1	17	2567	1	1	t	f	\N	วันทำการ
5701	1101	1	17	2567	1	1	t	f	\N	วันทำการ
5702	1102	1	17	2567	1	1	t	f	\N	วันทำการ
5703	1103	1	17	2567	1	1	t	f	\N	วันทำการ
5704	1104	1	17	2567	1	1	t	f	\N	วันทำการ
5705	1105	1	17	2567	1	1	f	f	\N	วันหยุด
5706	1106	1	17	2567	1	1	f	f	\N	วันหยุด
5707	1107	1	17	2567	1	2	f	t	วันเฉลิมฯ พระราชินี	วันหยุดนักขัตฤกษ์
5708	1108	1	17	2567	1	2	t	f	\N	วันทำการ
5709	1109	1	17	2567	1	2	t	f	\N	วันทำการ
5710	1110	1	17	2567	1	2	t	f	\N	วันทำการ
5711	1111	1	17	2567	1	2	t	f	\N	วันทำการ
5712	1112	1	17	2567	1	2	f	f	\N	วันหยุด
5713	4805	1	17	2567	1	2	f	f	\N	วันหยุด
5714	4806	1	17	2567	1	3	t	f	\N	วันทำการ
5715	4807	1	17	2567	1	3	t	f	\N	วันทำการ
5716	4808	1	17	2567	1	3	t	f	\N	วันทำการ
5717	4809	1	17	2567	1	3	t	f	\N	วันทำการ
5718	4810	1	17	2567	1	3	t	f	\N	วันทำการ
5719	4811	1	17	2567	1	3	f	f	\N	วันหยุด
5720	4812	1	17	2567	1	3	f	f	\N	วันหยุด
5721	4813	1	17	2567	1	4	t	f	\N	วันทำการ
5722	4814	1	17	2567	1	4	t	f	\N	วันทำการ
5723	4815	1	17	2567	1	4	t	f	\N	วันทำการ
5724	4816	1	17	2567	1	4	t	f	\N	วันทำการ
5725	4817	1	17	2567	1	4	t	f	\N	วันทำการ
5726	4818	1	17	2567	1	4	f	t	วันอาสาฬหบูชา	วันหยุดนักขัตฤกษ์
5727	4819	1	17	2567	1	4	f	t	วันเข้าพรรษา	วันหยุดนักขัตฤกษ์
5728	4171	1	17	2567	1	5	t	f	\N	วันทำการ
5729	4172	1	17	2567	1	5	t	f	\N	วันทำการ
5730	4173	1	17	2567	1	5	t	f	\N	วันทำการ
5731	4174	1	17	2567	1	5	t	f	\N	วันทำการ
5732	4175	1	17	2567	1	5	t	f	\N	วันทำการ
5733	4176	1	17	2567	1	5	f	f	\N	วันหยุด
5734	4177	1	17	2567	1	5	f	f	\N	วันหยุด
5735	4178	1	17	2567	1	6	t	f	\N	วันทำการ
5736	4179	1	17	2567	1	6	t	f	\N	วันทำการ
5737	4180	1	17	2567	1	6	t	f	\N	วันทำการ
5738	4181	1	17	2567	1	6	t	f	\N	วันทำการ
5739	4182	1	17	2567	1	6	t	f	\N	วันทำการ
5740	4183	1	17	2567	1	6	f	f	\N	วันหยุด
5741	4184	1	17	2567	1	6	f	f	\N	วันหยุด
5742	4185	1	17	2567	1	7	t	f	\N	วันทำการ
5743	4186	1	17	2567	1	7	t	f	\N	วันทำการ
5744	4187	1	17	2567	1	7	t	f	\N	วันทำการ
5745	4188	1	17	2567	1	7	t	f	\N	วันทำการ
5746	4189	1	17	2567	1	7	t	f	\N	วันทำการ
5747	4190	1	17	2567	1	7	f	f	\N	วันหยุด
5748	4191	1	17	2567	1	7	f	f	\N	วันหยุด
5749	4192	1	17	2567	1	8	t	f	\N	วันทำการ
5750	4193	1	17	2567	1	8	t	f	\N	วันทำการ
5751	4194	1	17	2567	1	8	t	f	\N	วันทำการ
5752	4195	1	17	2567	1	8	t	f	\N	วันทำการ
5753	4196	1	17	2567	1	8	t	f	\N	วันทำการ
5754	4197	1	17	2567	1	8	f	t	วันอาสาฬหบูชา	วันหยุดนักขัตฤกษ์
5755	4198	1	17	2567	1	8	f	f	\N	วันหยุด
5756	4199	1	17	2567	1	9	f	t	วันหยุดชดเชยวันอาสาฬหบูชา	วันหยุดนักขัตฤกษ์
5757	4200	1	17	2567	1	9	t	f	\N	วันทำการ
5758	4201	1	17	2567	1	9	t	f	\N	วันทำการ
5759	4202	1	17	2567	1	9	t	f	\N	วันทำการ
5760	4203	1	17	2567	1	9	t	f	\N	วันทำการ
5761	4204	1	17	2567	1	9	f	f	\N	วันหยุด
5762	4205	1	17	2567	1	9	f	t	วันเฉลิมฯ ร.10	วันหยุดนักขัตฤกษ์
5763	4206	1	17	2567	1	10	f	t	วันหยุดชดเชยวันเฉลิมพระชนมพรรษา สมเด็จพระเจ้าอยู่หัวมหาวชิราลงกรณ บดินทรเทพยวรางกูร	วันหยุดนักขัตฤกษ์
5764	4207	1	17	2567	1	10	t	f	\N	วันทำการ
5765	4208	1	17	2567	1	10	t	f	\N	วันทำการ
5766	4209	1	17	2567	1	10	t	f	\N	วันทำการ
5767	4210	1	17	2567	1	10	t	f	\N	วันทำการ
5768	4211	1	17	2567	1	10	f	f	\N	วันหยุด
5769	4212	1	17	2567	1	10	f	f	\N	วันหยุด
5770	4213	1	17	2567	1	11	t	f	\N	วันทำการ
5771	4214	1	17	2567	1	11	t	f	\N	วันทำการ
5772	4215	1	17	2567	1	11	t	f	\N	วันทำการ
5773	4216	1	17	2567	1	11	t	f	\N	วันทำการ
5774	4217	1	17	2567	1	11	t	f	\N	วันทำการ
5775	4218	1	17	2567	1	11	f	f	\N	วันหยุด
5776	4219	1	17	2567	1	11	f	f	\N	วันหยุด
5777	4220	1	17	2567	1	12	f	t	วันแม่แห่งชาติ	วันหยุดนักขัตฤกษ์
5778	4221	1	17	2567	1	12	t	f	\N	วันทำการ
5779	4222	1	17	2567	1	12	t	f	\N	วันทำการ
5780	4223	1	17	2567	1	12	t	f	\N	วันทำการ
5781	4224	1	17	2567	1	12	t	f	\N	วันทำการ
5782	4225	1	17	2567	1	12	f	f	\N	วันหยุด
5783	4226	1	17	2567	1	12	f	f	\N	วันหยุด
5784	4227	1	17	2567	1	13	t	f	\N	วันทำการ
5785	4228	1	17	2567	1	13	t	f	\N	วันทำการ
5786	4229	1	17	2567	1	13	t	f	\N	วันทำการ
5787	4230	1	17	2567	1	13	t	f	\N	วันทำการ
5788	4231	1	17	2567	1	13	t	f	\N	วันทำการ
5789	4232	1	17	2567	1	13	f	f	\N	วันหยุด
5790	4233	1	17	2567	1	13	f	f	\N	วันหยุด
5791	4234	1	17	2567	1	14	t	f	\N	วันทำการ
5792	4235	1	17	2567	1	14	t	f	\N	วันทำการ
5793	4236	1	17	2567	1	14	t	f	\N	วันทำการ
5794	4237	1	17	2567	1	14	t	f	\N	วันทำการ
5795	4238	1	17	2567	1	14	t	f	\N	วันทำการ
5796	4239	1	17	2567	1	14	f	f	\N	วันหยุด
5797	4240	1	17	2567	1	14	f	f	\N	วันหยุด
5798	4241	1	17	2567	1	15	t	f	\N	วันทำการ
5799	4242	1	17	2567	1	15	t	f	\N	วันทำการ
5800	4243	1	17	2567	1	15	t	f	\N	วันทำการ
5801	4244	1	17	2567	1	15	t	f	\N	วันทำการ
5802	4245	1	17	2567	1	15	t	f	\N	วันทำการ
5803	4246	1	17	2567	1	15	f	f	\N	วันหยุด
5804	4247	1	17	2567	1	15	f	f	\N	วันหยุด
5805	4248	1	17	2567	1	16	t	f	\N	วันทำการ
5806	4249	1	17	2567	1	16	t	f	\N	วันทำการ
5807	4250	1	17	2567	1	16	t	f	\N	วันทำการ
5808	4251	1	17	2567	1	16	t	f	\N	วันทำการ
5809	4252	1	17	2567	1	16	t	f	\N	วันทำการ
5810	4253	1	17	2567	1	16	f	f	\N	วันหยุด
5811	4254	1	17	2567	1	16	f	f	\N	วันหยุด
5812	4255	1	17	2567	1	17	t	f	\N	วันทำการ
5813	4256	1	17	2567	1	17	t	f	\N	วันทำการ
5814	4257	1	17	2567	1	17	f	t	วันรับปริญญา	วันหยุดนักขัตฤกษ์
5815	4258	1	17	2567	1	17	t	f	\N	วันทำการ
5816	4259	1	17	2567	1	17	t	f	\N	วันทำการ
5817	4260	1	17	2567	1	17	f	f	\N	วันหยุด
5818	4261	1	17	2567	1	17	f	t	วันสงขลานครินทร์	วันหยุดนักขัตฤกษ์
5819	4262	1	17	2567	1	18	f	t	ชดเชยวันสงขลานครินทร์	วันหยุดนักขัตฤกษ์
5820	4263	1	17	2567	1	18	t	f	\N	วันทำการ
5821	4264	1	17	2567	1	18	t	f	\N	วันทำการ
5822	4265	1	17	2567	1	18	t	f	\N	วันทำการ
5823	4266	1	17	2567	1	18	t	f	\N	วันทำการ
5824	4267	1	17	2567	1	18	f	f	\N	วันหยุด
5825	4268	1	17	2567	1	18	f	f	\N	วันหยุด
5826	4269	1	17	2567	1	19	t	f	\N	วันทำการ
5827	4270	1	17	2567	1	19	t	f	\N	วันทำการ
5828	4271	1	17	2567	1	19	t	f	\N	วันทำการ
5829	4272	1	17	2567	1	19	t	f	\N	วันทำการ
5830	4273	1	17	2567	1	19	t	f	\N	วันทำการ
5831	4274	1	17	2567	1	19	f	f	\N	วันหยุด
5832	4275	1	17	2567	1	19	f	f	\N	วันหยุด
5833	4276	1	17	2567	1	20	t	f	\N	วันทำการ
5834	4277	1	17	2567	1	20	t	f	\N	วันทำการ
5835	4278	1	17	2567	1	20	t	f	\N	วันทำการ
5836	4279	1	17	2567	1	20	t	f	\N	วันทำการ
5837	4280	1	17	2567	1	20	t	f	\N	วันทำการ
5838	4281	1	17	2567	1	20	f	f	\N	วันหยุด
5839	4282	1	17	2567	1	20	f	t	วันนวมินทรมหาราช	วันหยุดนักขัตฤกษ์
5840	4283	1	17	2567	1	21	f	t	วันหยุดชดเชยวันคล้ายวันสวรรคตของพระบาทสมเด็จพระปรมินทรมหาภูมิพลอดุลยเดชบรมนาถบพิตร	วันหยุดนักขัตฤกษ์
5841	4284	1	17	2567	1	21	t	f	\N	วันทำการ
5842	4285	1	17	2567	1	21	t	f	\N	วันทำการ
5843	4286	1	17	2567	1	21	t	f	\N	วันทำการ
5844	4287	1	17	2567	1	21	t	f	\N	วันทำการ
5845	4288	1	17	2567	1	21	f	f	\N	วันหยุด
5846	4289	1	17	2567	1	21	f	f	\N	วันหยุด
5847	4290	1	17	2567	1	22	t	f	\N	วันทำการ
5848	4291	1	17	2567	1	22	t	f	\N	วันทำการ
5849	4292	1	17	2567	1	22	f	t	วันปิยมหาราช	วันหยุดนักขัตฤกษ์
5850	4293	1	17	2567	1	22	t	f	\N	วันทำการ
5851	4294	1	17	2567	1	22	t	f	\N	วันทำการ
5852	4295	1	17	2567	1	22	f	f	\N	วันหยุด
5853	4296	1	17	2567	1	22	f	f	\N	วันหยุด
5854	4297	1	17	2567	1	23	t	f	\N	วันทำการ
5855	4298	1	17	2567	1	23	t	f	\N	วันทำการ
5856	4299	1	17	2567	1	23	t	f	\N	วันทำการ
5857	4300	1	17	2567	1	23	t	f	\N	วันทำการ
5858	4301	1	17	2567	1	23	t	f	\N	วันทำการ
5859	4302	1	17	2567	1	23	f	f	\N	วันหยุด
5860	4303	1	17	2567	1	23	f	f	\N	วันหยุด
5861	4304	1	17	2567	1	24	t	f	\N	วันทำการ
5862	4305	1	17	2567	1	24	t	f	\N	วันทำการ
5863	4306	1	17	2567	1	24	t	f	\N	วันทำการ
5864	4307	1	17	2567	1	24	t	f	\N	วันทำการ
5865	4308	1	17	2567	1	24	t	f	\N	วันทำการ
5866	4309	1	17	2567	1	24	f	f	\N	วันหยุด
5867	4310	1	17	2567	1	24	f	f	\N	วันหยุด
5868	4311	1	17	2567	1	25	t	f	\N	วันทำการ
5869	4312	1	17	2567	1	25	t	f	\N	วันทำการ
5870	4313	1	17	2567	1	25	t	f	\N	วันทำการ
5871	4314	1	17	2567	1	25	t	f	\N	วันทำการ
5872	4315	1	17	2567	1	25	t	f	\N	วันทำการ
5873	4316	1	17	2567	1	25	f	f	\N	วันหยุด
5874	4317	1	17	2567	1	25	f	f	\N	วันหยุด
5875	4318	1	17	2567	1	26	t	f	\N	วันทำการ
5876	4319	1	17	2567	1	26	t	f	\N	วันทำการ
5877	4320	1	17	2567	1	26	t	f	\N	วันทำการ
5878	4321	1	17	2567	1	26	t	f	\N	วันทำการ
5879	4322	1	17	2567	1	26	t	f	\N	วันทำการ
5880	4323	1	17	2567	1	26	f	f	\N	วันหยุด
5881	4324	1	17	2567	1	26	f	f	\N	วันหยุด
5882	4325	1	17	2567	1	27	t	f	\N	วันทำการ
5883	4326	1	17	2567	1	27	t	f	\N	วันทำการ
5884	4327	1	17	2567	1	27	t	f	\N	วันทำการ
5885	4328	1	17	2567	1	27	t	f	\N	วันทำการ
5886	4329	1	17	2567	1	27	t	f	\N	วันทำการ
5887	4330	1	17	2567	1	27	f	f	\N	วันหยุด
5888	4331	1	17	2567	1	27	f	f	\N	วันหยุด
5889	4332	1	17	2567	1	28	t	f	\N	วันทำการ
5890	4333	1	17	2567	1	28	t	f	\N	วันทำการ
5891	4334	1	17	2567	1	28	t	f	\N	วันทำการ
5892	4335	1	17	2567	1	28	f	t	วันพ่อแห่งชาติ	วันหยุดนักขัตฤกษ์
5893	4336	1	17	2567	1	28	t	f	\N	วันทำการ
5894	4337	1	17	2567	1	28	f	f	\N	วันหยุด
5895	4338	1	17	2567	1	28	f	f	\N	วันหยุด
5896	4339	1	17	2567	1	29	t	f	\N	วันทำการ
5897	4340	1	17	2567	1	29	f	t	วันรัฐธรรมนูญ	วันหยุดนักขัตฤกษ์
5898	4341	1	17	2567	1	29	t	f	\N	วันทำการ
5899	4342	1	17	2567	1	29	t	f	\N	วันทำการ
5900	4343	1	17	2567	1	29	t	f	\N	วันทำการ
5901	4344	1	17	2567	1	29	f	f	\N	วันหยุด
5902	4345	1	17	2567	1	29	f	f	\N	วันหยุด
5903	4346	1	17	2567	1	30	t	f	\N	วันทำการ
5904	4347	1	17	2567	1	30	t	f	\N	วันทำการ
5905	4348	1	17	2567	1	30	t	f	\N	วันทำการ
5906	4349	1	17	2567	1	30	t	f	\N	วันทำการ
5907	4350	1	17	2567	1	30	t	f	\N	วันทำการ
5908	4351	1	17	2567	1	30	f	f	\N	วันหยุด
5909	4352	1	17	2567	1	30	f	f	\N	วันหยุด
5910	4353	1	17	2567	1	31	t	f	\N	วันทำการ
5911	4354	1	17	2567	1	31	f	t	วันคริสต์มาสอีฟ	วันหยุดนักขัตฤกษ์
5912	4355	1	17	2567	1	31	f	t	วันคริสต์มาส	วันหยุดนักขัตฤกษ์
5913	4356	1	17	2567	1	31	t	f	\N	วันทำการ
5914	4357	1	17	2567	1	31	t	f	\N	วันทำการ
5915	4358	1	17	2567	1	31	f	f	\N	วันหยุด
5916	4359	1	17	2567	1	31	f	f	\N	วันหยุด
5917	4360	1	17	2567	1	32	f	t	วันหยุดราชการธันวาคม	วันหยุดนักขัตฤกษ์
5918	4361	1	17	2567	1	32	f	t	วันสิ้นปี	วันหยุดนักขัตฤกษ์
5919	4362	1	17	2567	1	32	f	t	วันขึ้นปีใหม่	วันหยุดนักขัตฤกษ์
5920	4363	1	17	2567	1	32	f	t	วันหยุดพิเศษ (ครม.)	วันหยุดนักขัตฤกษ์
5921	4364	1	17	2567	1	32	t	f	\N	วันทำการ
5922	4365	1	17	2567	1	32	f	f	\N	วันหยุด
5923	4366	1	17	2567	1	32	f	f	\N	วันหยุด
5924	4367	1	17	2567	1	33	t	f	\N	วันทำการ
5925	4368	1	17	2567	1	33	t	f	\N	วันทำการ
5926	4369	1	17	2567	1	33	t	f	\N	วันทำการ
5927	4370	1	17	2567	1	33	t	f	\N	วันทำการ
5928	4371	1	17	2567	1	33	t	f	\N	วันทำการ
5929	4372	1	17	2567	1	33	f	f	\N	วันหยุด
5930	4373	1	17	2567	1	33	f	f	\N	วันหยุด
5931	4374	1	17	2567	1	34	t	f	\N	วันทำการ
5932	4375	1	17	2567	1	34	t	f	\N	วันทำการ
5933	4376	1	17	2567	1	34	t	f	\N	วันทำการ
5934	4377	1	17	2567	1	34	t	f	\N	วันทำการ
5935	4378	1	17	2567	1	34	t	f	\N	วันทำการ
5936	4379	1	17	2567	1	34	f	f	\N	วันหยุด
5937	4380	1	17	2567	1	34	f	f	\N	วันหยุด
5938	4381	1	17	2567	1	35	t	f	\N	วันทำการ
5939	4382	1	17	2567	1	35	t	f	\N	วันทำการ
5940	4383	1	17	2567	1	35	t	f	\N	วันทำการ
5941	4384	1	17	2567	1	35	t	f	\N	วันทำการ
5942	4385	1	17	2567	1	35	t	f	\N	วันทำการ
5943	4386	1	17	2567	1	35	f	f	\N	วันหยุด
5944	4387	1	17	2567	1	35	f	f	\N	วันหยุด
5945	4388	1	17	2567	1	36	t	f	\N	วันทำการ
5946	4389	1	17	2567	1	36	t	f	\N	วันทำการ
5947	4390	1	17	2567	1	36	f	t	วันตรุษจีน	วันหยุดนักขัตฤกษ์
5948	4391	1	17	2567	1	36	f	t	วันตรุษจีน (วันที่ 2)	วันหยุดนักขัตฤกษ์
5949	4392	1	17	2567	1	36	f	t	วันตรุษจีน (วันที่ 3)	วันหยุดนักขัตฤกษ์
5950	4393	1	17	2567	1	36	f	f	\N	วันหยุด
5951	4394	1	17	2567	1	36	f	f	\N	วันหยุด
5952	4395	1	17	2567	1	37	t	f	\N	วันทำการ
5953	4396	1	17	2567	1	37	t	f	\N	วันทำการ
5954	4397	1	17	2567	1	37	t	f	\N	วันทำการ
5955	4398	1	17	2567	1	37	t	f	\N	วันทำการ
5956	4399	1	17	2567	1	37	t	f	\N	วันทำการ
5957	4400	1	17	2567	1	37	f	f	\N	วันหยุด
5958	4401	1	17	2567	1	37	f	f	\N	วันหยุด
5959	4402	1	17	2567	1	38	t	f	\N	วันทำการ
5960	4403	1	17	2567	1	38	t	f	\N	วันทำการ
5961	4404	1	17	2567	1	38	f	t	วันมาฆบูชา	วันหยุดนักขัตฤกษ์
5962	4405	1	17	2567	1	38	t	f	\N	วันทำการ
5963	4406	1	17	2567	1	38	f	t	วันวาเลนไทน์	วันหยุดนักขัตฤกษ์
5964	4407	1	17	2567	1	38	f	f	\N	วันหยุด
5965	4408	1	17	2567	1	38	f	f	\N	วันหยุด
5966	4409	1	17	2567	1	39	t	f	\N	วันทำการ
5967	4410	1	17	2567	1	39	t	f	\N	วันทำการ
5968	4411	1	17	2567	1	39	t	f	\N	วันทำการ
5969	4412	1	17	2567	1	39	t	f	\N	วันทำการ
5970	4413	1	17	2567	1	39	t	f	\N	วันทำการ
5971	4414	1	17	2567	1	39	f	f	\N	วันหยุด
5972	4415	1	17	2567	1	39	f	f	\N	วันหยุด
5973	4416	1	17	2567	1	40	t	f	\N	วันทำการ
5974	4417	1	17	2567	1	40	t	f	\N	วันทำการ
5975	4418	1	17	2567	1	40	t	f	\N	วันทำการ
5976	4419	1	17	2567	1	40	t	f	\N	วันทำการ
5977	4420	1	17	2567	1	40	t	f	\N	วันทำการ
5978	4421	1	17	2567	1	40	f	f	\N	วันหยุด
5979	4422	1	17	2567	1	40	f	f	\N	วันหยุด
5980	4423	1	17	2567	1	41	t	f	\N	วันทำการ
5981	4424	1	17	2567	1	41	t	f	\N	วันทำการ
5982	4425	1	17	2567	1	41	t	f	\N	วันทำการ
5983	4426	1	17	2567	1	41	t	f	\N	วันทำการ
5984	4427	1	17	2567	1	41	t	f	\N	วันทำการ
5985	4428	1	17	2567	1	41	f	f	\N	วันหยุด
5986	4429	1	17	2567	1	41	f	f	\N	วันหยุด
5987	4430	1	17	2567	1	42	t	f	\N	วันทำการ
5988	4431	1	17	2567	1	42	t	f	\N	วันทำการ
5989	4432	1	17	2567	1	42	t	f	\N	วันทำการ
5990	4433	1	17	2567	1	42	t	f	\N	วันทำการ
5991	4434	1	17	2567	1	42	t	f	\N	วันทำการ
5992	4435	1	17	2567	1	42	f	f	\N	วันหยุด
5993	4436	1	17	2567	1	42	f	f	\N	วันหยุด
5994	4437	1	17	2567	1	43	t	f	\N	วันทำการ
5995	4438	1	17	2567	1	43	t	f	\N	วันทำการ
5996	4439	1	17	2567	1	43	t	f	\N	วันทำการ
5997	4440	1	17	2567	1	43	t	f	\N	วันทำการ
5998	4441	1	17	2567	1	43	t	f	\N	วันทำการ
5999	4442	1	17	2567	1	43	f	f	\N	วันหยุด
6000	4443	1	17	2567	1	43	f	f	\N	วันหยุด
6001	4444	1	17	2567	1	44	t	f	\N	วันทำการ
6002	4445	1	17	2567	1	44	t	f	\N	วันทำการ
6003	4446	1	17	2567	1	44	t	f	\N	วันทำการ
6004	4447	1	17	2567	1	44	t	f	\N	วันทำการ
6005	4448	1	17	2567	1	44	t	f	\N	วันทำการ
6006	4449	1	17	2567	1	44	f	f	\N	วันหยุด
6007	4450	1	17	2567	1	44	f	f	\N	วันหยุด
6008	4451	1	17	2567	1	45	f	t	วันรายออีดี้ลฟิตรี	วันหยุดนักขัตฤกษ์
6009	4452	1	17	2567	1	45	t	f	\N	วันทำการ
6010	4453	1	17	2567	1	45	t	f	\N	วันทำการ
6011	4454	1	17	2567	1	45	t	f	\N	วันทำการ
6012	4455	1	17	2567	1	45	t	f	\N	วันทำการ
6013	4456	1	17	2567	1	45	f	f	\N	วันหยุด
6014	4457	1	17	2567	1	45	f	t	วันจักรี	วันหยุดนักขัตฤกษ์
6015	4458	1	17	2567	1	46	f	t	ชดเชยวันจักรี	วันหยุดนักขัตฤกษ์
6016	4459	1	17	2567	1	46	t	f	\N	วันทำการ
6017	4460	1	17	2567	1	46	t	f	\N	วันทำการ
6018	4461	1	17	2567	1	46	t	f	\N	วันทำการ
6019	4462	1	17	2567	1	46	t	f	\N	วันทำการ
6020	4463	1	17	2567	1	46	f	f	\N	วันหยุด
6021	4464	1	17	2567	1	46	f	t	วันสงกรานต์	วันหยุดนักขัตฤกษ์
6022	4465	1	17	2567	1	47	f	t	วันสงกรานต์	วันหยุดนักขัตฤกษ์
6023	4466	1	17	2567	1	47	f	t	วันสงกรานต์	วันหยุดนักขัตฤกษ์
6024	4467	1	17	2567	1	47	f	t	วันหยุดชดเชยวันสงกรานต์	วันหยุดนักขัตฤกษ์
6025	4468	1	17	2567	1	47	t	f	\N	วันทำการ
6026	4469	1	17	2567	1	47	t	f	\N	วันทำการ
6027	4470	1	17	2567	1	47	f	f	\N	วันหยุด
6028	4471	1	17	2567	1	47	f	f	\N	วันหยุด
6029	4472	1	17	2567	1	48	t	f	\N	วันทำการ
6030	4473	1	17	2567	1	48	t	f	\N	วันทำการ
6031	4474	1	17	2567	1	48	t	f	\N	วันทำการ
6032	4475	1	17	2567	1	48	t	f	\N	วันทำการ
6033	4476	1	17	2567	1	48	t	f	\N	วันทำการ
6034	4477	1	17	2567	1	48	f	f	\N	วันหยุด
6035	4478	1	17	2567	1	48	f	f	\N	วันหยุด
6036	4479	1	17	2567	1	49	t	f	\N	วันทำการ
6037	4480	1	17	2567	1	49	t	f	\N	วันทำการ
6038	4481	1	17	2567	1	49	t	f	\N	วันทำการ
6039	1100	1	18	2567	1	1	t	f	\N	วันทำการ
6040	1101	1	18	2567	1	1	t	f	\N	วันทำการ
6041	1102	1	18	2567	1	1	t	f	\N	วันทำการ
6042	1103	1	18	2567	1	1	t	f	\N	วันทำการ
6043	1104	1	18	2567	1	1	t	f	\N	วันทำการ
6044	1105	1	18	2567	1	1	f	f	\N	วันหยุด
6045	1106	1	18	2567	1	1	f	f	\N	วันหยุด
6046	1107	1	18	2567	1	2	f	t	วันเฉลิมฯ พระราชินี	วันหยุดนักขัตฤกษ์
6047	1108	1	18	2567	1	2	t	f	\N	วันทำการ
6048	1109	1	18	2567	1	2	t	f	\N	วันทำการ
6049	1110	1	18	2567	1	2	t	f	\N	วันทำการ
6050	1111	1	18	2567	1	2	t	f	\N	วันทำการ
6051	1112	1	18	2567	1	2	f	f	\N	วันหยุด
6052	4805	1	18	2567	1	2	f	f	\N	วันหยุด
6053	4806	1	18	2567	1	3	t	f	\N	วันทำการ
6054	4807	1	18	2567	1	3	t	f	\N	วันทำการ
6055	4808	1	18	2567	1	3	t	f	\N	วันทำการ
6056	4809	1	18	2567	1	3	t	f	\N	วันทำการ
6057	4810	1	18	2567	1	3	t	f	\N	วันทำการ
6058	4811	1	18	2567	1	3	f	f	\N	วันหยุด
6059	4812	1	18	2567	1	3	f	f	\N	วันหยุด
6060	4813	1	18	2567	1	4	t	f	\N	วันทำการ
6061	4814	1	18	2567	1	4	t	f	\N	วันทำการ
6062	4815	1	18	2567	1	4	t	f	\N	วันทำการ
6063	4816	1	18	2567	1	4	t	f	\N	วันทำการ
6064	4817	1	18	2567	1	4	t	f	\N	วันทำการ
6065	4818	1	18	2567	1	4	f	t	วันอาสาฬหบูชา	วันหยุดนักขัตฤกษ์
6066	4819	1	18	2567	1	4	f	t	วันเข้าพรรษา	วันหยุดนักขัตฤกษ์
6067	4171	1	18	2567	1	5	t	f	\N	วันทำการ
6068	4172	1	18	2567	1	5	t	f	\N	วันทำการ
6069	4173	1	18	2567	1	5	t	f	\N	วันทำการ
6070	4174	1	18	2567	1	5	t	f	\N	วันทำการ
6071	4175	1	18	2567	1	5	t	f	\N	วันทำการ
6072	4176	1	18	2567	1	5	f	f	\N	วันหยุด
6073	4177	1	18	2567	1	5	f	f	\N	วันหยุด
6074	4178	1	18	2567	1	6	t	f	\N	วันทำการ
6075	4179	1	18	2567	1	6	t	f	\N	วันทำการ
6076	4180	1	18	2567	1	6	t	f	\N	วันทำการ
6077	4181	1	18	2567	1	6	t	f	\N	วันทำการ
6078	4182	1	18	2567	1	6	t	f	\N	วันทำการ
6079	4183	1	18	2567	1	6	f	f	\N	วันหยุด
6080	4184	1	18	2567	1	6	f	f	\N	วันหยุด
6081	4185	1	18	2567	1	7	t	f	\N	วันทำการ
6082	4186	1	18	2567	1	7	t	f	\N	วันทำการ
6083	4187	1	18	2567	1	7	t	f	\N	วันทำการ
6084	4188	1	18	2567	1	7	t	f	\N	วันทำการ
6085	4189	1	18	2567	1	7	t	f	\N	วันทำการ
6086	4190	1	18	2567	1	7	f	f	\N	วันหยุด
6087	4191	1	18	2567	1	7	f	f	\N	วันหยุด
6088	4192	1	18	2567	1	8	t	f	\N	วันทำการ
6089	4193	1	18	2567	1	8	t	f	\N	วันทำการ
6090	4194	1	18	2567	1	8	t	f	\N	วันทำการ
6091	4195	1	18	2567	1	8	t	f	\N	วันทำการ
6092	4196	1	18	2567	1	8	t	f	\N	วันทำการ
6093	4197	1	18	2567	1	8	f	t	วันอาสาฬหบูชา	วันหยุดนักขัตฤกษ์
6094	4198	1	18	2567	1	8	f	f	\N	วันหยุด
6169	4273	1	18	2567	1	19	t	f	\N	วันทำการ
6095	4199	1	18	2567	1	9	f	t	วันหยุดชดเชยวันอาสาฬหบูชา	วันหยุดนักขัตฤกษ์
6096	4200	1	18	2567	1	9	t	f	\N	วันทำการ
6097	4201	1	18	2567	1	9	t	f	\N	วันทำการ
6098	4202	1	18	2567	1	9	t	f	\N	วันทำการ
6099	4203	1	18	2567	1	9	t	f	\N	วันทำการ
6100	4204	1	18	2567	1	9	f	f	\N	วันหยุด
6101	4205	1	18	2567	1	9	f	t	วันเฉลิมฯ ร.10	วันหยุดนักขัตฤกษ์
6102	4206	1	18	2567	1	10	f	t	วันหยุดชดเชยวันเฉลิมพระชนมพรรษา สมเด็จพระเจ้าอยู่หัวมหาวชิราลงกรณ บดินทรเทพยวรางกูร	วันหยุดนักขัตฤกษ์
6103	4207	1	18	2567	1	10	t	f	\N	วันทำการ
6104	4208	1	18	2567	1	10	t	f	\N	วันทำการ
6105	4209	1	18	2567	1	10	t	f	\N	วันทำการ
6106	4210	1	18	2567	1	10	t	f	\N	วันทำการ
6107	4211	1	18	2567	1	10	f	f	\N	วันหยุด
6108	4212	1	18	2567	1	10	f	f	\N	วันหยุด
6109	4213	1	18	2567	1	11	t	f	\N	วันทำการ
6110	4214	1	18	2567	1	11	t	f	\N	วันทำการ
6111	4215	1	18	2567	1	11	t	f	\N	วันทำการ
6112	4216	1	18	2567	1	11	t	f	\N	วันทำการ
6113	4217	1	18	2567	1	11	t	f	\N	วันทำการ
6114	4218	1	18	2567	1	11	f	f	\N	วันหยุด
6115	4219	1	18	2567	1	11	f	f	\N	วันหยุด
6116	4220	1	18	2567	1	12	f	t	วันแม่แห่งชาติ	วันหยุดนักขัตฤกษ์
6117	4221	1	18	2567	1	12	t	f	\N	วันทำการ
6118	4222	1	18	2567	1	12	t	f	\N	วันทำการ
6119	4223	1	18	2567	1	12	t	f	\N	วันทำการ
6120	4224	1	18	2567	1	12	t	f	\N	วันทำการ
6121	4225	1	18	2567	1	12	f	f	\N	วันหยุด
6122	4226	1	18	2567	1	12	f	f	\N	วันหยุด
6123	4227	1	18	2567	1	13	t	f	\N	วันทำการ
6124	4228	1	18	2567	1	13	t	f	\N	วันทำการ
6125	4229	1	18	2567	1	13	t	f	\N	วันทำการ
6126	4230	1	18	2567	1	13	t	f	\N	วันทำการ
6127	4231	1	18	2567	1	13	t	f	\N	วันทำการ
6128	4232	1	18	2567	1	13	f	f	\N	วันหยุด
6129	4233	1	18	2567	1	13	f	f	\N	วันหยุด
6130	4234	1	18	2567	1	14	t	f	\N	วันทำการ
6131	4235	1	18	2567	1	14	t	f	\N	วันทำการ
6132	4236	1	18	2567	1	14	t	f	\N	วันทำการ
6133	4237	1	18	2567	1	14	t	f	\N	วันทำการ
6134	4238	1	18	2567	1	14	t	f	\N	วันทำการ
6135	4239	1	18	2567	1	14	f	f	\N	วันหยุด
6136	4240	1	18	2567	1	14	f	f	\N	วันหยุด
6137	4241	1	18	2567	1	15	t	f	\N	วันทำการ
6138	4242	1	18	2567	1	15	t	f	\N	วันทำการ
6139	4243	1	18	2567	1	15	t	f	\N	วันทำการ
6140	4244	1	18	2567	1	15	t	f	\N	วันทำการ
6141	4245	1	18	2567	1	15	t	f	\N	วันทำการ
6142	4246	1	18	2567	1	15	f	f	\N	วันหยุด
6143	4247	1	18	2567	1	15	f	f	\N	วันหยุด
6144	4248	1	18	2567	1	16	t	f	\N	วันทำการ
6145	4249	1	18	2567	1	16	t	f	\N	วันทำการ
6146	4250	1	18	2567	1	16	t	f	\N	วันทำการ
6147	4251	1	18	2567	1	16	t	f	\N	วันทำการ
6148	4252	1	18	2567	1	16	t	f	\N	วันทำการ
6149	4253	1	18	2567	1	16	f	f	\N	วันหยุด
6150	4254	1	18	2567	1	16	f	f	\N	วันหยุด
6151	4255	1	18	2567	1	17	t	f	\N	วันทำการ
6152	4256	1	18	2567	1	17	t	f	\N	วันทำการ
6153	4257	1	18	2567	1	17	f	t	วันรับปริญญา	วันหยุดนักขัตฤกษ์
6154	4258	1	18	2567	1	17	t	f	\N	วันทำการ
6155	4259	1	18	2567	1	17	t	f	\N	วันทำการ
6156	4260	1	18	2567	1	17	f	f	\N	วันหยุด
6157	4261	1	18	2567	1	17	f	t	วันสงขลานครินทร์	วันหยุดนักขัตฤกษ์
6158	4262	1	18	2567	1	18	f	t	ชดเชยวันสงขลานครินทร์	วันหยุดนักขัตฤกษ์
6159	4263	1	18	2567	1	18	t	f	\N	วันทำการ
6160	4264	1	18	2567	1	18	t	f	\N	วันทำการ
6161	4265	1	18	2567	1	18	t	f	\N	วันทำการ
6162	4266	1	18	2567	1	18	t	f	\N	วันทำการ
6163	4267	1	18	2567	1	18	f	f	\N	วันหยุด
6164	4268	1	18	2567	1	18	f	f	\N	วันหยุด
6165	4269	1	18	2567	1	19	t	f	\N	วันทำการ
6166	4270	1	18	2567	1	19	t	f	\N	วันทำการ
6167	4271	1	18	2567	1	19	t	f	\N	วันทำการ
6168	4272	1	18	2567	1	19	t	f	\N	วันทำการ
6170	4274	1	18	2567	1	19	f	f	\N	วันหยุด
6171	4275	1	18	2567	1	19	f	f	\N	วันหยุด
6172	4276	1	18	2567	1	20	t	f	\N	วันทำการ
6173	4277	1	18	2567	1	20	t	f	\N	วันทำการ
6174	4278	1	18	2567	1	20	t	f	\N	วันทำการ
6175	4279	1	18	2567	1	20	t	f	\N	วันทำการ
6176	4280	1	18	2567	1	20	t	f	\N	วันทำการ
6177	4281	1	18	2567	1	20	f	f	\N	วันหยุด
6178	4282	1	18	2567	1	20	f	t	วันนวมินทรมหาราช	วันหยุดนักขัตฤกษ์
6179	4283	1	18	2567	1	21	f	t	วันหยุดชดเชยวันคล้ายวันสวรรคตของพระบาทสมเด็จพระปรมินทรมหาภูมิพลอดุลยเดชบรมนาถบพิตร	วันหยุดนักขัตฤกษ์
6180	4284	1	18	2567	1	21	t	f	\N	วันทำการ
6181	4285	1	18	2567	1	21	t	f	\N	วันทำการ
6182	4286	1	18	2567	1	21	t	f	\N	วันทำการ
6183	4287	1	18	2567	1	21	t	f	\N	วันทำการ
6184	4288	1	18	2567	1	21	f	f	\N	วันหยุด
6185	4289	1	18	2567	1	21	f	f	\N	วันหยุด
6186	4290	1	18	2567	1	22	t	f	\N	วันทำการ
6187	4291	1	18	2567	1	22	t	f	\N	วันทำการ
6188	4292	1	18	2567	1	22	f	t	วันปิยมหาราช	วันหยุดนักขัตฤกษ์
6189	4293	1	18	2567	1	22	t	f	\N	วันทำการ
6190	4294	1	18	2567	1	22	t	f	\N	วันทำการ
6191	4295	1	18	2567	1	22	f	f	\N	วันหยุด
6192	4296	1	18	2567	1	22	f	f	\N	วันหยุด
6193	4297	1	18	2567	1	23	t	f	\N	วันทำการ
6194	4298	1	18	2567	1	23	t	f	\N	วันทำการ
6195	4299	1	18	2567	1	23	t	f	\N	วันทำการ
6196	4300	1	18	2567	1	23	t	f	\N	วันทำการ
6197	4301	1	18	2567	1	23	t	f	\N	วันทำการ
6198	4302	1	18	2567	1	23	f	f	\N	วันหยุด
6199	4303	1	18	2567	1	23	f	f	\N	วันหยุด
6200	4304	1	18	2567	1	24	t	f	\N	วันทำการ
6201	4305	1	18	2567	1	24	t	f	\N	วันทำการ
6202	4306	1	18	2567	1	24	t	f	\N	วันทำการ
6203	4307	1	18	2567	1	24	t	f	\N	วันทำการ
6204	4308	1	18	2567	1	24	t	f	\N	วันทำการ
6205	4309	1	18	2567	1	24	f	f	\N	วันหยุด
6206	4310	1	18	2567	1	24	f	f	\N	วันหยุด
6207	4311	1	18	2567	1	25	t	f	\N	วันทำการ
6208	4312	1	18	2567	1	25	t	f	\N	วันทำการ
6209	4313	1	18	2567	1	25	t	f	\N	วันทำการ
6210	4314	1	18	2567	1	25	t	f	\N	วันทำการ
6211	4315	1	18	2567	1	25	t	f	\N	วันทำการ
6212	4316	1	18	2567	1	25	f	f	\N	วันหยุด
6213	4317	1	18	2567	1	25	f	f	\N	วันหยุด
6214	4318	1	18	2567	1	26	t	f	\N	วันทำการ
6215	4319	1	18	2567	1	26	t	f	\N	วันทำการ
6216	4320	1	18	2567	1	26	t	f	\N	วันทำการ
6217	4321	1	18	2567	1	26	t	f	\N	วันทำการ
6218	4322	1	18	2567	1	26	t	f	\N	วันทำการ
6219	4323	1	18	2567	1	26	f	f	\N	วันหยุด
6220	4324	1	18	2567	1	26	f	f	\N	วันหยุด
6221	4325	1	18	2567	1	27	t	f	\N	วันทำการ
6222	4326	1	18	2567	1	27	t	f	\N	วันทำการ
6223	4327	1	18	2567	1	27	t	f	\N	วันทำการ
6224	4328	1	18	2567	1	27	t	f	\N	วันทำการ
6225	4329	1	18	2567	1	27	t	f	\N	วันทำการ
6226	4330	1	18	2567	1	27	f	f	\N	วันหยุด
6227	4331	1	18	2567	1	27	f	f	\N	วันหยุด
6228	4332	1	18	2567	1	28	t	f	\N	วันทำการ
6229	4333	1	18	2567	1	28	t	f	\N	วันทำการ
6230	4334	1	18	2567	1	28	t	f	\N	วันทำการ
6231	4335	1	18	2567	1	28	f	t	วันพ่อแห่งชาติ	วันหยุดนักขัตฤกษ์
6232	4336	1	18	2567	1	28	t	f	\N	วันทำการ
6233	4337	1	18	2567	1	28	f	f	\N	วันหยุด
6234	4338	1	18	2567	1	28	f	f	\N	วันหยุด
6235	4339	1	18	2567	1	29	t	f	\N	วันทำการ
6236	4340	1	18	2567	1	29	f	t	วันรัฐธรรมนูญ	วันหยุดนักขัตฤกษ์
6237	4341	1	18	2567	1	29	t	f	\N	วันทำการ
6238	4342	1	18	2567	1	29	t	f	\N	วันทำการ
6239	4343	1	18	2567	1	29	t	f	\N	วันทำการ
6240	4344	1	18	2567	1	29	f	f	\N	วันหยุด
6241	4345	1	18	2567	1	29	f	f	\N	วันหยุด
6242	4346	1	18	2567	1	30	t	f	\N	วันทำการ
6243	4347	1	18	2567	1	30	t	f	\N	วันทำการ
6244	4348	1	18	2567	1	30	t	f	\N	วันทำการ
6245	4349	1	18	2567	1	30	t	f	\N	วันทำการ
6246	4350	1	18	2567	1	30	t	f	\N	วันทำการ
6247	4351	1	18	2567	1	30	f	f	\N	วันหยุด
6248	4352	1	18	2567	1	30	f	f	\N	วันหยุด
6249	4353	1	18	2567	1	31	t	f	\N	วันทำการ
6250	4354	1	18	2567	1	31	f	t	วันคริสต์มาสอีฟ	วันหยุดนักขัตฤกษ์
6251	4355	1	18	2567	1	31	f	t	วันคริสต์มาส	วันหยุดนักขัตฤกษ์
6252	4356	1	18	2567	1	31	t	f	\N	วันทำการ
6253	4357	1	18	2567	1	31	t	f	\N	วันทำการ
6254	4358	1	18	2567	1	31	f	f	\N	วันหยุด
6255	4359	1	18	2567	1	31	f	f	\N	วันหยุด
6256	4360	1	18	2567	1	32	f	t	วันหยุดราชการธันวาคม	วันหยุดนักขัตฤกษ์
6257	4361	1	18	2567	1	32	f	t	วันสิ้นปี	วันหยุดนักขัตฤกษ์
6258	4362	1	18	2567	1	32	f	t	วันขึ้นปีใหม่	วันหยุดนักขัตฤกษ์
6259	4363	1	18	2567	1	32	f	t	วันหยุดพิเศษ (ครม.)	วันหยุดนักขัตฤกษ์
6260	4364	1	18	2567	1	32	t	f	\N	วันทำการ
6261	4365	1	18	2567	1	32	f	f	\N	วันหยุด
6262	4366	1	18	2567	1	32	f	f	\N	วันหยุด
6263	4367	1	18	2567	1	33	t	f	\N	วันทำการ
6264	4368	1	18	2567	1	33	t	f	\N	วันทำการ
6265	4369	1	18	2567	1	33	t	f	\N	วันทำการ
6266	4370	1	18	2567	1	33	t	f	\N	วันทำการ
6267	4371	1	18	2567	1	33	t	f	\N	วันทำการ
6268	4372	1	18	2567	1	33	f	f	\N	วันหยุด
6269	4373	1	18	2567	1	33	f	f	\N	วันหยุด
6270	4374	1	18	2567	1	34	t	f	\N	วันทำการ
6271	4375	1	18	2567	1	34	t	f	\N	วันทำการ
6272	4376	1	18	2567	1	34	t	f	\N	วันทำการ
6273	4377	1	18	2567	1	34	t	f	\N	วันทำการ
6274	4378	1	18	2567	1	34	t	f	\N	วันทำการ
6275	4379	1	18	2567	1	34	f	f	\N	วันหยุด
6276	4380	1	18	2567	1	34	f	f	\N	วันหยุด
6277	4381	1	18	2567	1	35	t	f	\N	วันทำการ
6278	4382	1	18	2567	1	35	t	f	\N	วันทำการ
6279	4383	1	18	2567	1	35	t	f	\N	วันทำการ
6280	4384	1	18	2567	1	35	t	f	\N	วันทำการ
6281	4385	1	18	2567	1	35	t	f	\N	วันทำการ
6282	4386	1	18	2567	1	35	f	f	\N	วันหยุด
6283	4387	1	18	2567	1	35	f	f	\N	วันหยุด
6284	4388	1	18	2567	1	36	t	f	\N	วันทำการ
6285	4389	1	18	2567	1	36	t	f	\N	วันทำการ
6286	4390	1	18	2567	1	36	f	t	วันตรุษจีน	วันหยุดนักขัตฤกษ์
6287	4391	1	18	2567	1	36	f	t	วันตรุษจีน (วันที่ 2)	วันหยุดนักขัตฤกษ์
6288	4392	1	18	2567	1	36	f	t	วันตรุษจีน (วันที่ 3)	วันหยุดนักขัตฤกษ์
6289	4393	1	18	2567	1	36	f	f	\N	วันหยุด
6290	4394	1	18	2567	1	36	f	f	\N	วันหยุด
6291	4395	1	18	2567	1	37	t	f	\N	วันทำการ
6292	4396	1	18	2567	1	37	t	f	\N	วันทำการ
6293	4397	1	18	2567	1	37	t	f	\N	วันทำการ
6294	4398	1	18	2567	1	37	t	f	\N	วันทำการ
6295	4399	1	18	2567	1	37	t	f	\N	วันทำการ
6296	4400	1	18	2567	1	37	f	f	\N	วันหยุด
6297	4401	1	18	2567	1	37	f	f	\N	วันหยุด
6298	4402	1	18	2567	1	38	t	f	\N	วันทำการ
6299	4403	1	18	2567	1	38	t	f	\N	วันทำการ
6300	4404	1	18	2567	1	38	f	t	วันมาฆบูชา	วันหยุดนักขัตฤกษ์
6301	4405	1	18	2567	1	38	t	f	\N	วันทำการ
6302	4406	1	18	2567	1	38	f	t	วันวาเลนไทน์	วันหยุดนักขัตฤกษ์
6303	4407	1	18	2567	1	38	f	f	\N	วันหยุด
6304	4408	1	18	2567	1	38	f	f	\N	วันหยุด
6305	4409	1	18	2567	1	39	t	f	\N	วันทำการ
6306	4410	1	18	2567	1	39	t	f	\N	วันทำการ
6307	4411	1	18	2567	1	39	t	f	\N	วันทำการ
6308	4412	1	18	2567	1	39	t	f	\N	วันทำการ
6309	4413	1	18	2567	1	39	t	f	\N	วันทำการ
6310	4414	1	18	2567	1	39	f	f	\N	วันหยุด
6311	4415	1	18	2567	1	39	f	f	\N	วันหยุด
6312	4416	1	18	2567	1	40	t	f	\N	วันทำการ
6313	4417	1	18	2567	1	40	t	f	\N	วันทำการ
6314	4418	1	18	2567	1	40	t	f	\N	วันทำการ
6315	4419	1	18	2567	1	40	t	f	\N	วันทำการ
6316	4420	1	18	2567	1	40	t	f	\N	วันทำการ
6317	4421	1	18	2567	1	40	f	f	\N	วันหยุด
6318	4422	1	18	2567	1	40	f	f	\N	วันหยุด
6319	4423	1	18	2567	1	41	t	f	\N	วันทำการ
6320	4424	1	18	2567	1	41	t	f	\N	วันทำการ
6321	4425	1	18	2567	1	41	t	f	\N	วันทำการ
6322	4426	1	18	2567	1	41	t	f	\N	วันทำการ
6323	4427	1	18	2567	1	41	t	f	\N	วันทำการ
6324	4428	1	18	2567	1	41	f	f	\N	วันหยุด
6325	4429	1	18	2567	1	41	f	f	\N	วันหยุด
6326	4430	1	18	2567	1	42	t	f	\N	วันทำการ
6327	4431	1	18	2567	1	42	t	f	\N	วันทำการ
6328	4432	1	18	2567	1	42	t	f	\N	วันทำการ
6329	4433	1	18	2567	1	42	t	f	\N	วันทำการ
6330	4434	1	18	2567	1	42	t	f	\N	วันทำการ
6331	4435	1	18	2567	1	42	f	f	\N	วันหยุด
6332	4436	1	18	2567	1	42	f	f	\N	วันหยุด
6333	4437	1	18	2567	1	43	t	f	\N	วันทำการ
6334	4438	1	18	2567	1	43	t	f	\N	วันทำการ
6335	4439	1	18	2567	1	43	t	f	\N	วันทำการ
6336	4440	1	18	2567	1	43	t	f	\N	วันทำการ
6337	4441	1	18	2567	1	43	t	f	\N	วันทำการ
6338	4442	1	18	2567	1	43	f	f	\N	วันหยุด
6339	4443	1	18	2567	1	43	f	f	\N	วันหยุด
6340	4444	1	18	2567	1	44	t	f	\N	วันทำการ
6341	4445	1	18	2567	1	44	t	f	\N	วันทำการ
6342	4446	1	18	2567	1	44	t	f	\N	วันทำการ
6343	4447	1	18	2567	1	44	t	f	\N	วันทำการ
6344	4448	1	18	2567	1	44	t	f	\N	วันทำการ
6345	4449	1	18	2567	1	44	f	f	\N	วันหยุด
6346	4450	1	18	2567	1	44	f	f	\N	วันหยุด
6347	4451	1	18	2567	1	45	f	t	วันรายออีดี้ลฟิตรี	วันหยุดนักขัตฤกษ์
6348	4452	1	18	2567	1	45	t	f	\N	วันทำการ
6349	4453	1	18	2567	1	45	t	f	\N	วันทำการ
6350	4454	1	18	2567	1	45	t	f	\N	วันทำการ
6351	4455	1	18	2567	1	45	t	f	\N	วันทำการ
6352	4456	1	18	2567	1	45	f	f	\N	วันหยุด
6353	4457	1	18	2567	1	45	f	t	วันจักรี	วันหยุดนักขัตฤกษ์
6354	4458	1	18	2567	1	46	f	t	ชดเชยวันจักรี	วันหยุดนักขัตฤกษ์
6355	4459	1	18	2567	1	46	t	f	\N	วันทำการ
6356	4460	1	18	2567	1	46	t	f	\N	วันทำการ
6357	4461	1	18	2567	1	46	t	f	\N	วันทำการ
6358	4462	1	18	2567	1	46	t	f	\N	วันทำการ
6359	4463	1	18	2567	1	46	f	f	\N	วันหยุด
6360	4464	1	18	2567	1	46	f	t	วันสงกรานต์	วันหยุดนักขัตฤกษ์
6361	4465	1	18	2567	1	47	f	t	วันสงกรานต์	วันหยุดนักขัตฤกษ์
6362	4466	1	18	2567	1	47	f	t	วันสงกรานต์	วันหยุดนักขัตฤกษ์
6363	4467	1	18	2567	1	47	f	t	วันหยุดชดเชยวันสงกรานต์	วันหยุดนักขัตฤกษ์
6364	4468	1	18	2567	1	47	t	f	\N	วันทำการ
6365	4469	1	18	2567	1	47	t	f	\N	วันทำการ
6366	4470	1	18	2567	1	47	f	f	\N	วันหยุด
6367	4471	1	18	2567	1	47	f	f	\N	วันหยุด
6368	4472	1	18	2567	1	48	t	f	\N	วันทำการ
6369	4473	1	18	2567	1	48	t	f	\N	วันทำการ
6370	4474	1	18	2567	1	48	t	f	\N	วันทำการ
6371	4475	1	18	2567	1	48	t	f	\N	วันทำการ
6372	4476	1	18	2567	1	48	t	f	\N	วันทำการ
5079	4171	1	1	2567	1	1	t	f	\N	วันทำการ
5080	4172	1	1	2567	1	1	t	f	\N	วันทำการ
5081	4173	1	1	2567	1	1	t	f	\N	วันทำการ
5082	4174	1	1	2567	1	1	t	f	\N	วันทำการ
5083	4175	1	1	2567	1	1	t	f	\N	วันทำการ
5084	4176	1	1	2567	1	1	f	f	\N	วันหยุด
5085	4177	1	1	2567	1	1	f	f	\N	วันหยุด
5086	4178	1	1	2567	1	2	t	f	\N	วันทำการ
5087	4179	1	1	2567	1	2	t	f	\N	วันทำการ
5088	4180	1	1	2567	1	2	t	f	\N	วันทำการ
5089	4181	1	1	2567	1	2	t	f	\N	วันทำการ
5090	4182	1	1	2567	1	2	t	f	\N	วันทำการ
5091	4183	1	1	2567	1	2	f	f	\N	วันหยุด
5092	4184	1	1	2567	1	2	f	f	\N	วันหยุด
5093	4185	1	1	2567	1	3	t	f	\N	วันทำการ
5094	4186	1	1	2567	1	3	t	f	\N	วันทำการ
5095	4187	1	1	2567	1	3	t	f	\N	วันทำการ
5096	4188	1	1	2567	1	3	t	f	\N	วันทำการ
5097	4189	1	1	2567	1	3	t	f	\N	วันทำการ
5098	4190	1	1	2567	1	3	f	f	\N	วันหยุด
5099	4191	1	1	2567	1	3	f	f	\N	วันหยุด
5100	4192	1	1	2567	1	4	t	f	\N	วันทำการ
5101	4193	1	1	2567	1	4	t	f	\N	วันทำการ
5102	4194	1	1	2567	1	4	t	f	\N	วันทำการ
5103	4195	1	1	2567	1	4	t	f	\N	วันทำการ
5104	4196	1	1	2567	1	4	t	f	\N	วันทำการ
5105	4197	1	1	2567	1	4	f	t	วันอาสาฬหบูชา	วันหยุดนักขัตฤกษ์
5106	4198	1	1	2567	1	4	f	f	\N	วันหยุด
5107	4199	1	1	2567	1	5	f	t	วันหยุดชดเชยวันอาสาฬหบูชา	วันหยุดนักขัตฤกษ์
5108	4200	1	1	2567	1	5	t	f	\N	วันทำการ
5109	4201	1	1	2567	1	5	t	f	\N	วันทำการ
5110	4202	1	1	2567	1	5	t	f	\N	วันทำการ
5111	4203	1	1	2567	1	5	t	f	\N	วันทำการ
5112	4204	1	1	2567	1	5	f	f	\N	วันหยุด
5113	4205	1	1	2567	1	5	f	t	วันเฉลิมฯ ร.10	วันหยุดนักขัตฤกษ์
5114	4206	1	1	2567	1	6	f	t	วันหยุดชดเชยวันเฉลิมพระชนมพรรษา สมเด็จพระเจ้าอยู่หัวมหาวชิราลงกรณ บดินทรเทพยวรางกูร	วันหยุดนักขัตฤกษ์
5115	4207	1	1	2567	1	6	t	f	\N	วันทำการ
5116	4208	1	1	2567	1	6	t	f	\N	วันทำการ
5117	4209	1	1	2567	1	6	t	f	\N	วันทำการ
5118	4210	1	1	2567	1	6	t	f	\N	วันทำการ
5119	4211	1	1	2567	1	6	f	f	\N	วันหยุด
5120	4212	1	1	2567	1	6	f	f	\N	วันหยุด
5121	4213	1	1	2567	1	7	t	f	\N	วันทำการ
5122	4214	1	1	2567	1	7	t	f	\N	วันทำการ
5123	4215	1	1	2567	1	7	t	f	\N	วันทำการ
5124	4216	1	1	2567	1	7	t	f	\N	วันทำการ
5125	4217	1	1	2567	1	7	t	f	\N	วันทำการ
5126	4218	1	1	2567	1	7	f	f	\N	วันหยุด
5127	4219	1	1	2567	1	7	f	f	\N	วันหยุด
5128	4220	1	1	2567	1	8	f	t	วันแม่แห่งชาติ	วันหยุดนักขัตฤกษ์
5129	4221	1	1	2567	1	8	t	f	\N	วันทำการ
5130	4222	1	1	2567	1	8	t	f	\N	วันทำการ
5131	4223	1	1	2567	1	8	t	f	\N	วันทำการ
5132	4224	1	1	2567	1	8	t	f	\N	วันทำการ
5133	4225	1	1	2567	1	8	f	f	\N	วันหยุด
5134	4226	1	1	2567	1	8	f	f	\N	วันหยุด
5135	4227	1	1	2567	1	9	t	f	\N	วันทำการ
5136	4228	1	1	2567	1	9	t	f	\N	วันทำการ
5137	4229	1	1	2567	1	9	t	f	\N	วันทำการ
5138	4230	1	1	2567	1	9	t	f	\N	วันทำการ
5139	4231	1	1	2567	1	9	t	f	\N	วันทำการ
5140	4232	1	1	2567	1	9	f	f	\N	วันหยุด
5141	4233	1	1	2567	1	9	f	f	\N	วันหยุด
5142	4234	1	1	2567	1	10	t	f	\N	วันทำการ
5143	4235	1	1	2567	1	10	t	f	\N	วันทำการ
5144	4236	1	1	2567	1	10	t	f	\N	วันทำการ
5145	4237	1	1	2567	1	10	t	f	\N	วันทำการ
5146	4238	1	1	2567	1	10	t	f	\N	วันทำการ
5147	4239	1	1	2567	1	10	f	f	\N	วันหยุด
5148	4240	1	1	2567	1	10	f	f	\N	วันหยุด
5149	4241	1	1	2567	1	11	t	f	\N	วันทำการ
5150	4242	1	1	2567	1	11	t	f	\N	วันทำการ
5151	4243	1	1	2567	1	11	t	f	\N	วันทำการ
5152	4244	1	1	2567	1	11	t	f	\N	วันทำการ
5153	4245	1	1	2567	1	11	t	f	\N	วันทำการ
5154	4246	1	1	2567	1	11	f	f	\N	วันหยุด
5155	4247	1	1	2567	1	11	f	f	\N	วันหยุด
5156	4248	1	1	2567	1	12	t	f	\N	วันทำการ
5157	4249	1	1	2567	1	12	t	f	\N	วันทำการ
5158	4250	1	1	2567	1	12	t	f	\N	วันทำการ
5159	4251	1	1	2567	1	12	t	f	\N	วันทำการ
5160	4252	1	1	2567	1	12	t	f	\N	วันทำการ
5161	4253	1	1	2567	1	12	f	f	\N	วันหยุด
5162	4254	1	1	2567	1	12	f	f	\N	วันหยุด
5163	4255	1	1	2567	1	13	t	f	\N	วันทำการ
5164	4256	1	1	2567	1	13	t	f	\N	วันทำการ
5165	4257	1	1	2567	1	13	f	t	วันรับปริญญา	วันหยุดนักขัตฤกษ์
5166	4258	1	1	2567	1	13	t	f	\N	วันทำการ
5167	4259	1	1	2567	1	13	t	f	\N	วันทำการ
5168	4260	1	1	2567	1	13	f	f	\N	วันหยุด
5169	4261	1	1	2567	1	13	f	t	วันสงขลานครินทร์	วันหยุดนักขัตฤกษ์
5170	4262	1	1	2567	1	14	f	t	ชดเชยวันสงขลานครินทร์	วันหยุดนักขัตฤกษ์
5171	4263	1	1	2567	1	14	t	f	\N	วันทำการ
5172	4264	1	1	2567	1	14	t	f	\N	วันทำการ
5173	4265	1	1	2567	1	14	t	f	\N	วันทำการ
5174	4266	1	1	2567	1	14	t	f	\N	วันทำการ
5175	4267	1	1	2567	1	14	f	f	\N	วันหยุด
5176	4268	1	1	2567	1	14	f	f	\N	วันหยุด
5177	4269	1	1	2567	1	15	t	f	\N	วันทำการ
5178	4270	1	1	2567	1	15	t	f	\N	วันทำการ
5179	4271	1	1	2567	1	15	t	f	\N	วันทำการ
5180	4272	1	1	2567	1	15	t	f	\N	วันทำการ
5181	4273	1	1	2567	1	15	t	f	\N	วันทำการ
5182	4274	1	1	2567	1	15	f	f	\N	วันหยุด
5183	4275	1	1	2567	1	15	f	f	\N	วันหยุด
5184	4276	1	1	2567	1	16	t	f	\N	วันทำการ
5185	4277	1	1	2567	1	16	t	f	\N	วันทำการ
5186	4278	1	1	2567	1	16	t	f	\N	วันทำการ
5187	4279	1	1	2567	1	16	t	f	\N	วันทำการ
5188	4280	1	1	2567	1	16	t	f	\N	วันทำการ
5189	4281	1	1	2567	1	16	f	f	\N	วันหยุด
5190	4282	1	1	2567	1	16	f	t	วันนวมินทรมหาราช	วันหยุดนักขัตฤกษ์
5191	4283	1	1	2567	1	17	f	t	วันหยุดชดเชยวันคล้ายวันสวรรคตของพระบาทสมเด็จพระปรมินทรมหาภูมิพลอดุลยเดชบรมนาถบพิตร	วันหยุดนักขัตฤกษ์
5192	4284	1	1	2567	1	17	t	f	\N	วันทำการ
5193	4285	1	1	2567	1	17	t	f	\N	วันทำการ
5194	4286	1	1	2567	1	17	t	f	\N	วันทำการ
5195	4287	1	1	2567	1	17	t	f	\N	วันทำการ
5196	4288	1	1	2567	1	17	f	f	\N	วันหยุด
5197	4289	1	1	2567	1	17	f	f	\N	วันหยุด
5198	4290	1	1	2567	1	18	t	f	\N	วันทำการ
5199	4291	1	1	2567	1	18	t	f	\N	วันทำการ
5200	4292	1	1	2567	1	18	f	t	วันปิยมหาราช	วันหยุดนักขัตฤกษ์
5201	4293	1	1	2567	1	18	t	f	\N	วันทำการ
5202	4294	1	1	2567	1	18	t	f	\N	วันทำการ
5203	4295	1	1	2567	1	18	f	f	\N	วันหยุด
5204	4296	1	1	2567	1	18	f	f	\N	วันหยุด
5205	4297	1	1	2567	\N	\N	f	f	\N	ปิดภาค
5206	4298	1	1	2567	\N	\N	f	f	\N	ปิดภาค
5207	4299	1	1	2567	\N	\N	f	f	\N	ปิดภาค
5208	4300	1	1	2567	\N	\N	f	f	\N	ปิดภาค
5209	4301	1	1	2567	\N	\N	f	f	\N	ปิดภาค
5210	4302	1	1	2567	\N	\N	f	f	\N	วันหยุด
5211	4303	1	1	2567	\N	\N	f	f	\N	วันหยุด
5212	4304	1	1	2567	\N	\N	f	f	\N	ปิดภาค
5213	4305	1	1	2567	\N	\N	f	f	\N	ปิดภาค
5214	4306	1	1	2567	\N	\N	f	f	\N	ปิดภาค
5215	4307	1	1	2567	\N	\N	f	f	\N	ปิดภาค
5216	4308	1	1	2567	\N	\N	f	f	\N	ปิดภาค
5217	4309	1	1	2567	\N	\N	f	f	\N	วันหยุด
5218	4310	1	1	2567	\N	\N	f	f	\N	วันหยุด
5219	4311	1	1	2567	\N	\N	f	f	\N	ปิดภาค
5220	4312	1	1	2567	\N	\N	f	f	\N	ปิดภาค
5221	4313	1	1	2567	\N	\N	f	f	\N	ปิดภาค
5222	4314	1	1	2567	\N	\N	f	f	\N	ปิดภาค
5223	4315	1	1	2567	\N	\N	f	f	\N	ปิดภาค
5224	4316	1	1	2567	\N	\N	f	f	\N	วันหยุด
5225	4317	1	1	2567	\N	\N	f	f	\N	วันหยุด
5226	4318	1	1	2567	2	1	t	f	\N	วันทำการ
5227	4319	1	1	2567	2	1	t	f	\N	วันทำการ
5228	4320	1	1	2567	2	1	t	f	\N	วันทำการ
5229	4321	1	1	2567	2	1	t	f	\N	วันทำการ
5230	4322	1	1	2567	2	1	t	f	\N	วันทำการ
5231	4323	1	1	2567	2	1	f	f	\N	วันหยุด
5232	4324	1	1	2567	2	1	f	f	\N	วันหยุด
5233	4325	1	1	2567	2	2	t	f	\N	วันทำการ
5234	4326	1	1	2567	2	2	t	f	\N	วันทำการ
5235	4327	1	1	2567	2	2	t	f	\N	วันทำการ
5236	4328	1	1	2567	2	2	t	f	\N	วันทำการ
5237	4329	1	1	2567	2	2	t	f	\N	วันทำการ
5238	4330	1	1	2567	2	2	f	f	\N	วันหยุด
5239	4331	1	1	2567	2	2	f	f	\N	วันหยุด
5240	4332	1	1	2567	2	3	t	f	\N	วันทำการ
5241	4333	1	1	2567	2	3	t	f	\N	วันทำการ
5242	4334	1	1	2567	2	3	t	f	\N	วันทำการ
5243	4335	1	1	2567	2	3	f	t	วันพ่อแห่งชาติ	วันหยุดนักขัตฤกษ์
5244	4336	1	1	2567	2	3	t	f	\N	วันทำการ
5245	4337	1	1	2567	2	3	f	f	\N	วันหยุด
5246	4338	1	1	2567	2	3	f	f	\N	วันหยุด
5247	4339	1	1	2567	2	4	t	f	\N	วันทำการ
5248	4340	1	1	2567	2	4	f	t	วันรัฐธรรมนูญ	วันหยุดนักขัตฤกษ์
5249	4341	1	1	2567	2	4	t	f	\N	วันทำการ
5250	4342	1	1	2567	2	4	t	f	\N	วันทำการ
5251	4343	1	1	2567	2	4	t	f	\N	วันทำการ
5252	4344	1	1	2567	2	4	f	f	\N	วันหยุด
5253	4345	1	1	2567	2	4	f	f	\N	วันหยุด
5254	4346	1	1	2567	2	5	t	f	\N	วันทำการ
5255	4347	1	1	2567	2	5	t	f	\N	วันทำการ
5256	4348	1	1	2567	2	5	t	f	\N	วันทำการ
5257	4349	1	1	2567	2	5	t	f	\N	วันทำการ
5258	4350	1	1	2567	2	5	t	f	\N	วันทำการ
5259	4351	1	1	2567	2	5	f	f	\N	วันหยุด
5260	4352	1	1	2567	2	5	f	f	\N	วันหยุด
5261	4353	1	1	2567	2	6	t	f	\N	วันทำการ
5262	4354	1	1	2567	2	6	f	t	วันคริสต์มาสอีฟ	วันหยุดนักขัตฤกษ์
5263	4355	1	1	2567	2	6	f	t	วันคริสต์มาส	วันหยุดนักขัตฤกษ์
5264	4356	1	1	2567	2	6	t	f	\N	วันทำการ
5265	4357	1	1	2567	2	6	t	f	\N	วันทำการ
5266	4358	1	1	2567	2	6	f	f	\N	วันหยุด
5267	4359	1	1	2567	2	6	f	f	\N	วันหยุด
5268	4360	1	1	2567	2	7	f	t	วันหยุดราชการธันวาคม	วันหยุดนักขัตฤกษ์
5269	4361	1	1	2567	2	7	f	t	วันสิ้นปี	วันหยุดนักขัตฤกษ์
5270	4362	1	1	2567	2	7	f	t	วันขึ้นปีใหม่	วันหยุดนักขัตฤกษ์
5271	4363	1	1	2567	2	7	f	t	วันหยุดพิเศษ (ครม.)	วันหยุดนักขัตฤกษ์
5272	4364	1	1	2567	2	7	t	f	\N	วันทำการ
5273	4365	1	1	2567	2	7	f	f	\N	วันหยุด
5274	4366	1	1	2567	2	7	f	f	\N	วันหยุด
5275	4367	1	1	2567	2	8	t	f	\N	วันทำการ
5276	4368	1	1	2567	2	8	t	f	\N	วันทำการ
5277	4369	1	1	2567	2	8	t	f	\N	วันทำการ
5278	4370	1	1	2567	2	8	t	f	\N	วันทำการ
5279	4371	1	1	2567	2	8	t	f	\N	วันทำการ
5280	4372	1	1	2567	2	8	f	f	\N	วันหยุด
5281	4373	1	1	2567	2	8	f	f	\N	วันหยุด
5282	4374	1	1	2567	2	9	t	f	\N	วันทำการ
5283	4375	1	1	2567	2	9	t	f	\N	วันทำการ
5284	4376	1	1	2567	2	9	t	f	\N	วันทำการ
5285	4377	1	1	2567	2	9	t	f	\N	วันทำการ
5286	4378	1	1	2567	2	9	t	f	\N	วันทำการ
5287	4379	1	1	2567	2	9	f	f	\N	วันหยุด
5288	4380	1	1	2567	2	9	f	f	\N	วันหยุด
5289	4381	1	1	2567	2	10	t	f	\N	วันทำการ
5290	4382	1	1	2567	2	10	t	f	\N	วันทำการ
5291	4383	1	1	2567	2	10	t	f	\N	วันทำการ
5292	4384	1	1	2567	2	10	t	f	\N	วันทำการ
5293	4385	1	1	2567	2	10	t	f	\N	วันทำการ
5294	4386	1	1	2567	2	10	f	f	\N	วันหยุด
5295	4387	1	1	2567	2	10	f	f	\N	วันหยุด
5296	4388	1	1	2567	2	11	t	f	\N	วันทำการ
5297	4389	1	1	2567	2	11	t	f	\N	วันทำการ
5298	4390	1	1	2567	2	11	f	t	วันตรุษจีน	วันหยุดนักขัตฤกษ์
5299	4391	1	1	2567	2	11	f	t	วันตรุษจีน (วันที่ 2)	วันหยุดนักขัตฤกษ์
5300	4392	1	1	2567	2	11	f	t	วันตรุษจีน (วันที่ 3)	วันหยุดนักขัตฤกษ์
5301	4393	1	1	2567	2	11	f	f	\N	วันหยุด
5302	4394	1	1	2567	2	11	f	f	\N	วันหยุด
5303	4395	1	1	2567	2	12	t	f	\N	วันทำการ
5304	4396	1	1	2567	2	12	t	f	\N	วันทำการ
5305	4397	1	1	2567	2	12	t	f	\N	วันทำการ
5306	4398	1	1	2567	2	12	t	f	\N	วันทำการ
5307	4399	1	1	2567	2	12	t	f	\N	วันทำการ
5308	4400	1	1	2567	2	12	f	f	\N	วันหยุด
5309	4401	1	1	2567	2	12	f	f	\N	วันหยุด
5310	4402	1	1	2567	2	13	t	f	\N	วันทำการ
5311	4403	1	1	2567	2	13	t	f	\N	วันทำการ
5312	4404	1	1	2567	2	13	f	t	วันมาฆบูชา	วันหยุดนักขัตฤกษ์
5313	4405	1	1	2567	2	13	t	f	\N	วันทำการ
5314	4406	1	1	2567	2	13	f	t	วันวาเลนไทน์	วันหยุดนักขัตฤกษ์
5315	4407	1	1	2567	2	13	f	f	\N	วันหยุด
5316	4408	1	1	2567	2	13	f	f	\N	วันหยุด
5317	4409	1	1	2567	2	14	t	f	\N	วันทำการ
5318	4410	1	1	2567	2	14	t	f	\N	วันทำการ
5319	4411	1	1	2567	2	14	t	f	\N	วันทำการ
5320	4412	1	1	2567	2	14	t	f	\N	วันทำการ
5321	4413	1	1	2567	2	14	t	f	\N	วันทำการ
5322	4414	1	1	2567	2	14	f	f	\N	วันหยุด
5323	4415	1	1	2567	2	14	f	f	\N	วันหยุด
5324	4416	1	1	2567	2	15	t	f	\N	วันทำการ
5325	4417	1	1	2567	2	15	t	f	\N	วันทำการ
5326	4418	1	1	2567	2	15	t	f	\N	วันทำการ
5327	4419	1	1	2567	2	15	t	f	\N	วันทำการ
5328	4420	1	1	2567	2	15	t	f	\N	วันทำการ
5329	4421	1	1	2567	2	15	f	f	\N	วันหยุด
5330	4422	1	1	2567	2	15	f	f	\N	วันหยุด
5331	4423	1	1	2567	2	16	t	f	\N	วันทำการ
5332	4424	1	1	2567	2	16	t	f	\N	วันทำการ
5333	4425	1	1	2567	2	16	t	f	\N	วันทำการ
5334	4426	1	1	2567	2	16	t	f	\N	วันทำการ
5335	4427	1	1	2567	2	16	t	f	\N	วันทำการ
5336	4428	1	1	2567	2	16	f	f	\N	วันหยุด
5337	4429	1	1	2567	2	16	f	f	\N	วันหยุด
5338	4430	1	1	2567	2	17	t	f	\N	วันทำการ
5339	4431	1	1	2567	2	17	t	f	\N	วันทำการ
5340	4432	1	1	2567	2	17	t	f	\N	วันทำการ
5341	4433	1	1	2567	2	17	t	f	\N	วันทำการ
5342	4434	1	1	2567	2	17	t	f	\N	วันทำการ
5343	4435	1	1	2567	2	17	f	f	\N	วันหยุด
5344	4436	1	1	2567	2	17	f	f	\N	วันหยุด
5345	4437	1	1	2567	2	18	t	f	\N	วันทำการ
5346	4438	1	1	2567	2	18	t	f	\N	วันทำการ
5347	4439	1	1	2567	2	18	t	f	\N	วันทำการ
5348	4440	1	1	2567	2	18	t	f	\N	วันทำการ
5349	4441	1	1	2567	2	18	t	f	\N	วันทำการ
5350	4442	1	1	2567	2	18	f	f	\N	วันหยุด
5351	4443	1	1	2567	\N	\N	f	f	\N	วันหยุด
5352	4444	1	1	2567	\N	\N	f	f	\N	ปิดภาค
5353	4445	1	1	2567	\N	\N	f	f	\N	ปิดภาค
5354	4446	1	1	2567	\N	\N	f	f	\N	ปิดภาค
5355	4447	1	1	2567	\N	\N	f	f	\N	ปิดภาค
5356	4448	1	1	2567	\N	\N	f	f	\N	ปิดภาค
5357	4449	1	1	2567	\N	\N	f	f	\N	วันหยุด
5358	4450	1	1	2567	\N	\N	f	f	\N	วันหยุด
5359	4451	1	1	2567	\N	\N	f	t	วันรายออีดี้ลฟิตรี	วันหยุดนักขัตฤกษ์
5360	4452	1	1	2567	\N	\N	f	f	\N	ปิดภาค
5361	4453	1	1	2567	\N	\N	f	f	\N	ปิดภาค
5362	4454	1	1	2567	\N	\N	f	f	\N	ปิดภาค
5363	4455	1	1	2567	\N	\N	f	f	\N	ปิดภาค
5364	4456	1	1	2567	\N	\N	f	f	\N	วันหยุด
5365	4457	1	1	2567	\N	\N	f	t	วันจักรี	วันหยุดนักขัตฤกษ์
5366	4458	1	1	2567	\N	\N	f	t	ชดเชยวันจักรี	วันหยุดนักขัตฤกษ์
5367	4459	1	1	2567	\N	\N	f	f	\N	ปิดภาค
5368	4460	1	1	2567	\N	\N	f	f	\N	ปิดภาค
5369	4461	1	1	2567	\N	\N	f	f	\N	ปิดภาค
5370	4462	1	1	2567	\N	\N	f	f	\N	ปิดภาค
5371	4463	1	1	2567	\N	\N	f	f	\N	วันหยุด
5372	4464	1	1	2567	\N	\N	f	t	วันสงกรานต์	วันหยุดนักขัตฤกษ์
5373	4465	1	1	2567	\N	\N	f	t	วันสงกรานต์	วันหยุดนักขัตฤกษ์
5374	4466	1	1	2567	\N	\N	f	t	วันสงกรานต์	วันหยุดนักขัตฤกษ์
5375	4467	1	1	2567	\N	\N	f	t	วันหยุดชดเชยวันสงกรานต์	วันหยุดนักขัตฤกษ์
5376	4468	1	1	2567	3	1	t	f	\N	วันทำการ
5377	4469	1	1	2567	3	1	t	f	\N	วันทำการ
5378	4470	1	1	2567	3	1	f	f	\N	วันหยุด
5379	4471	1	1	2567	3	1	f	f	\N	วันหยุด
5380	4472	1	1	2567	3	2	t	f	\N	วันทำการ
5381	4473	1	1	2567	3	2	t	f	\N	วันทำการ
5382	4474	1	1	2567	3	2	t	f	\N	วันทำการ
5383	4475	1	1	2567	3	2	t	f	\N	วันทำการ
5384	4476	1	1	2567	3	2	t	f	\N	วันทำการ
5385	4477	1	1	2567	3	2	f	f	\N	วันหยุด
5386	4478	1	1	2567	3	2	f	f	\N	วันหยุด
5387	4479	1	1	2567	3	3	t	f	\N	วันทำการ
5388	4480	1	1	2567	3	3	t	f	\N	วันทำการ
5389	4481	1	1	2567	3	3	t	f	\N	วันทำการ
5390	4482	1	1	2567	3	3	f	t	วันแรงงานแห่งชาติ	วันหยุดนักขัตฤกษ์
5391	4483	1	1	2567	3	3	t	f	\N	วันทำการ
5392	4484	1	1	2567	3	3	f	f	\N	วันหยุด
5393	4485	1	1	2567	3	3	f	t	วันฉัตรมงคล	วันหยุดนักขัตฤกษ์
5394	4486	1	1	2567	3	4	f	t	ชดเชยวันฉัตรมงคล	วันหยุดนักขัตฤกษ์
5395	4487	1	1	2567	3	4	t	f	\N	วันทำการ
5396	4488	1	1	2567	3	4	t	f	\N	วันทำการ
5397	4489	1	1	2567	3	4	t	f	\N	วันทำการ
5398	4490	1	1	2567	3	4	f	t	วันพืชมงคล	วันหยุดนักขัตฤกษ์
5399	4491	1	1	2567	3	4	f	f	\N	วันหยุด
5400	4492	1	1	2567	3	4	f	t	วันวิสาขบูชา	วันหยุดนักขัตฤกษ์
5401	4493	1	1	2567	3	5	f	t	วันหยุดชดเชยวันวิสาขบูชา	วันหยุดนักขัตฤกษ์
5402	4494	1	1	2567	3	5	t	f	\N	วันทำการ
5403	4495	1	1	2567	3	5	t	f	\N	วันทำการ
5404	4496	1	1	2567	3	5	t	f	\N	วันทำการ
5405	4497	1	1	2567	3	5	t	f	\N	วันทำการ
5406	4498	1	1	2567	3	5	f	f	\N	วันหยุด
5407	4499	1	1	2567	3	5	f	f	\N	วันหยุด
5408	4500	1	1	2567	3	6	t	f	\N	วันทำการ
5409	4501	1	1	2567	3	6	t	f	\N	วันทำการ
5410	4502	1	1	2567	3	6	t	f	\N	วันทำการ
5411	4503	1	1	2567	3	6	t	f	\N	วันทำการ
5412	4504	1	1	2567	3	6	t	f	\N	วันทำการ
5413	4505	1	1	2567	3	6	f	f	\N	วันหยุด
5414	4506	1	1	2567	3	6	f	f	\N	วันหยุด
5415	4507	1	1	2567	3	7	t	f	\N	วันทำการ
5416	4508	1	1	2567	3	7	t	f	\N	วันทำการ
5417	4509	1	1	2567	3	7	t	f	\N	วันทำการ
5418	4510	1	1	2567	3	7	t	f	\N	วันทำการ
5419	4511	1	1	2567	3	7	t	f	\N	วันทำการ
5420	4512	1	1	2567	3	7	f	f	\N	วันหยุด
5421	4513	1	1	2567	3	7	f	f	\N	วันหยุด
5422	4514	1	1	2567	3	8	f	t	นักขัตฤกษ์	วันหยุดนักขัตฤกษ์
5423	4515	1	1	2567	3	8	f	t	วันเฉลิมฯ พระราชินี	วันหยุดนักขัตฤกษ์
5424	4516	1	1	2567	3	8	t	f	\N	วันทำการ
5425	4517	1	1	2567	3	8	t	f	\N	วันทำการ
5426	4518	1	1	2567	3	8	t	f	\N	วันทำการ
5427	4519	1	1	2567	3	8	f	t	วันรายออีดี้ลอัดฮา	วันหยุดนักขัตฤกษ์
5428	4520	1	1	2567	3	8	f	f	\N	วันหยุด
8017	4171	4	1	2567	1	1	t	f	\N	วันทำการ
8018	4172	4	1	2567	1	1	t	f	\N	วันทำการ
8019	4173	4	1	2567	1	1	t	f	\N	วันทำการ
8020	4174	4	1	2567	1	1	t	f	\N	วันทำการ
8021	4175	4	1	2567	1	1	t	f	\N	วันทำการ
8022	4176	4	1	2567	1	1	f	f	\N	วันหยุด
8023	4177	4	1	2567	1	1	f	f	\N	วันหยุด
8024	4178	4	1	2567	1	2	t	f	\N	วันทำการ
8025	4179	4	1	2567	1	2	t	f	\N	วันทำการ
8026	4180	4	1	2567	1	2	t	f	\N	วันทำการ
8027	4181	4	1	2567	1	2	t	f	\N	วันทำการ
8028	4182	4	1	2567	1	2	t	f	\N	วันทำการ
8029	4183	4	1	2567	1	2	f	f	\N	วันหยุด
8030	4184	4	1	2567	1	2	f	f	\N	วันหยุด
8031	4185	4	1	2567	1	3	t	f	\N	วันทำการ
8032	4186	4	1	2567	1	3	t	f	\N	วันทำการ
8033	4187	4	1	2567	1	3	t	f	\N	วันทำการ
8034	4188	4	1	2567	1	3	t	f	\N	วันทำการ
8035	4189	4	1	2567	1	3	t	f	\N	วันทำการ
8036	4190	4	1	2567	1	3	f	f	\N	วันหยุด
8037	4191	4	1	2567	1	3	f	f	\N	วันหยุด
8038	4192	4	1	2567	1	4	t	f	\N	วันทำการ
8039	4193	4	1	2567	1	4	t	f	\N	วันทำการ
8040	4194	4	1	2567	1	4	t	f	\N	วันทำการ
8041	4195	4	1	2567	1	4	t	f	\N	วันทำการ
8042	4196	4	1	2567	1	4	t	f	\N	วันทำการ
8043	4197	4	1	2567	1	4	f	t	วันอาสาฬหบูชา	วันหยุดนักขัตฤกษ์
8044	4198	4	1	2567	1	4	f	f	\N	วันหยุด
8045	4199	4	1	2567	1	5	f	t	วันหยุดชดเชยวันอาสาฬหบูชา	วันหยุดนักขัตฤกษ์
8046	4200	4	1	2567	1	5	t	f	\N	วันทำการ
8047	4201	4	1	2567	1	5	t	f	\N	วันทำการ
8048	4202	4	1	2567	1	5	t	f	\N	วันทำการ
8049	4203	4	1	2567	1	5	t	f	\N	วันทำการ
8050	4204	4	1	2567	1	5	f	f	\N	วันหยุด
8051	4205	4	1	2567	1	5	f	t	วันเฉลิมฯ ร.10	วันหยุดนักขัตฤกษ์
8052	4206	4	1	2567	1	6	f	t	วันหยุดชดเชยวันเฉลิมพระชนมพรรษา สมเด็จพระเจ้าอยู่หัวมหาวชิราลงกรณ บดินทรเทพยวรางกูร	วันหยุดนักขัตฤกษ์
8053	4207	4	1	2567	1	6	t	f	\N	วันทำการ
8054	4208	4	1	2567	1	6	t	f	\N	วันทำการ
8055	4209	4	1	2567	1	6	t	f	\N	วันทำการ
8056	4210	4	1	2567	1	6	t	f	\N	วันทำการ
8057	4211	4	1	2567	1	6	f	f	\N	วันหยุด
8058	4212	4	1	2567	1	6	f	f	\N	วันหยุด
8059	4213	4	1	2567	1	7	t	f	\N	วันทำการ
8060	4214	4	1	2567	1	7	t	f	\N	วันทำการ
8061	4215	4	1	2567	1	7	t	f	\N	วันทำการ
8062	4216	4	1	2567	1	7	t	f	\N	วันทำการ
8063	4217	4	1	2567	1	7	t	f	\N	วันทำการ
8064	4218	4	1	2567	1	7	f	f	\N	วันหยุด
8065	4219	4	1	2567	1	7	f	f	\N	วันหยุด
8066	4220	4	1	2567	1	8	f	t	วันแม่แห่งชาติ	วันหยุดนักขัตฤกษ์
8067	4221	4	1	2567	1	8	t	f	\N	วันทำการ
8068	4222	4	1	2567	1	8	t	f	\N	วันทำการ
8069	4223	4	1	2567	1	8	t	f	\N	วันทำการ
8070	4224	4	1	2567	1	8	t	f	\N	วันทำการ
8071	4225	4	1	2567	1	8	f	f	\N	วันหยุด
8072	4226	4	1	2567	1	8	f	f	\N	วันหยุด
8073	4227	4	1	2567	1	9	t	f	\N	วันทำการ
8074	4228	4	1	2567	1	9	t	f	\N	วันทำการ
8075	4229	4	1	2567	1	9	t	f	\N	วันทำการ
8076	4230	4	1	2567	1	9	t	f	\N	วันทำการ
8077	4231	4	1	2567	1	9	t	f	\N	วันทำการ
8078	4232	4	1	2567	1	9	f	f	\N	วันหยุด
8079	4233	4	1	2567	1	9	f	f	\N	วันหยุด
8080	4234	4	1	2567	1	10	t	f	\N	วันทำการ
8081	4235	4	1	2567	1	10	t	f	\N	วันทำการ
8082	4236	4	1	2567	1	10	t	f	\N	วันทำการ
8083	4237	4	1	2567	1	10	t	f	\N	วันทำการ
8084	4238	4	1	2567	1	10	t	f	\N	วันทำการ
8085	4239	4	1	2567	1	10	f	f	\N	วันหยุด
8086	4240	4	1	2567	1	10	f	f	\N	วันหยุด
8087	4241	4	1	2567	1	11	t	f	\N	วันทำการ
8088	4242	4	1	2567	1	11	t	f	\N	วันทำการ
8089	4243	4	1	2567	1	11	t	f	\N	วันทำการ
8090	4244	4	1	2567	1	11	t	f	\N	วันทำการ
8091	4245	4	1	2567	1	11	t	f	\N	วันทำการ
8092	4246	4	1	2567	1	11	f	f	\N	วันหยุด
8093	4247	4	1	2567	1	11	f	f	\N	วันหยุด
8094	4248	4	1	2567	1	12	t	f	\N	วันทำการ
8095	4249	4	1	2567	1	12	t	f	\N	วันทำการ
8096	4250	4	1	2567	1	12	t	f	\N	วันทำการ
8097	4251	4	1	2567	1	12	t	f	\N	วันทำการ
8098	4252	4	1	2567	1	12	t	f	\N	วันทำการ
8099	4253	4	1	2567	1	12	f	f	\N	วันหยุด
8100	4254	4	1	2567	1	12	f	f	\N	วันหยุด
8101	4255	4	1	2567	1	13	t	f	\N	วันทำการ
8102	4256	4	1	2567	1	13	t	f	\N	วันทำการ
8103	4257	4	1	2567	1	13	t	f	\N	วันทำการ
8104	4258	4	1	2567	1	13	t	f	\N	วันทำการ
8105	4259	4	1	2567	1	13	t	f	\N	วันทำการ
8106	4260	4	1	2567	1	13	f	f	\N	วันหยุด
8107	4261	4	1	2567	1	13	f	t	วันสงขลานครินทร์	วันหยุดนักขัตฤกษ์
8108	4262	4	1	2567	1	14	f	t	ชดเชยวันสงขลานครินทร์	วันหยุดนักขัตฤกษ์
8109	4263	4	1	2567	1	14	t	f	\N	วันทำการ
8110	4264	4	1	2567	1	14	t	f	\N	วันทำการ
8111	4265	4	1	2567	1	14	t	f	\N	วันทำการ
8112	4266	4	1	2567	1	14	t	f	\N	วันทำการ
8113	4267	4	1	2567	1	14	f	f	\N	วันหยุด
8114	4268	4	1	2567	1	14	f	f	\N	วันหยุด
8115	4269	4	1	2567	1	15	t	f	\N	วันทำการ
8116	4270	4	1	2567	1	15	t	f	\N	วันทำการ
8117	4271	4	1	2567	1	15	t	f	\N	วันทำการ
8118	4272	4	1	2567	1	15	t	f	\N	วันทำการ
8119	4273	4	1	2567	1	15	t	f	\N	วันทำการ
8120	4274	4	1	2567	1	15	f	f	\N	วันหยุด
8121	4275	4	1	2567	1	15	f	f	\N	วันหยุด
8122	4276	4	1	2567	1	16	t	f	\N	วันทำการ
8123	4277	4	1	2567	1	16	t	f	\N	วันทำการ
8124	4278	4	1	2567	1	16	t	f	\N	วันทำการ
8125	4279	4	1	2567	1	16	t	f	\N	วันทำการ
8126	4280	4	1	2567	1	16	t	f	\N	วันทำการ
8127	4281	4	1	2567	1	16	f	f	\N	วันหยุด
8128	4282	4	1	2567	1	16	f	t	วันนวมินทรมหาราช	วันหยุดนักขัตฤกษ์
8129	4283	4	1	2567	1	17	f	t	วันหยุดชดเชยวันคล้ายวันสวรรคตของพระบาทสมเด็จพระปรมินทรมหาภูมิพลอดุลยเดชบรมนาถบพิตร	วันหยุดนักขัตฤกษ์
8130	4284	4	1	2567	1	17	t	f	\N	วันทำการ
8131	4285	4	1	2567	1	17	t	f	\N	วันทำการ
8132	4286	4	1	2567	1	17	t	f	\N	วันทำการ
8133	4287	4	1	2567	1	17	t	f	\N	วันทำการ
8134	4288	4	1	2567	1	17	f	f	\N	วันหยุด
8135	4289	4	1	2567	1	17	f	f	\N	วันหยุด
8136	4290	4	1	2567	1	18	t	f	\N	วันทำการ
8137	4291	4	1	2567	1	18	t	f	\N	วันทำการ
8138	4292	4	1	2567	1	18	f	t	วันปิยมหาราช	วันหยุดนักขัตฤกษ์
8139	4293	4	1	2567	1	18	t	f	\N	วันทำการ
8140	4294	4	1	2567	1	18	t	f	\N	วันทำการ
8141	4295	4	1	2567	1	18	f	f	\N	วันหยุด
8142	4296	4	1	2567	1	18	f	f	\N	วันหยุด
8143	4297	4	1	2567	\N	\N	f	f	\N	ปิดภาค
8144	4298	4	1	2567	\N	\N	f	f	\N	ปิดภาค
8145	4299	4	1	2567	\N	\N	f	f	\N	ปิดภาค
8146	4300	4	1	2567	\N	\N	f	f	\N	ปิดภาค
8147	4301	4	1	2567	\N	\N	f	f	\N	ปิดภาค
8148	4302	4	1	2567	\N	\N	f	f	\N	วันหยุด
8149	4303	4	1	2567	\N	\N	f	f	\N	วันหยุด
8150	4304	4	1	2567	\N	\N	f	f	\N	ปิดภาค
8151	4305	4	1	2567	\N	\N	f	f	\N	ปิดภาค
8152	4306	4	1	2567	\N	\N	f	f	\N	ปิดภาค
8153	4307	4	1	2567	\N	\N	f	f	\N	ปิดภาค
8154	4308	4	1	2567	\N	\N	f	f	\N	ปิดภาค
8155	4309	4	1	2567	\N	\N	f	f	\N	วันหยุด
8156	4310	4	1	2567	\N	\N	f	f	\N	วันหยุด
8157	4311	4	1	2567	\N	\N	f	f	\N	ปิดภาค
8158	4312	4	1	2567	\N	\N	f	f	\N	ปิดภาค
8159	4313	4	1	2567	\N	\N	f	f	\N	ปิดภาค
8160	4314	4	1	2567	\N	\N	f	f	\N	ปิดภาค
8161	4315	4	1	2567	\N	\N	f	f	\N	ปิดภาค
8162	4316	4	1	2567	\N	\N	f	f	\N	วันหยุด
8163	4317	4	1	2567	\N	\N	f	f	\N	วันหยุด
8164	4318	4	1	2567	2	1	t	f	\N	วันทำการ
8165	4319	4	1	2567	2	1	t	f	\N	วันทำการ
8166	4320	4	1	2567	2	1	t	f	\N	วันทำการ
8167	4321	4	1	2567	2	1	t	f	\N	วันทำการ
8168	4322	4	1	2567	2	1	t	f	\N	วันทำการ
8169	4323	4	1	2567	2	1	f	f	\N	วันหยุด
8170	4324	4	1	2567	2	1	f	f	\N	วันหยุด
8171	4325	4	1	2567	2	2	t	f	\N	วันทำการ
8172	4326	4	1	2567	2	2	t	f	\N	วันทำการ
8173	4327	4	1	2567	2	2	t	f	\N	วันทำการ
8174	4328	4	1	2567	2	2	t	f	\N	วันทำการ
8175	4329	4	1	2567	2	2	t	f	\N	วันทำการ
8176	4330	4	1	2567	2	2	f	f	\N	วันหยุด
8177	4331	4	1	2567	2	2	f	f	\N	วันหยุด
8178	4332	4	1	2567	2	3	t	f	\N	วันทำการ
8179	4333	4	1	2567	2	3	t	f	\N	วันทำการ
8180	4334	4	1	2567	2	3	t	f	\N	วันทำการ
8181	4335	4	1	2567	2	3	f	t	วันพ่อแห่งชาติ	วันหยุดนักขัตฤกษ์
8182	4336	4	1	2567	2	3	t	f	\N	วันทำการ
8183	4337	4	1	2567	2	3	f	f	\N	วันหยุด
8184	4338	4	1	2567	2	3	f	f	\N	วันหยุด
8185	4339	4	1	2567	2	4	t	f	\N	วันทำการ
8186	4340	4	1	2567	2	4	f	t	วันรัฐธรรมนูญ	วันหยุดนักขัตฤกษ์
8187	4341	4	1	2567	2	4	t	f	\N	วันทำการ
8188	4342	4	1	2567	2	4	t	f	\N	วันทำการ
8189	4343	4	1	2567	2	4	t	f	\N	วันทำการ
8190	4344	4	1	2567	2	4	f	f	\N	วันหยุด
8191	4345	4	1	2567	2	4	f	f	\N	วันหยุด
8192	4346	4	1	2567	2	5	t	f	\N	วันทำการ
8193	4347	4	1	2567	2	5	t	f	\N	วันทำการ
8194	4348	4	1	2567	2	5	t	f	\N	วันทำการ
8195	4349	4	1	2567	2	5	t	f	\N	วันทำการ
8196	4350	4	1	2567	2	5	t	f	\N	วันทำการ
8197	4351	4	1	2567	2	5	f	f	\N	วันหยุด
8198	4352	4	1	2567	2	5	f	f	\N	วันหยุด
8199	4353	4	1	2567	2	6	t	f	\N	วันทำการ
8200	4354	4	1	2567	2	6	f	t	วันคริสต์มาสอีฟ	วันหยุดนักขัตฤกษ์
8201	4355	4	1	2567	2	6	f	t	วันคริสต์มาส	วันหยุดนักขัตฤกษ์
8202	4356	4	1	2567	2	6	t	f	\N	วันทำการ
8203	4357	4	1	2567	2	6	t	f	\N	วันทำการ
8204	4358	4	1	2567	2	6	f	f	\N	วันหยุด
8205	4359	4	1	2567	2	6	f	f	\N	วันหยุด
8206	4360	4	1	2567	2	7	f	t	วันหยุดราชการธันวาคม	วันหยุดนักขัตฤกษ์
8207	4361	4	1	2567	2	7	f	t	วันสิ้นปี	วันหยุดนักขัตฤกษ์
8208	4362	4	1	2567	2	7	f	t	วันขึ้นปีใหม่	วันหยุดนักขัตฤกษ์
8209	4363	4	1	2567	2	7	f	t	วันหยุดพิเศษ (ครม.)	วันหยุดนักขัตฤกษ์
8210	4364	4	1	2567	2	7	t	f	\N	วันทำการ
8211	4365	4	1	2567	2	7	f	f	\N	วันหยุด
8212	4366	4	1	2567	2	7	f	f	\N	วันหยุด
8213	4367	4	1	2567	2	8	t	f	\N	วันทำการ
8214	4368	4	1	2567	2	8	t	f	\N	วันทำการ
8215	4369	4	1	2567	2	8	t	f	\N	วันทำการ
8216	4370	4	1	2567	2	8	t	f	\N	วันทำการ
8217	4371	4	1	2567	2	8	t	f	\N	วันทำการ
8218	4372	4	1	2567	2	8	f	f	\N	วันหยุด
8219	4373	4	1	2567	2	8	f	f	\N	วันหยุด
8220	4374	4	1	2567	2	9	t	f	\N	วันทำการ
8221	4375	4	1	2567	2	9	t	f	\N	วันทำการ
8222	4376	4	1	2567	2	9	t	f	\N	วันทำการ
8223	4377	4	1	2567	2	9	t	f	\N	วันทำการ
8224	4378	4	1	2567	2	9	t	f	\N	วันทำการ
8225	4379	4	1	2567	2	9	f	f	\N	วันหยุด
8226	4380	4	1	2567	2	9	f	f	\N	วันหยุด
8227	4381	4	1	2567	2	10	t	f	\N	วันทำการ
8228	4382	4	1	2567	2	10	t	f	\N	วันทำการ
8229	4383	4	1	2567	2	10	t	f	\N	วันทำการ
8230	4384	4	1	2567	2	10	t	f	\N	วันทำการ
8231	4385	4	1	2567	2	10	t	f	\N	วันทำการ
8232	4386	4	1	2567	2	10	f	f	\N	วันหยุด
8233	4387	4	1	2567	2	10	f	f	\N	วันหยุด
8234	4388	4	1	2567	2	11	t	f	\N	วันทำการ
8235	4389	4	1	2567	2	11	t	f	\N	วันทำการ
8236	4390	4	1	2567	2	11	f	t	วันตรุษจีน	วันหยุดนักขัตฤกษ์
8237	4391	4	1	2567	2	11	f	t	วันตรุษจีน (วันที่ 2)	วันหยุดนักขัตฤกษ์
8238	4392	4	1	2567	2	11	f	t	วันตรุษจีน (วันที่ 3)	วันหยุดนักขัตฤกษ์
8239	4393	4	1	2567	2	11	f	f	\N	วันหยุด
8240	4394	4	1	2567	2	11	f	f	\N	วันหยุด
8241	4395	4	1	2567	2	12	t	f	\N	วันทำการ
8242	4396	4	1	2567	2	12	t	f	\N	วันทำการ
8243	4397	4	1	2567	2	12	t	f	\N	วันทำการ
8244	4398	4	1	2567	2	12	t	f	\N	วันทำการ
8245	4399	4	1	2567	2	12	t	f	\N	วันทำการ
8246	4400	4	1	2567	2	12	f	f	\N	วันหยุด
8247	4401	4	1	2567	2	12	f	f	\N	วันหยุด
8248	4402	4	1	2567	2	13	t	f	\N	วันทำการ
8249	4403	4	1	2567	2	13	t	f	\N	วันทำการ
8250	4404	4	1	2567	2	13	f	t	วันมาฆบูชา	วันหยุดนักขัตฤกษ์
8251	4405	4	1	2567	2	13	t	f	\N	วันทำการ
8252	4406	4	1	2567	2	13	f	t	วันวาเลนไทน์	วันหยุดนักขัตฤกษ์
8253	4407	4	1	2567	2	13	f	f	\N	วันหยุด
8254	4408	4	1	2567	2	13	f	f	\N	วันหยุด
8255	4409	4	1	2567	2	14	t	f	\N	วันทำการ
8256	4410	4	1	2567	2	14	t	f	\N	วันทำการ
8257	4411	4	1	2567	2	14	t	f	\N	วันทำการ
8258	4412	4	1	2567	2	14	t	f	\N	วันทำการ
8259	4413	4	1	2567	2	14	t	f	\N	วันทำการ
8260	4414	4	1	2567	2	14	f	f	\N	วันหยุด
8261	4415	4	1	2567	2	14	f	f	\N	วันหยุด
8262	4416	4	1	2567	2	15	t	f	\N	วันทำการ
8263	4417	4	1	2567	2	15	t	f	\N	วันทำการ
8264	4418	4	1	2567	2	15	t	f	\N	วันทำการ
8265	4419	4	1	2567	2	15	t	f	\N	วันทำการ
8266	4420	4	1	2567	2	15	t	f	\N	วันทำการ
8267	4421	4	1	2567	2	15	f	f	\N	วันหยุด
8268	4422	4	1	2567	2	15	f	f	\N	วันหยุด
8269	4423	4	1	2567	2	16	t	f	\N	วันทำการ
8270	4424	4	1	2567	2	16	t	f	\N	วันทำการ
8271	4425	4	1	2567	2	16	t	f	\N	วันทำการ
8272	4426	4	1	2567	2	16	t	f	\N	วันทำการ
8273	4427	4	1	2567	2	16	t	f	\N	วันทำการ
8274	4428	4	1	2567	2	16	f	f	\N	วันหยุด
8275	4429	4	1	2567	2	16	f	f	\N	วันหยุด
8276	4430	4	1	2567	2	17	t	f	\N	วันทำการ
8277	4431	4	1	2567	2	17	t	f	\N	วันทำการ
8278	4432	4	1	2567	2	17	t	f	\N	วันทำการ
8279	4433	4	1	2567	2	17	t	f	\N	วันทำการ
8280	4434	4	1	2567	2	17	t	f	\N	วันทำการ
8281	4435	4	1	2567	2	17	f	f	\N	วันหยุด
8282	4436	4	1	2567	2	17	f	f	\N	วันหยุด
8283	4437	4	1	2567	2	18	t	f	\N	วันทำการ
8284	4438	4	1	2567	2	18	t	f	\N	วันทำการ
8285	4439	4	1	2567	2	18	t	f	\N	วันทำการ
8286	4440	4	1	2567	2	18	t	f	\N	วันทำการ
8287	4441	4	1	2567	2	18	t	f	\N	วันทำการ
8288	4442	4	1	2567	2	18	f	f	\N	วันหยุด
8289	4443	4	1	2567	\N	\N	f	f	\N	วันหยุด
8290	4444	4	1	2567	\N	\N	f	f	\N	ปิดภาค
8291	4445	4	1	2567	\N	\N	f	f	\N	ปิดภาค
8292	4446	4	1	2567	\N	\N	f	f	\N	ปิดภาค
8293	4447	4	1	2567	\N	\N	f	f	\N	ปิดภาค
8294	4448	4	1	2567	\N	\N	f	f	\N	ปิดภาค
8295	4449	4	1	2567	\N	\N	f	f	\N	วันหยุด
8296	4450	4	1	2567	\N	\N	f	f	\N	วันหยุด
8297	4451	4	1	2567	\N	\N	f	t	วันรายออีดี้ลฟิตรี	วันหยุดนักขัตฤกษ์
8298	4452	4	1	2567	\N	\N	f	f	\N	ปิดภาค
8299	4453	4	1	2567	\N	\N	f	f	\N	ปิดภาค
8300	4454	4	1	2567	\N	\N	f	f	\N	ปิดภาค
8301	4455	4	1	2567	\N	\N	f	f	\N	ปิดภาค
8302	4456	4	1	2567	\N	\N	f	f	\N	วันหยุด
8303	4457	4	1	2567	\N	\N	f	t	วันจักรี	วันหยุดนักขัตฤกษ์
8304	4458	4	1	2567	\N	\N	f	t	ชดเชยวันจักรี	วันหยุดนักขัตฤกษ์
8305	4459	4	1	2567	\N	\N	f	f	\N	ปิดภาค
8306	4460	4	1	2567	\N	\N	f	f	\N	ปิดภาค
8307	4461	4	1	2567	\N	\N	f	f	\N	ปิดภาค
8308	4462	4	1	2567	\N	\N	f	f	\N	ปิดภาค
8309	4463	4	1	2567	\N	\N	f	f	\N	วันหยุด
8310	4464	4	1	2567	\N	\N	f	t	วันสงกรานต์	วันหยุดนักขัตฤกษ์
8311	4465	4	1	2567	\N	\N	f	t	วันสงกรานต์	วันหยุดนักขัตฤกษ์
8312	4466	4	1	2567	\N	\N	f	t	วันสงกรานต์	วันหยุดนักขัตฤกษ์
8313	4467	4	1	2567	\N	\N	f	t	วันหยุดชดเชยวันสงกรานต์	วันหยุดนักขัตฤกษ์
8314	4468	4	1	2567	3	1	t	f	\N	วันทำการ
8315	4469	4	1	2567	3	1	t	f	\N	วันทำการ
8316	4470	4	1	2567	3	1	f	f	\N	วันหยุด
8317	4471	4	1	2567	3	1	f	f	\N	วันหยุด
8318	4472	4	1	2567	3	2	t	f	\N	วันทำการ
8319	4473	4	1	2567	3	2	t	f	\N	วันทำการ
8320	4474	4	1	2567	3	2	t	f	\N	วันทำการ
8321	4475	4	1	2567	3	2	t	f	\N	วันทำการ
8322	4476	4	1	2567	3	2	t	f	\N	วันทำการ
8323	4477	4	1	2567	3	2	f	f	\N	วันหยุด
8324	4478	4	1	2567	3	2	f	f	\N	วันหยุด
8325	4479	4	1	2567	3	3	t	f	\N	วันทำการ
8326	4480	4	1	2567	3	3	t	f	\N	วันทำการ
8327	4481	4	1	2567	3	3	t	f	\N	วันทำการ
8328	4482	4	1	2567	3	3	f	t	วันแรงงานแห่งชาติ	วันหยุดนักขัตฤกษ์
8329	4483	4	1	2567	3	3	t	f	\N	วันทำการ
8330	4484	4	1	2567	3	3	f	f	\N	วันหยุด
8331	4485	4	1	2567	3	3	f	t	วันฉัตรมงคล	วันหยุดนักขัตฤกษ์
8332	4486	4	1	2567	3	4	f	t	ชดเชยวันฉัตรมงคล	วันหยุดนักขัตฤกษ์
8333	4487	4	1	2567	3	4	t	f	\N	วันทำการ
8334	4488	4	1	2567	3	4	t	f	\N	วันทำการ
8335	4489	4	1	2567	3	4	t	f	\N	วันทำการ
8336	4490	4	1	2567	3	4	f	t	วันพืชมงคล	วันหยุดนักขัตฤกษ์
8337	4491	4	1	2567	3	4	f	f	\N	วันหยุด
8338	4492	4	1	2567	3	4	f	t	วันวิสาขบูชา	วันหยุดนักขัตฤกษ์
8339	4493	4	1	2567	3	5	f	t	วันหยุดชดเชยวันวิสาขบูชา	วันหยุดนักขัตฤกษ์
8340	4494	4	1	2567	3	5	t	f	\N	วันทำการ
8341	4495	4	1	2567	3	5	t	f	\N	วันทำการ
8342	4496	4	1	2567	3	5	t	f	\N	วันทำการ
8343	4497	4	1	2567	3	5	t	f	\N	วันทำการ
8344	4498	4	1	2567	3	5	f	f	\N	วันหยุด
8345	4499	4	1	2567	3	5	f	f	\N	วันหยุด
8346	4500	4	1	2567	3	6	t	f	\N	วันทำการ
8347	4501	4	1	2567	3	6	t	f	\N	วันทำการ
8348	4502	4	1	2567	3	6	t	f	\N	วันทำการ
8349	4503	4	1	2567	3	6	t	f	\N	วันทำการ
8350	4504	4	1	2567	3	6	t	f	\N	วันทำการ
8351	4505	4	1	2567	3	6	f	f	\N	วันหยุด
8352	4506	4	1	2567	3	6	f	f	\N	วันหยุด
8353	4507	4	1	2567	3	7	t	f	\N	วันทำการ
8354	4508	4	1	2567	3	7	t	f	\N	วันทำการ
8355	4509	4	1	2567	3	7	t	f	\N	วันทำการ
8356	4510	4	1	2567	3	7	t	f	\N	วันทำการ
8357	4511	4	1	2567	3	7	t	f	\N	วันทำการ
8358	4512	4	1	2567	3	7	f	f	\N	วันหยุด
8359	4513	4	1	2567	3	7	f	f	\N	วันหยุด
8360	4514	4	1	2567	3	8	f	t	นักขัตฤกษ์	วันหยุดนักขัตฤกษ์
8361	4515	4	1	2567	3	8	f	t	วันเฉลิมฯ พระราชินี	วันหยุดนักขัตฤกษ์
8362	4516	4	1	2567	3	8	t	f	\N	วันทำการ
8363	4517	4	1	2567	3	8	t	f	\N	วันทำการ
8364	4518	4	1	2567	3	8	t	f	\N	วันทำการ
8365	4519	4	1	2567	3	8	f	t	วันรายออีดี้ลอัดฮา	วันหยุดนักขัตฤกษ์
8366	4520	4	1	2567	3	8	f	f	\N	วันหยุด
8367	4171	5	1	2567	1	1	t	f	\N	วันทำการ
8368	4172	5	1	2567	1	1	t	f	\N	วันทำการ
8369	4173	5	1	2567	1	1	t	f	\N	วันทำการ
8370	4174	5	1	2567	1	1	t	f	\N	วันทำการ
8371	4175	5	1	2567	1	1	t	f	\N	วันทำการ
8372	4176	5	1	2567	1	1	f	f	\N	วันหยุด
8373	4177	5	1	2567	1	1	f	f	\N	วันหยุด
8374	4178	5	1	2567	1	2	t	f	\N	วันทำการ
8375	4179	5	1	2567	1	2	t	f	\N	วันทำการ
8376	4180	5	1	2567	1	2	t	f	\N	วันทำการ
8377	4181	5	1	2567	1	2	t	f	\N	วันทำการ
8378	4182	5	1	2567	1	2	t	f	\N	วันทำการ
8379	4183	5	1	2567	1	2	f	f	\N	วันหยุด
8380	4184	5	1	2567	1	2	f	f	\N	วันหยุด
8381	4185	5	1	2567	1	3	t	f	\N	วันทำการ
8382	4186	5	1	2567	1	3	t	f	\N	วันทำการ
8383	4187	5	1	2567	1	3	t	f	\N	วันทำการ
8384	4188	5	1	2567	1	3	t	f	\N	วันทำการ
8385	4189	5	1	2567	1	3	t	f	\N	วันทำการ
8386	4190	5	1	2567	1	3	f	f	\N	วันหยุด
8387	4191	5	1	2567	1	3	f	f	\N	วันหยุด
8388	4192	5	1	2567	1	4	t	f	\N	วันทำการ
8389	4193	5	1	2567	1	4	t	f	\N	วันทำการ
8390	4194	5	1	2567	1	4	t	f	\N	วันทำการ
8391	4195	5	1	2567	1	4	t	f	\N	วันทำการ
8392	4196	5	1	2567	1	4	t	f	\N	วันทำการ
8393	4197	5	1	2567	1	4	f	t	วันอาสาฬหบูชา	วันหยุดนักขัตฤกษ์
8394	4198	5	1	2567	1	4	f	f	\N	วันหยุด
8395	4199	5	1	2567	1	5	f	t	วันหยุดชดเชยวันอาสาฬหบูชา	วันหยุดนักขัตฤกษ์
8396	4200	5	1	2567	1	5	t	f	\N	วันทำการ
8397	4201	5	1	2567	1	5	t	f	\N	วันทำการ
8398	4202	5	1	2567	1	5	t	f	\N	วันทำการ
8399	4203	5	1	2567	1	5	t	f	\N	วันทำการ
8400	4204	5	1	2567	1	5	f	f	\N	วันหยุด
8401	4205	5	1	2567	1	5	f	t	วันเฉลิมฯ ร.10	วันหยุดนักขัตฤกษ์
8402	4206	5	1	2567	1	6	f	t	วันหยุดชดเชยวันเฉลิมพระชนมพรรษา สมเด็จพระเจ้าอยู่หัวมหาวชิราลงกรณ บดินทรเทพยวรางกูร	วันหยุดนักขัตฤกษ์
8403	4207	5	1	2567	1	6	t	f	\N	วันทำการ
8404	4208	5	1	2567	1	6	t	f	\N	วันทำการ
8405	4209	5	1	2567	1	6	t	f	\N	วันทำการ
8406	4210	5	1	2567	1	6	t	f	\N	วันทำการ
8407	4211	5	1	2567	1	6	f	f	\N	วันหยุด
8408	4212	5	1	2567	1	6	f	f	\N	วันหยุด
8409	4213	5	1	2567	1	7	t	f	\N	วันทำการ
8410	4214	5	1	2567	1	7	t	f	\N	วันทำการ
8411	4215	5	1	2567	1	7	t	f	\N	วันทำการ
8412	4216	5	1	2567	1	7	t	f	\N	วันทำการ
8413	4217	5	1	2567	1	7	t	f	\N	วันทำการ
8414	4218	5	1	2567	1	7	f	f	\N	วันหยุด
8415	4219	5	1	2567	1	7	f	f	\N	วันหยุด
8416	4220	5	1	2567	1	8	f	t	วันแม่แห่งชาติ	วันหยุดนักขัตฤกษ์
8417	4221	5	1	2567	1	8	t	f	\N	วันทำการ
8418	4222	5	1	2567	1	8	t	f	\N	วันทำการ
8419	4223	5	1	2567	1	8	t	f	\N	วันทำการ
8420	4224	5	1	2567	1	8	t	f	\N	วันทำการ
8421	4225	5	1	2567	1	8	f	f	\N	วันหยุด
8422	4226	5	1	2567	1	8	f	f	\N	วันหยุด
8423	4227	5	1	2567	1	9	t	f	\N	วันทำการ
8424	4228	5	1	2567	1	9	t	f	\N	วันทำการ
8425	4229	5	1	2567	1	9	t	f	\N	วันทำการ
8426	4230	5	1	2567	1	9	t	f	\N	วันทำการ
8427	4231	5	1	2567	1	9	t	f	\N	วันทำการ
8428	4232	5	1	2567	1	9	f	f	\N	วันหยุด
8429	4233	5	1	2567	1	9	f	f	\N	วันหยุด
8430	4234	5	1	2567	1	10	t	f	\N	วันทำการ
8431	4235	5	1	2567	1	10	t	f	\N	วันทำการ
8432	4236	5	1	2567	1	10	t	f	\N	วันทำการ
8433	4237	5	1	2567	1	10	t	f	\N	วันทำการ
8434	4238	5	1	2567	1	10	t	f	\N	วันทำการ
8435	4239	5	1	2567	1	10	f	f	\N	วันหยุด
8436	4240	5	1	2567	1	10	f	f	\N	วันหยุด
8437	4241	5	1	2567	1	11	t	f	\N	วันทำการ
8438	4242	5	1	2567	1	11	t	f	\N	วันทำการ
8439	4243	5	1	2567	1	11	t	f	\N	วันทำการ
8440	4244	5	1	2567	1	11	t	f	\N	วันทำการ
8441	4245	5	1	2567	1	11	t	f	\N	วันทำการ
8442	4246	5	1	2567	1	11	f	f	\N	วันหยุด
8443	4247	5	1	2567	1	11	f	f	\N	วันหยุด
8444	4248	5	1	2567	1	12	t	f	\N	วันทำการ
8445	4249	5	1	2567	1	12	t	f	\N	วันทำการ
8446	4250	5	1	2567	1	12	t	f	\N	วันทำการ
8447	4251	5	1	2567	1	12	t	f	\N	วันทำการ
8448	4252	5	1	2567	1	12	t	f	\N	วันทำการ
8449	4253	5	1	2567	1	12	f	f	\N	วันหยุด
8450	4254	5	1	2567	1	12	f	f	\N	วันหยุด
8451	4255	5	1	2567	1	13	t	f	\N	วันทำการ
8452	4256	5	1	2567	1	13	t	f	\N	วันทำการ
8453	4257	5	1	2567	1	13	t	f	\N	วันทำการ
8454	4258	5	1	2567	1	13	t	f	\N	วันทำการ
8455	4259	5	1	2567	1	13	t	f	\N	วันทำการ
8456	4260	5	1	2567	1	13	f	f	\N	วันหยุด
8457	4261	5	1	2567	1	13	f	t	วันสงขลานครินทร์	วันหยุดนักขัตฤกษ์
8458	4262	5	1	2567	1	14	f	t	ชดเชยวันสงขลานครินทร์	วันหยุดนักขัตฤกษ์
8459	4263	5	1	2567	1	14	t	f	\N	วันทำการ
8460	4264	5	1	2567	1	14	t	f	\N	วันทำการ
8461	4265	5	1	2567	1	14	t	f	\N	วันทำการ
8462	4266	5	1	2567	1	14	t	f	\N	วันทำการ
8463	4267	5	1	2567	1	14	f	f	\N	วันหยุด
8464	4268	5	1	2567	1	14	f	f	\N	วันหยุด
8465	4269	5	1	2567	1	15	t	f	\N	วันทำการ
8466	4270	5	1	2567	1	15	t	f	\N	วันทำการ
8467	4271	5	1	2567	1	15	t	f	\N	วันทำการ
8468	4272	5	1	2567	1	15	t	f	\N	วันทำการ
8469	4273	5	1	2567	1	15	t	f	\N	วันทำการ
8470	4274	5	1	2567	1	15	f	f	\N	วันหยุด
8471	4275	5	1	2567	1	15	f	f	\N	วันหยุด
8472	4276	5	1	2567	1	16	t	f	\N	วันทำการ
8473	4277	5	1	2567	1	16	t	f	\N	วันทำการ
8474	4278	5	1	2567	1	16	t	f	\N	วันทำการ
8475	4279	5	1	2567	1	16	t	f	\N	วันทำการ
8476	4280	5	1	2567	1	16	t	f	\N	วันทำการ
8477	4281	5	1	2567	1	16	f	f	\N	วันหยุด
8478	4282	5	1	2567	1	16	f	t	วันนวมินทรมหาราช	วันหยุดนักขัตฤกษ์
8479	4283	5	1	2567	1	17	f	t	วันหยุดชดเชยวันคล้ายวันสวรรคตของพระบาทสมเด็จพระปรมินทรมหาภูมิพลอดุลยเดชบรมนาถบพิตร	วันหยุดนักขัตฤกษ์
8480	4284	5	1	2567	1	17	t	f	\N	วันทำการ
8481	4285	5	1	2567	1	17	t	f	\N	วันทำการ
8482	4286	5	1	2567	1	17	t	f	\N	วันทำการ
8483	4287	5	1	2567	1	17	t	f	\N	วันทำการ
8484	4288	5	1	2567	1	17	f	f	\N	วันหยุด
8485	4289	5	1	2567	1	17	f	f	\N	วันหยุด
8486	4290	5	1	2567	1	18	t	f	\N	วันทำการ
8487	4291	5	1	2567	1	18	t	f	\N	วันทำการ
8488	4292	5	1	2567	1	18	f	t	วันปิยมหาราช	วันหยุดนักขัตฤกษ์
8489	4293	5	1	2567	1	18	t	f	\N	วันทำการ
8490	4294	5	1	2567	1	18	t	f	\N	วันทำการ
8491	4295	5	1	2567	1	18	f	f	\N	วันหยุด
8492	4296	5	1	2567	1	18	f	f	\N	วันหยุด
8493	4297	5	1	2567	\N	\N	f	f	\N	ปิดภาค
8494	4298	5	1	2567	\N	\N	f	f	\N	ปิดภาค
8495	4299	5	1	2567	\N	\N	f	f	\N	ปิดภาค
8496	4300	5	1	2567	\N	\N	f	f	\N	ปิดภาค
8497	4301	5	1	2567	\N	\N	f	f	\N	ปิดภาค
8498	4302	5	1	2567	\N	\N	f	f	\N	วันหยุด
8499	4303	5	1	2567	\N	\N	f	f	\N	วันหยุด
8500	4304	5	1	2567	\N	\N	f	f	\N	ปิดภาค
8501	4305	5	1	2567	\N	\N	f	f	\N	ปิดภาค
8502	4306	5	1	2567	\N	\N	f	f	\N	ปิดภาค
8503	4307	5	1	2567	\N	\N	f	f	\N	ปิดภาค
8504	4308	5	1	2567	\N	\N	f	f	\N	ปิดภาค
8505	4309	5	1	2567	\N	\N	f	f	\N	วันหยุด
8506	4310	5	1	2567	\N	\N	f	f	\N	วันหยุด
8507	4311	5	1	2567	\N	\N	f	f	\N	ปิดภาค
8508	4312	5	1	2567	\N	\N	f	f	\N	ปิดภาค
8509	4313	5	1	2567	\N	\N	f	f	\N	ปิดภาค
8510	4314	5	1	2567	\N	\N	f	f	\N	ปิดภาค
8511	4315	5	1	2567	\N	\N	f	f	\N	ปิดภาค
8512	4316	5	1	2567	\N	\N	f	f	\N	วันหยุด
8513	4317	5	1	2567	\N	\N	f	f	\N	วันหยุด
8514	4318	5	1	2567	2	1	t	f	\N	วันทำการ
8515	4319	5	1	2567	2	1	t	f	\N	วันทำการ
8516	4320	5	1	2567	2	1	t	f	\N	วันทำการ
8517	4321	5	1	2567	2	1	t	f	\N	วันทำการ
8518	4322	5	1	2567	2	1	t	f	\N	วันทำการ
8519	4323	5	1	2567	2	1	f	f	\N	วันหยุด
8520	4324	5	1	2567	2	1	f	f	\N	วันหยุด
8521	4325	5	1	2567	2	2	t	f	\N	วันทำการ
8522	4326	5	1	2567	2	2	t	f	\N	วันทำการ
8523	4327	5	1	2567	2	2	t	f	\N	วันทำการ
8524	4328	5	1	2567	2	2	t	f	\N	วันทำการ
8525	4329	5	1	2567	2	2	t	f	\N	วันทำการ
8526	4330	5	1	2567	2	2	f	f	\N	วันหยุด
8527	4331	5	1	2567	2	2	f	f	\N	วันหยุด
8528	4332	5	1	2567	2	3	t	f	\N	วันทำการ
8529	4333	5	1	2567	2	3	t	f	\N	วันทำการ
8530	4334	5	1	2567	2	3	t	f	\N	วันทำการ
8531	4335	5	1	2567	2	3	f	t	วันพ่อแห่งชาติ	วันหยุดนักขัตฤกษ์
8532	4336	5	1	2567	2	3	t	f	\N	วันทำการ
8533	4337	5	1	2567	2	3	f	f	\N	วันหยุด
8534	4338	5	1	2567	2	3	f	f	\N	วันหยุด
8535	4339	5	1	2567	2	4	t	f	\N	วันทำการ
8536	4340	5	1	2567	2	4	f	t	วันรัฐธรรมนูญ	วันหยุดนักขัตฤกษ์
8537	4341	5	1	2567	2	4	t	f	\N	วันทำการ
8538	4342	5	1	2567	2	4	t	f	\N	วันทำการ
8539	4343	5	1	2567	2	4	t	f	\N	วันทำการ
8540	4344	5	1	2567	2	4	f	f	\N	วันหยุด
8541	4345	5	1	2567	2	4	f	f	\N	วันหยุด
8542	4346	5	1	2567	2	5	t	f	\N	วันทำการ
8543	4347	5	1	2567	2	5	t	f	\N	วันทำการ
8544	4348	5	1	2567	2	5	t	f	\N	วันทำการ
8545	4349	5	1	2567	2	5	t	f	\N	วันทำการ
8546	4350	5	1	2567	2	5	t	f	\N	วันทำการ
8547	4351	5	1	2567	2	5	f	f	\N	วันหยุด
8548	4352	5	1	2567	2	5	f	f	\N	วันหยุด
8549	4353	5	1	2567	2	6	t	f	\N	วันทำการ
8550	4354	5	1	2567	2	6	f	t	วันคริสต์มาสอีฟ	วันหยุดนักขัตฤกษ์
8551	4355	5	1	2567	2	6	f	t	วันคริสต์มาส	วันหยุดนักขัตฤกษ์
8552	4356	5	1	2567	2	6	t	f	\N	วันทำการ
8553	4357	5	1	2567	2	6	t	f	\N	วันทำการ
8554	4358	5	1	2567	2	6	f	f	\N	วันหยุด
8555	4359	5	1	2567	2	6	f	f	\N	วันหยุด
8556	4360	5	1	2567	2	7	f	t	วันหยุดราชการธันวาคม	วันหยุดนักขัตฤกษ์
8557	4361	5	1	2567	2	7	f	t	วันสิ้นปี	วันหยุดนักขัตฤกษ์
8558	4362	5	1	2567	2	7	f	t	วันขึ้นปีใหม่	วันหยุดนักขัตฤกษ์
8559	4363	5	1	2567	2	7	f	t	วันหยุดพิเศษ (ครม.)	วันหยุดนักขัตฤกษ์
8560	4364	5	1	2567	2	7	t	f	\N	วันทำการ
8561	4365	5	1	2567	2	7	f	f	\N	วันหยุด
8562	4366	5	1	2567	2	7	f	f	\N	วันหยุด
8563	4367	5	1	2567	2	8	t	f	\N	วันทำการ
8564	4368	5	1	2567	2	8	t	f	\N	วันทำการ
8565	4369	5	1	2567	2	8	t	f	\N	วันทำการ
8566	4370	5	1	2567	2	8	t	f	\N	วันทำการ
8567	4371	5	1	2567	2	8	t	f	\N	วันทำการ
8568	4372	5	1	2567	2	8	f	f	\N	วันหยุด
8569	4373	5	1	2567	2	8	f	f	\N	วันหยุด
8570	4374	5	1	2567	2	9	t	f	\N	วันทำการ
8571	4375	5	1	2567	2	9	t	f	\N	วันทำการ
8572	4376	5	1	2567	2	9	t	f	\N	วันทำการ
8573	4377	5	1	2567	2	9	t	f	\N	วันทำการ
8574	4378	5	1	2567	2	9	t	f	\N	วันทำการ
8575	4379	5	1	2567	2	9	f	f	\N	วันหยุด
8576	4380	5	1	2567	2	9	f	f	\N	วันหยุด
8577	4381	5	1	2567	2	10	t	f	\N	วันทำการ
8578	4382	5	1	2567	2	10	t	f	\N	วันทำการ
8579	4383	5	1	2567	2	10	t	f	\N	วันทำการ
8580	4384	5	1	2567	2	10	t	f	\N	วันทำการ
8581	4385	5	1	2567	2	10	t	f	\N	วันทำการ
8582	4386	5	1	2567	2	10	f	f	\N	วันหยุด
8583	4387	5	1	2567	2	10	f	f	\N	วันหยุด
8584	4388	5	1	2567	2	11	t	f	\N	วันทำการ
8585	4389	5	1	2567	2	11	t	f	\N	วันทำการ
8586	4390	5	1	2567	2	11	f	t	วันตรุษจีน	วันหยุดนักขัตฤกษ์
8587	4391	5	1	2567	2	11	f	t	วันตรุษจีน (วันที่ 2)	วันหยุดนักขัตฤกษ์
8588	4392	5	1	2567	2	11	f	t	วันตรุษจีน (วันที่ 3)	วันหยุดนักขัตฤกษ์
8589	4393	5	1	2567	2	11	f	f	\N	วันหยุด
8590	4394	5	1	2567	2	11	f	f	\N	วันหยุด
8591	4395	5	1	2567	2	12	t	f	\N	วันทำการ
8592	4396	5	1	2567	2	12	t	f	\N	วันทำการ
8593	4397	5	1	2567	2	12	t	f	\N	วันทำการ
8594	4398	5	1	2567	2	12	t	f	\N	วันทำการ
8595	4399	5	1	2567	2	12	t	f	\N	วันทำการ
8596	4400	5	1	2567	2	12	f	f	\N	วันหยุด
8597	4401	5	1	2567	2	12	f	f	\N	วันหยุด
8598	4402	5	1	2567	2	13	t	f	\N	วันทำการ
8599	4403	5	1	2567	2	13	t	f	\N	วันทำการ
8600	4404	5	1	2567	2	13	f	t	วันมาฆบูชา	วันหยุดนักขัตฤกษ์
8601	4405	5	1	2567	2	13	t	f	\N	วันทำการ
8602	4406	5	1	2567	2	13	f	t	วันวาเลนไทน์	วันหยุดนักขัตฤกษ์
8603	4407	5	1	2567	2	13	f	f	\N	วันหยุด
8604	4408	5	1	2567	2	13	f	f	\N	วันหยุด
8605	4409	5	1	2567	2	14	t	f	\N	วันทำการ
8606	4410	5	1	2567	2	14	t	f	\N	วันทำการ
8607	4411	5	1	2567	2	14	t	f	\N	วันทำการ
8608	4412	5	1	2567	2	14	t	f	\N	วันทำการ
8609	4413	5	1	2567	2	14	t	f	\N	วันทำการ
8610	4414	5	1	2567	2	14	f	f	\N	วันหยุด
8611	4415	5	1	2567	2	14	f	f	\N	วันหยุด
8612	4416	5	1	2567	2	15	t	f	\N	วันทำการ
8613	4417	5	1	2567	2	15	t	f	\N	วันทำการ
8614	4418	5	1	2567	2	15	t	f	\N	วันทำการ
8615	4419	5	1	2567	2	15	t	f	\N	วันทำการ
8616	4420	5	1	2567	2	15	t	f	\N	วันทำการ
8617	4421	5	1	2567	2	15	f	f	\N	วันหยุด
8618	4422	5	1	2567	2	15	f	f	\N	วันหยุด
8619	4423	5	1	2567	2	16	t	f	\N	วันทำการ
8620	4424	5	1	2567	2	16	t	f	\N	วันทำการ
8621	4425	5	1	2567	2	16	t	f	\N	วันทำการ
8622	4426	5	1	2567	2	16	t	f	\N	วันทำการ
8623	4427	5	1	2567	2	16	t	f	\N	วันทำการ
8624	4428	5	1	2567	2	16	f	f	\N	วันหยุด
8625	4429	5	1	2567	2	16	f	f	\N	วันหยุด
8626	4430	5	1	2567	2	17	t	f	\N	วันทำการ
8627	4431	5	1	2567	2	17	t	f	\N	วันทำการ
8628	4432	5	1	2567	2	17	t	f	\N	วันทำการ
8629	4433	5	1	2567	2	17	t	f	\N	วันทำการ
8630	4434	5	1	2567	2	17	t	f	\N	วันทำการ
8631	4435	5	1	2567	2	17	f	f	\N	วันหยุด
8632	4436	5	1	2567	2	17	f	f	\N	วันหยุด
8633	4437	5	1	2567	2	18	t	f	\N	วันทำการ
8634	4438	5	1	2567	2	18	t	f	\N	วันทำการ
8635	4439	5	1	2567	2	18	t	f	\N	วันทำการ
8636	4440	5	1	2567	2	18	t	f	\N	วันทำการ
8637	4441	5	1	2567	2	18	t	f	\N	วันทำการ
8638	4442	5	1	2567	2	18	f	f	\N	วันหยุด
8639	4443	5	1	2567	\N	\N	f	f	\N	วันหยุด
8640	4444	5	1	2567	\N	\N	f	f	\N	ปิดภาค
8641	4445	5	1	2567	\N	\N	f	f	\N	ปิดภาค
8642	4446	5	1	2567	\N	\N	f	f	\N	ปิดภาค
8643	4447	5	1	2567	\N	\N	f	f	\N	ปิดภาค
8644	4448	5	1	2567	\N	\N	f	f	\N	ปิดภาค
8645	4449	5	1	2567	\N	\N	f	f	\N	วันหยุด
8646	4450	5	1	2567	\N	\N	f	f	\N	วันหยุด
8647	4451	5	1	2567	\N	\N	f	f	\N	ปิดภาค
8648	4452	5	1	2567	\N	\N	f	f	\N	ปิดภาค
8649	4453	5	1	2567	\N	\N	f	f	\N	ปิดภาค
8650	4454	5	1	2567	\N	\N	f	f	\N	ปิดภาค
8651	4455	5	1	2567	\N	\N	f	f	\N	ปิดภาค
8652	4456	5	1	2567	\N	\N	f	f	\N	วันหยุด
8653	4457	5	1	2567	\N	\N	f	t	วันจักรี	วันหยุดนักขัตฤกษ์
8654	4458	5	1	2567	\N	\N	f	t	ชดเชยวันจักรี	วันหยุดนักขัตฤกษ์
8655	4459	5	1	2567	\N	\N	f	f	\N	ปิดภาค
8656	4460	5	1	2567	\N	\N	f	f	\N	ปิดภาค
8657	4461	5	1	2567	\N	\N	f	f	\N	ปิดภาค
8658	4462	5	1	2567	\N	\N	f	f	\N	ปิดภาค
8659	4463	5	1	2567	\N	\N	f	f	\N	วันหยุด
8660	4464	5	1	2567	\N	\N	f	t	วันสงกรานต์	วันหยุดนักขัตฤกษ์
8661	4465	5	1	2567	\N	\N	f	t	วันสงกรานต์	วันหยุดนักขัตฤกษ์
8662	4466	5	1	2567	\N	\N	f	t	วันสงกรานต์	วันหยุดนักขัตฤกษ์
8663	4467	5	1	2567	\N	\N	f	t	วันหยุดชดเชยวันสงกรานต์	วันหยุดนักขัตฤกษ์
8664	4468	5	1	2567	3	1	t	f	\N	วันทำการ
8665	4469	5	1	2567	3	1	t	f	\N	วันทำการ
8666	4470	5	1	2567	3	1	f	f	\N	วันหยุด
8667	4471	5	1	2567	3	1	f	f	\N	วันหยุด
8668	4472	5	1	2567	3	2	t	f	\N	วันทำการ
8669	4473	5	1	2567	3	2	t	f	\N	วันทำการ
8670	4474	5	1	2567	3	2	t	f	\N	วันทำการ
8671	4475	5	1	2567	3	2	t	f	\N	วันทำการ
8672	4476	5	1	2567	3	2	t	f	\N	วันทำการ
8673	4477	5	1	2567	3	2	f	f	\N	วันหยุด
8674	4478	5	1	2567	3	2	f	f	\N	วันหยุด
8675	4479	5	1	2567	3	3	t	f	\N	วันทำการ
8676	4480	5	1	2567	3	3	t	f	\N	วันทำการ
8677	4481	5	1	2567	3	3	t	f	\N	วันทำการ
8678	4482	5	1	2567	3	3	f	t	วันแรงงานแห่งชาติ	วันหยุดนักขัตฤกษ์
8679	4483	5	1	2567	3	3	t	f	\N	วันทำการ
8680	4484	5	1	2567	3	3	f	f	\N	วันหยุด
8681	4485	5	1	2567	3	3	f	t	วันฉัตรมงคล	วันหยุดนักขัตฤกษ์
8682	4486	5	1	2567	3	4	f	t	ชดเชยวันฉัตรมงคล	วันหยุดนักขัตฤกษ์
8683	4487	5	1	2567	3	4	t	f	\N	วันทำการ
8684	4488	5	1	2567	3	4	t	f	\N	วันทำการ
8685	4489	5	1	2567	3	4	t	f	\N	วันทำการ
8686	4490	5	1	2567	3	4	f	t	วันพืชมงคล	วันหยุดนักขัตฤกษ์
8687	4491	5	1	2567	3	4	f	f	\N	วันหยุด
8688	4492	5	1	2567	3	4	f	t	วันวิสาขบูชา	วันหยุดนักขัตฤกษ์
8689	4493	5	1	2567	3	5	f	t	วันหยุดชดเชยวันวิสาขบูชา	วันหยุดนักขัตฤกษ์
8690	4494	5	1	2567	3	5	t	f	\N	วันทำการ
8691	4495	5	1	2567	3	5	t	f	\N	วันทำการ
8692	4496	5	1	2567	3	5	t	f	\N	วันทำการ
8693	4497	5	1	2567	3	5	t	f	\N	วันทำการ
8694	4498	5	1	2567	3	5	f	f	\N	วันหยุด
8695	4499	5	1	2567	3	5	f	f	\N	วันหยุด
8696	4500	5	1	2567	3	6	t	f	\N	วันทำการ
8697	4501	5	1	2567	3	6	t	f	\N	วันทำการ
8698	4502	5	1	2567	3	6	t	f	\N	วันทำการ
8699	4503	5	1	2567	3	6	t	f	\N	วันทำการ
8700	4504	5	1	2567	3	6	t	f	\N	วันทำการ
8701	4505	5	1	2567	3	6	f	f	\N	วันหยุด
8702	4506	5	1	2567	3	6	f	f	\N	วันหยุด
8703	4507	5	1	2567	3	7	t	f	\N	วันทำการ
8704	4508	5	1	2567	3	7	t	f	\N	วันทำการ
8705	4509	5	1	2567	3	7	t	f	\N	วันทำการ
8706	4510	5	1	2567	3	7	t	f	\N	วันทำการ
8707	4511	5	1	2567	3	7	t	f	\N	วันทำการ
8708	4512	5	1	2567	3	7	f	f	\N	วันหยุด
8709	4513	5	1	2567	3	7	f	f	\N	วันหยุด
8710	4514	5	1	2567	3	8	f	t	นักขัตฤกษ์	วันหยุดนักขัตฤกษ์
8711	4515	5	1	2567	3	8	f	t	วันเฉลิมฯ พระราชินี	วันหยุดนักขัตฤกษ์
8712	4516	5	1	2567	3	8	t	f	\N	วันทำการ
8713	4517	5	1	2567	3	8	t	f	\N	วันทำการ
8714	4518	5	1	2567	3	8	t	f	\N	วันทำการ
8715	4519	5	1	2567	3	8	f	f	\N	วันหยุด
8716	4520	5	1	2567	3	8	f	f	\N	วันหยุด
8717	4171	6	1	2567	1	1	t	f	\N	วันทำการ
8718	4172	6	1	2567	1	1	t	f	\N	วันทำการ
8719	4173	6	1	2567	1	1	t	f	\N	วันทำการ
8720	4174	6	1	2567	1	1	t	f	\N	วันทำการ
8721	4175	6	1	2567	1	1	t	f	\N	วันทำการ
8722	4176	6	1	2567	1	1	f	f	\N	วันหยุด
8723	4177	6	1	2567	1	1	f	f	\N	วันหยุด
8724	4178	6	1	2567	1	2	t	f	\N	วันทำการ
8725	4179	6	1	2567	1	2	t	f	\N	วันทำการ
8726	4180	6	1	2567	1	2	t	f	\N	วันทำการ
8727	4181	6	1	2567	1	2	t	f	\N	วันทำการ
8728	4182	6	1	2567	1	2	t	f	\N	วันทำการ
8729	4183	6	1	2567	1	2	f	f	\N	วันหยุด
8730	4184	6	1	2567	1	2	f	f	\N	วันหยุด
8731	4185	6	1	2567	1	3	t	f	\N	วันทำการ
8732	4186	6	1	2567	1	3	t	f	\N	วันทำการ
8733	4187	6	1	2567	1	3	t	f	\N	วันทำการ
8734	4188	6	1	2567	1	3	t	f	\N	วันทำการ
8735	4189	6	1	2567	1	3	t	f	\N	วันทำการ
8736	4190	6	1	2567	1	3	f	f	\N	วันหยุด
8737	4191	6	1	2567	1	3	f	f	\N	วันหยุด
8738	4192	6	1	2567	1	4	t	f	\N	วันทำการ
8739	4193	6	1	2567	1	4	t	f	\N	วันทำการ
8740	4194	6	1	2567	1	4	t	f	\N	วันทำการ
8741	4195	6	1	2567	1	4	t	f	\N	วันทำการ
8742	4196	6	1	2567	1	4	t	f	\N	วันทำการ
8743	4197	6	1	2567	1	4	f	t	วันอาสาฬหบูชา	วันหยุดนักขัตฤกษ์
8744	4198	6	1	2567	1	4	f	f	\N	วันหยุด
8745	4199	6	1	2567	1	5	f	t	วันหยุดชดเชยวันอาสาฬหบูชา	วันหยุดนักขัตฤกษ์
8746	4200	6	1	2567	1	5	t	f	\N	วันทำการ
8747	4201	6	1	2567	1	5	t	f	\N	วันทำการ
8748	4202	6	1	2567	1	5	t	f	\N	วันทำการ
8749	4203	6	1	2567	1	5	t	f	\N	วันทำการ
8750	4204	6	1	2567	1	5	f	f	\N	วันหยุด
8751	4205	6	1	2567	1	5	f	t	วันเฉลิมฯ ร.10	วันหยุดนักขัตฤกษ์
8752	4206	6	1	2567	1	6	f	t	วันหยุดชดเชยวันเฉลิมพระชนมพรรษา สมเด็จพระเจ้าอยู่หัวมหาวชิราลงกรณ บดินทรเทพยวรางกูร	วันหยุดนักขัตฤกษ์
8753	4207	6	1	2567	1	6	t	f	\N	วันทำการ
8754	4208	6	1	2567	1	6	t	f	\N	วันทำการ
8755	4209	6	1	2567	1	6	t	f	\N	วันทำการ
8756	4210	6	1	2567	1	6	t	f	\N	วันทำการ
8757	4211	6	1	2567	1	6	f	f	\N	วันหยุด
8758	4212	6	1	2567	1	6	f	f	\N	วันหยุด
8759	4213	6	1	2567	1	7	t	f	\N	วันทำการ
8760	4214	6	1	2567	1	7	t	f	\N	วันทำการ
8761	4215	6	1	2567	1	7	t	f	\N	วันทำการ
8762	4216	6	1	2567	1	7	t	f	\N	วันทำการ
8763	4217	6	1	2567	1	7	t	f	\N	วันทำการ
8764	4218	6	1	2567	1	7	f	f	\N	วันหยุด
8765	4219	6	1	2567	1	7	f	f	\N	วันหยุด
8766	4220	6	1	2567	1	8	f	t	วันแม่แห่งชาติ	วันหยุดนักขัตฤกษ์
8767	4221	6	1	2567	1	8	t	f	\N	วันทำการ
8768	4222	6	1	2567	1	8	t	f	\N	วันทำการ
8769	4223	6	1	2567	1	8	t	f	\N	วันทำการ
8770	4224	6	1	2567	1	8	t	f	\N	วันทำการ
8771	4225	6	1	2567	1	8	f	f	\N	วันหยุด
8772	4226	6	1	2567	1	8	f	f	\N	วันหยุด
8773	4227	6	1	2567	1	9	t	f	\N	วันทำการ
8774	4228	6	1	2567	1	9	t	f	\N	วันทำการ
8775	4229	6	1	2567	1	9	t	f	\N	วันทำการ
8776	4230	6	1	2567	1	9	t	f	\N	วันทำการ
8777	4231	6	1	2567	1	9	t	f	\N	วันทำการ
8778	4232	6	1	2567	1	9	f	f	\N	วันหยุด
8779	4233	6	1	2567	1	9	f	f	\N	วันหยุด
8780	4234	6	1	2567	1	10	t	f	\N	วันทำการ
8781	4235	6	1	2567	1	10	t	f	\N	วันทำการ
8782	4236	6	1	2567	1	10	t	f	\N	วันทำการ
8783	4237	6	1	2567	1	10	t	f	\N	วันทำการ
8784	4238	6	1	2567	1	10	t	f	\N	วันทำการ
8785	4239	6	1	2567	1	10	f	f	\N	วันหยุด
8786	4240	6	1	2567	1	10	f	f	\N	วันหยุด
8787	4241	6	1	2567	1	11	t	f	\N	วันทำการ
8788	4242	6	1	2567	1	11	t	f	\N	วันทำการ
8789	4243	6	1	2567	1	11	t	f	\N	วันทำการ
8790	4244	6	1	2567	1	11	t	f	\N	วันทำการ
8791	4245	6	1	2567	1	11	t	f	\N	วันทำการ
8792	4246	6	1	2567	1	11	f	f	\N	วันหยุด
8793	4247	6	1	2567	1	11	f	f	\N	วันหยุด
8794	4248	6	1	2567	1	12	t	f	\N	วันทำการ
8795	4249	6	1	2567	1	12	t	f	\N	วันทำการ
8796	4250	6	1	2567	1	12	t	f	\N	วันทำการ
8797	4251	6	1	2567	1	12	t	f	\N	วันทำการ
8798	4252	6	1	2567	1	12	t	f	\N	วันทำการ
8799	4253	6	1	2567	1	12	f	f	\N	วันหยุด
8800	4254	6	1	2567	1	12	f	f	\N	วันหยุด
8801	4255	6	1	2567	1	13	t	f	\N	วันทำการ
8802	4256	6	1	2567	1	13	t	f	\N	วันทำการ
8803	4257	6	1	2567	1	13	t	f	\N	วันทำการ
8804	4258	6	1	2567	1	13	t	f	\N	วันทำการ
8805	4259	6	1	2567	1	13	t	f	\N	วันทำการ
8806	4260	6	1	2567	1	13	f	f	\N	วันหยุด
8807	4261	6	1	2567	1	13	f	t	วันสงขลานครินทร์	วันหยุดนักขัตฤกษ์
8808	4262	6	1	2567	1	14	f	t	ชดเชยวันสงขลานครินทร์	วันหยุดนักขัตฤกษ์
8809	4263	6	1	2567	1	14	t	f	\N	วันทำการ
8810	4264	6	1	2567	1	14	t	f	\N	วันทำการ
8811	4265	6	1	2567	1	14	t	f	\N	วันทำการ
8812	4266	6	1	2567	1	14	t	f	\N	วันทำการ
8813	4267	6	1	2567	1	14	f	f	\N	วันหยุด
8814	4268	6	1	2567	1	14	f	f	\N	วันหยุด
8815	4269	6	1	2567	1	15	t	f	\N	วันทำการ
8816	4270	6	1	2567	1	15	t	f	\N	วันทำการ
8817	4271	6	1	2567	1	15	t	f	\N	วันทำการ
8818	4272	6	1	2567	1	15	t	f	\N	วันทำการ
8819	4273	6	1	2567	1	15	t	f	\N	วันทำการ
8820	4274	6	1	2567	1	15	f	f	\N	วันหยุด
8821	4275	6	1	2567	1	15	f	f	\N	วันหยุด
8822	4276	6	1	2567	1	16	t	f	\N	วันทำการ
8823	4277	6	1	2567	1	16	t	f	\N	วันทำการ
8824	4278	6	1	2567	1	16	t	f	\N	วันทำการ
8825	4279	6	1	2567	1	16	t	f	\N	วันทำการ
8826	4280	6	1	2567	1	16	t	f	\N	วันทำการ
8827	4281	6	1	2567	1	16	f	f	\N	วันหยุด
8828	4282	6	1	2567	1	16	f	t	วันนวมินทรมหาราช	วันหยุดนักขัตฤกษ์
8829	4283	6	1	2567	1	17	f	t	วันหยุดชดเชยวันคล้ายวันสวรรคตของพระบาทสมเด็จพระปรมินทรมหาภูมิพลอดุลยเดชบรมนาถบพิตร	วันหยุดนักขัตฤกษ์
8830	4284	6	1	2567	1	17	t	f	\N	วันทำการ
8831	4285	6	1	2567	1	17	t	f	\N	วันทำการ
8832	4286	6	1	2567	1	17	t	f	\N	วันทำการ
8833	4287	6	1	2567	1	17	t	f	\N	วันทำการ
8834	4288	6	1	2567	1	17	f	f	\N	วันหยุด
8835	4289	6	1	2567	1	17	f	f	\N	วันหยุด
8836	4290	6	1	2567	1	18	t	f	\N	วันทำการ
8837	4291	6	1	2567	1	18	t	f	\N	วันทำการ
8838	4292	6	1	2567	1	18	f	t	วันปิยมหาราช	วันหยุดนักขัตฤกษ์
8839	4293	6	1	2567	1	18	t	f	\N	วันทำการ
8840	4294	6	1	2567	1	18	t	f	\N	วันทำการ
8841	4295	6	1	2567	1	18	f	f	\N	วันหยุด
8842	4296	6	1	2567	1	18	f	f	\N	วันหยุด
8843	4297	6	1	2567	\N	\N	f	f	\N	ปิดภาค
8844	4298	6	1	2567	\N	\N	f	f	\N	ปิดภาค
8845	4299	6	1	2567	\N	\N	f	f	\N	ปิดภาค
8846	4300	6	1	2567	\N	\N	f	f	\N	ปิดภาค
8847	4301	6	1	2567	\N	\N	f	f	\N	ปิดภาค
8848	4302	6	1	2567	\N	\N	f	f	\N	วันหยุด
8849	4303	6	1	2567	\N	\N	f	f	\N	วันหยุด
8850	4304	6	1	2567	\N	\N	f	f	\N	ปิดภาค
8851	4305	6	1	2567	\N	\N	f	f	\N	ปิดภาค
8852	4306	6	1	2567	\N	\N	f	f	\N	ปิดภาค
8853	4307	6	1	2567	\N	\N	f	f	\N	ปิดภาค
8854	4308	6	1	2567	\N	\N	f	f	\N	ปิดภาค
8855	4309	6	1	2567	\N	\N	f	f	\N	วันหยุด
8856	4310	6	1	2567	\N	\N	f	f	\N	วันหยุด
8857	4311	6	1	2567	\N	\N	f	f	\N	ปิดภาค
8858	4312	6	1	2567	\N	\N	f	f	\N	ปิดภาค
8859	4313	6	1	2567	\N	\N	f	f	\N	ปิดภาค
8860	4314	6	1	2567	\N	\N	f	f	\N	ปิดภาค
8861	4315	6	1	2567	\N	\N	f	f	\N	ปิดภาค
8862	4316	6	1	2567	\N	\N	f	f	\N	วันหยุด
8863	4317	6	1	2567	\N	\N	f	f	\N	วันหยุด
8864	4318	6	1	2567	2	1	t	f	\N	วันทำการ
8865	4319	6	1	2567	2	1	t	f	\N	วันทำการ
8866	4320	6	1	2567	2	1	t	f	\N	วันทำการ
8867	4321	6	1	2567	2	1	t	f	\N	วันทำการ
8868	4322	6	1	2567	2	1	t	f	\N	วันทำการ
8869	4323	6	1	2567	2	1	f	f	\N	วันหยุด
8870	4324	6	1	2567	2	1	f	f	\N	วันหยุด
8871	4325	6	1	2567	2	2	t	f	\N	วันทำการ
8872	4326	6	1	2567	2	2	t	f	\N	วันทำการ
8873	4327	6	1	2567	2	2	t	f	\N	วันทำการ
8874	4328	6	1	2567	2	2	t	f	\N	วันทำการ
8875	4329	6	1	2567	2	2	t	f	\N	วันทำการ
8876	4330	6	1	2567	2	2	f	f	\N	วันหยุด
8877	4331	6	1	2567	2	2	f	f	\N	วันหยุด
8878	4332	6	1	2567	2	3	t	f	\N	วันทำการ
8879	4333	6	1	2567	2	3	t	f	\N	วันทำการ
8880	4334	6	1	2567	2	3	t	f	\N	วันทำการ
8881	4335	6	1	2567	2	3	f	t	วันพ่อแห่งชาติ	วันหยุดนักขัตฤกษ์
8882	4336	6	1	2567	2	3	t	f	\N	วันทำการ
8883	4337	6	1	2567	2	3	f	f	\N	วันหยุด
8884	4338	6	1	2567	2	3	f	f	\N	วันหยุด
8885	4339	6	1	2567	2	4	t	f	\N	วันทำการ
8886	4340	6	1	2567	2	4	f	t	วันรัฐธรรมนูญ	วันหยุดนักขัตฤกษ์
8887	4341	6	1	2567	2	4	t	f	\N	วันทำการ
8888	4342	6	1	2567	2	4	t	f	\N	วันทำการ
8889	4343	6	1	2567	2	4	t	f	\N	วันทำการ
8890	4344	6	1	2567	2	4	f	f	\N	วันหยุด
8891	4345	6	1	2567	2	4	f	f	\N	วันหยุด
8892	4346	6	1	2567	2	5	t	f	\N	วันทำการ
8893	4347	6	1	2567	2	5	t	f	\N	วันทำการ
8894	4348	6	1	2567	2	5	t	f	\N	วันทำการ
8895	4349	6	1	2567	2	5	t	f	\N	วันทำการ
8896	4350	6	1	2567	2	5	t	f	\N	วันทำการ
8897	4351	6	1	2567	2	5	f	f	\N	วันหยุด
8898	4352	6	1	2567	2	5	f	f	\N	วันหยุด
8899	4353	6	1	2567	2	6	t	f	\N	วันทำการ
8900	4354	6	1	2567	2	6	f	t	วันคริสต์มาสอีฟ	วันหยุดนักขัตฤกษ์
8901	4355	6	1	2567	2	6	f	t	วันคริสต์มาส	วันหยุดนักขัตฤกษ์
8902	4356	6	1	2567	2	6	t	f	\N	วันทำการ
8903	4357	6	1	2567	2	6	t	f	\N	วันทำการ
8904	4358	6	1	2567	2	6	f	f	\N	วันหยุด
8905	4359	6	1	2567	2	6	f	f	\N	วันหยุด
8906	4360	6	1	2567	2	7	f	t	วันหยุดราชการธันวาคม	วันหยุดนักขัตฤกษ์
8907	4361	6	1	2567	2	7	f	t	วันสิ้นปี	วันหยุดนักขัตฤกษ์
8908	4362	6	1	2567	2	7	f	t	วันขึ้นปีใหม่	วันหยุดนักขัตฤกษ์
8909	4363	6	1	2567	2	7	f	t	วันหยุดพิเศษ (ครม.)	วันหยุดนักขัตฤกษ์
8910	4364	6	1	2567	2	7	t	f	\N	วันทำการ
8911	4365	6	1	2567	2	7	f	f	\N	วันหยุด
8912	4366	6	1	2567	2	7	f	f	\N	วันหยุด
8913	4367	6	1	2567	2	8	t	f	\N	วันทำการ
8914	4368	6	1	2567	2	8	t	f	\N	วันทำการ
8915	4369	6	1	2567	2	8	t	f	\N	วันทำการ
8916	4370	6	1	2567	2	8	t	f	\N	วันทำการ
8917	4371	6	1	2567	2	8	t	f	\N	วันทำการ
8918	4372	6	1	2567	2	8	f	f	\N	วันหยุด
8919	4373	6	1	2567	2	8	f	f	\N	วันหยุด
8920	4374	6	1	2567	2	9	t	f	\N	วันทำการ
8921	4375	6	1	2567	2	9	t	f	\N	วันทำการ
8922	4376	6	1	2567	2	9	t	f	\N	วันทำการ
8923	4377	6	1	2567	2	9	t	f	\N	วันทำการ
8924	4378	6	1	2567	2	9	t	f	\N	วันทำการ
8925	4379	6	1	2567	2	9	f	f	\N	วันหยุด
8926	4380	6	1	2567	2	9	f	f	\N	วันหยุด
8927	4381	6	1	2567	2	10	t	f	\N	วันทำการ
8928	4382	6	1	2567	2	10	t	f	\N	วันทำการ
8929	4383	6	1	2567	2	10	t	f	\N	วันทำการ
8930	4384	6	1	2567	2	10	t	f	\N	วันทำการ
8931	4385	6	1	2567	2	10	t	f	\N	วันทำการ
8932	4386	6	1	2567	2	10	f	f	\N	วันหยุด
8933	4387	6	1	2567	2	10	f	f	\N	วันหยุด
8934	4388	6	1	2567	2	11	t	f	\N	วันทำการ
8935	4389	6	1	2567	2	11	t	f	\N	วันทำการ
8936	4390	6	1	2567	2	11	f	t	วันตรุษจีน	วันหยุดนักขัตฤกษ์
8937	4391	6	1	2567	2	11	f	t	วันตรุษจีน (วันที่ 2)	วันหยุดนักขัตฤกษ์
8938	4392	6	1	2567	2	11	f	t	วันตรุษจีน (วันที่ 3)	วันหยุดนักขัตฤกษ์
8939	4393	6	1	2567	2	11	f	f	\N	วันหยุด
8940	4394	6	1	2567	2	11	f	f	\N	วันหยุด
8941	4395	6	1	2567	2	12	t	f	\N	วันทำการ
8942	4396	6	1	2567	2	12	t	f	\N	วันทำการ
8943	4397	6	1	2567	2	12	t	f	\N	วันทำการ
8944	4398	6	1	2567	2	12	t	f	\N	วันทำการ
8945	4399	6	1	2567	2	12	t	f	\N	วันทำการ
8946	4400	6	1	2567	2	12	f	f	\N	วันหยุด
8947	4401	6	1	2567	2	12	f	f	\N	วันหยุด
8948	4402	6	1	2567	2	13	t	f	\N	วันทำการ
8949	4403	6	1	2567	2	13	t	f	\N	วันทำการ
8950	4404	6	1	2567	2	13	f	t	วันมาฆบูชา	วันหยุดนักขัตฤกษ์
8951	4405	6	1	2567	2	13	t	f	\N	วันทำการ
8952	4406	6	1	2567	2	13	f	t	วันวาเลนไทน์	วันหยุดนักขัตฤกษ์
8953	4407	6	1	2567	2	13	f	f	\N	วันหยุด
8954	4408	6	1	2567	2	13	f	f	\N	วันหยุด
8955	4409	6	1	2567	2	14	t	f	\N	วันทำการ
8956	4410	6	1	2567	2	14	t	f	\N	วันทำการ
8957	4411	6	1	2567	2	14	t	f	\N	วันทำการ
8958	4412	6	1	2567	2	14	t	f	\N	วันทำการ
8959	4413	6	1	2567	2	14	t	f	\N	วันทำการ
8960	4414	6	1	2567	2	14	f	f	\N	วันหยุด
8961	4415	6	1	2567	2	14	f	f	\N	วันหยุด
8962	4416	6	1	2567	2	15	t	f	\N	วันทำการ
8963	4417	6	1	2567	2	15	t	f	\N	วันทำการ
8964	4418	6	1	2567	2	15	t	f	\N	วันทำการ
8965	4419	6	1	2567	2	15	t	f	\N	วันทำการ
8966	4420	6	1	2567	2	15	t	f	\N	วันทำการ
8967	4421	6	1	2567	2	15	f	f	\N	วันหยุด
8968	4422	6	1	2567	2	15	f	f	\N	วันหยุด
8969	4423	6	1	2567	2	16	t	f	\N	วันทำการ
8970	4424	6	1	2567	2	16	t	f	\N	วันทำการ
8971	4425	6	1	2567	2	16	t	f	\N	วันทำการ
8972	4426	6	1	2567	2	16	t	f	\N	วันทำการ
8973	4427	6	1	2567	2	16	t	f	\N	วันทำการ
8974	4428	6	1	2567	2	16	f	f	\N	วันหยุด
8975	4429	6	1	2567	2	16	f	f	\N	วันหยุด
8976	4430	6	1	2567	2	17	t	f	\N	วันทำการ
8977	4431	6	1	2567	2	17	t	f	\N	วันทำการ
8978	4432	6	1	2567	2	17	t	f	\N	วันทำการ
8979	4433	6	1	2567	2	17	t	f	\N	วันทำการ
8980	4434	6	1	2567	2	17	t	f	\N	วันทำการ
8981	4435	6	1	2567	2	17	f	f	\N	วันหยุด
8982	4436	6	1	2567	2	17	f	f	\N	วันหยุด
8983	4437	6	1	2567	2	18	t	f	\N	วันทำการ
8984	4438	6	1	2567	2	18	t	f	\N	วันทำการ
8985	4439	6	1	2567	2	18	t	f	\N	วันทำการ
8986	4440	6	1	2567	2	18	t	f	\N	วันทำการ
8987	4441	6	1	2567	2	18	t	f	\N	วันทำการ
8988	4442	6	1	2567	2	18	f	f	\N	วันหยุด
8989	4443	6	1	2567	\N	\N	f	f	\N	วันหยุด
8990	4444	6	1	2567	\N	\N	f	f	\N	ปิดภาค
8991	4445	6	1	2567	\N	\N	f	f	\N	ปิดภาค
8992	4446	6	1	2567	\N	\N	f	f	\N	ปิดภาค
8993	4447	6	1	2567	\N	\N	f	f	\N	ปิดภาค
8994	4448	6	1	2567	\N	\N	f	f	\N	ปิดภาค
8995	4449	6	1	2567	\N	\N	f	f	\N	วันหยุด
8996	4450	6	1	2567	\N	\N	f	f	\N	วันหยุด
8997	4451	6	1	2567	\N	\N	f	f	\N	ปิดภาค
8998	4452	6	1	2567	\N	\N	f	f	\N	ปิดภาค
8999	4453	6	1	2567	\N	\N	f	f	\N	ปิดภาค
9000	4454	6	1	2567	\N	\N	f	f	\N	ปิดภาค
9001	4455	6	1	2567	\N	\N	f	f	\N	ปิดภาค
9002	4456	6	1	2567	\N	\N	f	f	\N	วันหยุด
9003	4457	6	1	2567	\N	\N	f	t	วันจักรี	วันหยุดนักขัตฤกษ์
9004	4458	6	1	2567	\N	\N	f	t	ชดเชยวันจักรี	วันหยุดนักขัตฤกษ์
9005	4459	6	1	2567	\N	\N	f	f	\N	ปิดภาค
9006	4460	6	1	2567	\N	\N	f	f	\N	ปิดภาค
9007	4461	6	1	2567	\N	\N	f	f	\N	ปิดภาค
9008	4462	6	1	2567	\N	\N	f	f	\N	ปิดภาค
9009	4463	6	1	2567	\N	\N	f	f	\N	วันหยุด
9010	4464	6	1	2567	\N	\N	f	t	วันสงกรานต์	วันหยุดนักขัตฤกษ์
9011	4465	6	1	2567	\N	\N	f	t	วันสงกรานต์	วันหยุดนักขัตฤกษ์
9012	4466	6	1	2567	\N	\N	f	t	วันสงกรานต์	วันหยุดนักขัตฤกษ์
9013	4467	6	1	2567	\N	\N	f	t	วันหยุดชดเชยวันสงกรานต์	วันหยุดนักขัตฤกษ์
9014	4468	6	1	2567	3	1	t	f	\N	วันทำการ
9015	4469	6	1	2567	3	1	t	f	\N	วันทำการ
9016	4470	6	1	2567	3	1	f	f	\N	วันหยุด
9017	4471	6	1	2567	3	1	f	f	\N	วันหยุด
9018	4472	6	1	2567	3	2	t	f	\N	วันทำการ
9019	4473	6	1	2567	3	2	t	f	\N	วันทำการ
9020	4474	6	1	2567	3	2	t	f	\N	วันทำการ
9021	4475	6	1	2567	3	2	t	f	\N	วันทำการ
9022	4476	6	1	2567	3	2	t	f	\N	วันทำการ
9023	4477	6	1	2567	3	2	f	f	\N	วันหยุด
9024	4478	6	1	2567	3	2	f	f	\N	วันหยุด
9025	4479	6	1	2567	3	3	t	f	\N	วันทำการ
9026	4480	6	1	2567	3	3	t	f	\N	วันทำการ
9027	4481	6	1	2567	3	3	t	f	\N	วันทำการ
9028	4482	6	1	2567	3	3	f	t	วันแรงงานแห่งชาติ	วันหยุดนักขัตฤกษ์
9029	4483	6	1	2567	3	3	t	f	\N	วันทำการ
9030	4484	6	1	2567	3	3	f	f	\N	วันหยุด
9031	4485	6	1	2567	3	3	f	t	วันฉัตรมงคล	วันหยุดนักขัตฤกษ์
9032	4486	6	1	2567	3	4	f	t	ชดเชยวันฉัตรมงคล	วันหยุดนักขัตฤกษ์
9033	4487	6	1	2567	3	4	t	f	\N	วันทำการ
9034	4488	6	1	2567	3	4	t	f	\N	วันทำการ
9035	4489	6	1	2567	3	4	t	f	\N	วันทำการ
9036	4490	6	1	2567	3	4	f	t	วันพืชมงคล	วันหยุดนักขัตฤกษ์
9037	4491	6	1	2567	3	4	f	f	\N	วันหยุด
9038	4492	6	1	2567	3	4	f	t	วันวิสาขบูชา	วันหยุดนักขัตฤกษ์
9039	4493	6	1	2567	3	5	f	t	วันหยุดชดเชยวันวิสาขบูชา	วันหยุดนักขัตฤกษ์
9040	4494	6	1	2567	3	5	t	f	\N	วันทำการ
9041	4495	6	1	2567	3	5	t	f	\N	วันทำการ
9042	4496	6	1	2567	3	5	t	f	\N	วันทำการ
9043	4497	6	1	2567	3	5	t	f	\N	วันทำการ
9044	4498	6	1	2567	3	5	f	f	\N	วันหยุด
9045	4499	6	1	2567	3	5	f	f	\N	วันหยุด
9046	4500	6	1	2567	3	6	t	f	\N	วันทำการ
9047	4501	6	1	2567	3	6	t	f	\N	วันทำการ
9048	4502	6	1	2567	3	6	t	f	\N	วันทำการ
9049	4503	6	1	2567	3	6	t	f	\N	วันทำการ
9050	4504	6	1	2567	3	6	t	f	\N	วันทำการ
9051	4505	6	1	2567	3	6	f	f	\N	วันหยุด
9052	4506	6	1	2567	3	6	f	f	\N	วันหยุด
9053	4507	6	1	2567	3	7	t	f	\N	วันทำการ
9054	4508	6	1	2567	3	7	t	f	\N	วันทำการ
9055	4509	6	1	2567	3	7	t	f	\N	วันทำการ
9056	4510	6	1	2567	3	7	t	f	\N	วันทำการ
9057	4511	6	1	2567	3	7	t	f	\N	วันทำการ
9058	4512	6	1	2567	3	7	f	f	\N	วันหยุด
9059	4513	6	1	2567	3	7	f	f	\N	วันหยุด
9060	4514	6	1	2567	3	8	f	t	นักขัตฤกษ์	วันหยุดนักขัตฤกษ์
9061	4515	6	1	2567	3	8	f	t	วันเฉลิมฯ พระราชินี	วันหยุดนักขัตฤกษ์
9062	4516	6	1	2567	3	8	t	f	\N	วันทำการ
9063	4517	6	1	2567	3	8	t	f	\N	วันทำการ
9064	4518	6	1	2567	3	8	t	f	\N	วันทำการ
9065	4519	6	1	2567	3	8	f	f	\N	วันหยุด
9066	4520	6	1	2567	3	8	f	f	\N	วันหยุด
9067	4171	7	1	2567	1	1	t	f	\N	วันทำการ
9068	4172	7	1	2567	1	1	t	f	\N	วันทำการ
9069	4173	7	1	2567	1	1	t	f	\N	วันทำการ
9070	4174	7	1	2567	1	1	t	f	\N	วันทำการ
9071	4175	7	1	2567	1	1	t	f	\N	วันทำการ
9072	4176	7	1	2567	1	1	f	f	\N	วันหยุด
9073	4177	7	1	2567	1	1	f	f	\N	วันหยุด
9074	4178	7	1	2567	1	2	t	f	\N	วันทำการ
9075	4179	7	1	2567	1	2	t	f	\N	วันทำการ
9076	4180	7	1	2567	1	2	t	f	\N	วันทำการ
9077	4181	7	1	2567	1	2	t	f	\N	วันทำการ
9078	4182	7	1	2567	1	2	t	f	\N	วันทำการ
9079	4183	7	1	2567	1	2	f	f	\N	วันหยุด
9080	4184	7	1	2567	1	2	f	f	\N	วันหยุด
9081	4185	7	1	2567	1	3	t	f	\N	วันทำการ
9082	4186	7	1	2567	1	3	t	f	\N	วันทำการ
9083	4187	7	1	2567	1	3	t	f	\N	วันทำการ
9084	4188	7	1	2567	1	3	t	f	\N	วันทำการ
9085	4189	7	1	2567	1	3	t	f	\N	วันทำการ
9086	4190	7	1	2567	1	3	f	f	\N	วันหยุด
9087	4191	7	1	2567	1	3	f	f	\N	วันหยุด
9088	4192	7	1	2567	1	4	t	f	\N	วันทำการ
9089	4193	7	1	2567	1	4	t	f	\N	วันทำการ
9090	4194	7	1	2567	1	4	t	f	\N	วันทำการ
9091	4195	7	1	2567	1	4	t	f	\N	วันทำการ
9092	4196	7	1	2567	1	4	t	f	\N	วันทำการ
9093	4197	7	1	2567	1	4	f	t	วันอาสาฬหบูชา	วันหยุดนักขัตฤกษ์
9094	4198	7	1	2567	1	4	f	f	\N	วันหยุด
9095	4199	7	1	2567	1	5	f	t	วันหยุดชดเชยวันอาสาฬหบูชา	วันหยุดนักขัตฤกษ์
9096	4200	7	1	2567	1	5	t	f	\N	วันทำการ
9097	4201	7	1	2567	1	5	t	f	\N	วันทำการ
9098	4202	7	1	2567	1	5	t	f	\N	วันทำการ
9099	4203	7	1	2567	1	5	t	f	\N	วันทำการ
9100	4204	7	1	2567	1	5	f	f	\N	วันหยุด
9101	4205	7	1	2567	1	5	f	t	วันเฉลิมฯ ร.10	วันหยุดนักขัตฤกษ์
9102	4206	7	1	2567	1	6	f	t	วันหยุดชดเชยวันเฉลิมพระชนมพรรษา สมเด็จพระเจ้าอยู่หัวมหาวชิราลงกรณ บดินทรเทพยวรางกูร	วันหยุดนักขัตฤกษ์
9103	4207	7	1	2567	1	6	t	f	\N	วันทำการ
9104	4208	7	1	2567	1	6	t	f	\N	วันทำการ
9105	4209	7	1	2567	1	6	t	f	\N	วันทำการ
9106	4210	7	1	2567	1	6	t	f	\N	วันทำการ
9107	4211	7	1	2567	1	6	f	f	\N	วันหยุด
9108	4212	7	1	2567	1	6	f	f	\N	วันหยุด
9109	4213	7	1	2567	1	7	t	f	\N	วันทำการ
9110	4214	7	1	2567	1	7	t	f	\N	วันทำการ
9111	4215	7	1	2567	1	7	t	f	\N	วันทำการ
9112	4216	7	1	2567	1	7	t	f	\N	วันทำการ
9113	4217	7	1	2567	1	7	t	f	\N	วันทำการ
9114	4218	7	1	2567	1	7	f	f	\N	วันหยุด
9115	4219	7	1	2567	1	7	f	f	\N	วันหยุด
9116	4220	7	1	2567	1	8	f	t	วันแม่แห่งชาติ	วันหยุดนักขัตฤกษ์
9117	4221	7	1	2567	1	8	t	f	\N	วันทำการ
9118	4222	7	1	2567	1	8	t	f	\N	วันทำการ
9119	4223	7	1	2567	1	8	t	f	\N	วันทำการ
9120	4224	7	1	2567	1	8	t	f	\N	วันทำการ
9121	4225	7	1	2567	1	8	f	f	\N	วันหยุด
9122	4226	7	1	2567	1	8	f	f	\N	วันหยุด
9123	4227	7	1	2567	1	9	t	f	\N	วันทำการ
9124	4228	7	1	2567	1	9	t	f	\N	วันทำการ
9125	4229	7	1	2567	1	9	t	f	\N	วันทำการ
9126	4230	7	1	2567	1	9	t	f	\N	วันทำการ
9127	4231	7	1	2567	1	9	t	f	\N	วันทำการ
9128	4232	7	1	2567	1	9	f	f	\N	วันหยุด
9129	4233	7	1	2567	1	9	f	f	\N	วันหยุด
9130	4234	7	1	2567	1	10	t	f	\N	วันทำการ
9131	4235	7	1	2567	1	10	t	f	\N	วันทำการ
9132	4236	7	1	2567	1	10	t	f	\N	วันทำการ
9133	4237	7	1	2567	1	10	t	f	\N	วันทำการ
9134	4238	7	1	2567	1	10	t	f	\N	วันทำการ
9135	4239	7	1	2567	1	10	f	f	\N	วันหยุด
9136	4240	7	1	2567	1	10	f	f	\N	วันหยุด
9137	4241	7	1	2567	1	11	t	f	\N	วันทำการ
9138	4242	7	1	2567	1	11	t	f	\N	วันทำการ
9139	4243	7	1	2567	1	11	t	f	\N	วันทำการ
9140	4244	7	1	2567	1	11	t	f	\N	วันทำการ
9141	4245	7	1	2567	1	11	t	f	\N	วันทำการ
9142	4246	7	1	2567	1	11	f	f	\N	วันหยุด
9143	4247	7	1	2567	1	11	f	f	\N	วันหยุด
9144	4248	7	1	2567	1	12	t	f	\N	วันทำการ
9145	4249	7	1	2567	1	12	t	f	\N	วันทำการ
9146	4250	7	1	2567	1	12	t	f	\N	วันทำการ
9147	4251	7	1	2567	1	12	t	f	\N	วันทำการ
9148	4252	7	1	2567	1	12	t	f	\N	วันทำการ
9149	4253	7	1	2567	1	12	f	f	\N	วันหยุด
9150	4254	7	1	2567	1	12	f	f	\N	วันหยุด
9151	4255	7	1	2567	1	13	t	f	\N	วันทำการ
9152	4256	7	1	2567	1	13	t	f	\N	วันทำการ
9153	4257	7	1	2567	1	13	t	f	\N	วันทำการ
9154	4258	7	1	2567	1	13	t	f	\N	วันทำการ
9155	4259	7	1	2567	1	13	t	f	\N	วันทำการ
9156	4260	7	1	2567	1	13	f	f	\N	วันหยุด
9157	4261	7	1	2567	1	13	f	t	วันสงขลานครินทร์	วันหยุดนักขัตฤกษ์
9158	4262	7	1	2567	1	14	f	t	ชดเชยวันสงขลานครินทร์	วันหยุดนักขัตฤกษ์
9159	4263	7	1	2567	1	14	t	f	\N	วันทำการ
9160	4264	7	1	2567	1	14	t	f	\N	วันทำการ
9161	4265	7	1	2567	1	14	t	f	\N	วันทำการ
9162	4266	7	1	2567	1	14	t	f	\N	วันทำการ
9163	4267	7	1	2567	1	14	f	f	\N	วันหยุด
9164	4268	7	1	2567	1	14	f	f	\N	วันหยุด
9165	4269	7	1	2567	1	15	t	f	\N	วันทำการ
9166	4270	7	1	2567	1	15	t	f	\N	วันทำการ
9167	4271	7	1	2567	1	15	t	f	\N	วันทำการ
9168	4272	7	1	2567	1	15	t	f	\N	วันทำการ
9169	4273	7	1	2567	1	15	t	f	\N	วันทำการ
9170	4274	7	1	2567	1	15	f	f	\N	วันหยุด
9171	4275	7	1	2567	1	15	f	f	\N	วันหยุด
9172	4276	7	1	2567	1	16	t	f	\N	วันทำการ
9173	4277	7	1	2567	1	16	t	f	\N	วันทำการ
9174	4278	7	1	2567	1	16	t	f	\N	วันทำการ
9175	4279	7	1	2567	1	16	t	f	\N	วันทำการ
9176	4280	7	1	2567	1	16	t	f	\N	วันทำการ
9177	4281	7	1	2567	1	16	f	f	\N	วันหยุด
9178	4282	7	1	2567	1	16	f	t	วันนวมินทรมหาราช	วันหยุดนักขัตฤกษ์
9179	4283	7	1	2567	1	17	f	t	วันหยุดชดเชยวันคล้ายวันสวรรคตของพระบาทสมเด็จพระปรมินทรมหาภูมิพลอดุลยเดชบรมนาถบพิตร	วันหยุดนักขัตฤกษ์
9180	4284	7	1	2567	1	17	t	f	\N	วันทำการ
9181	4285	7	1	2567	1	17	t	f	\N	วันทำการ
9182	4286	7	1	2567	1	17	t	f	\N	วันทำการ
9183	4287	7	1	2567	1	17	t	f	\N	วันทำการ
9184	4288	7	1	2567	1	17	f	f	\N	วันหยุด
9185	4289	7	1	2567	1	17	f	f	\N	วันหยุด
9186	4290	7	1	2567	1	18	t	f	\N	วันทำการ
9187	4291	7	1	2567	1	18	t	f	\N	วันทำการ
9188	4292	7	1	2567	1	18	f	t	วันปิยมหาราช	วันหยุดนักขัตฤกษ์
9189	4293	7	1	2567	1	18	t	f	\N	วันทำการ
9190	4294	7	1	2567	1	18	t	f	\N	วันทำการ
9191	4295	7	1	2567	1	18	f	f	\N	วันหยุด
9192	4296	7	1	2567	1	18	f	f	\N	วันหยุด
9193	4297	7	1	2567	\N	\N	f	f	\N	ปิดภาค
9194	4298	7	1	2567	\N	\N	f	f	\N	ปิดภาค
9195	4299	7	1	2567	\N	\N	f	f	\N	ปิดภาค
9196	4300	7	1	2567	\N	\N	f	f	\N	ปิดภาค
9197	4301	7	1	2567	\N	\N	f	f	\N	ปิดภาค
9198	4302	7	1	2567	\N	\N	f	f	\N	วันหยุด
9199	4303	7	1	2567	\N	\N	f	f	\N	วันหยุด
9200	4304	7	1	2567	\N	\N	f	f	\N	ปิดภาค
9201	4305	7	1	2567	\N	\N	f	f	\N	ปิดภาค
9202	4306	7	1	2567	\N	\N	f	f	\N	ปิดภาค
9203	4307	7	1	2567	\N	\N	f	f	\N	ปิดภาค
9204	4308	7	1	2567	\N	\N	f	f	\N	ปิดภาค
9205	4309	7	1	2567	\N	\N	f	f	\N	วันหยุด
9206	4310	7	1	2567	\N	\N	f	f	\N	วันหยุด
9207	4311	7	1	2567	\N	\N	f	f	\N	ปิดภาค
9208	4312	7	1	2567	\N	\N	f	f	\N	ปิดภาค
9209	4313	7	1	2567	\N	\N	f	f	\N	ปิดภาค
9210	4314	7	1	2567	\N	\N	f	f	\N	ปิดภาค
9211	4315	7	1	2567	\N	\N	f	f	\N	ปิดภาค
9212	4316	7	1	2567	\N	\N	f	f	\N	วันหยุด
9213	4317	7	1	2567	\N	\N	f	f	\N	วันหยุด
9214	4318	7	1	2567	2	1	t	f	\N	วันทำการ
9215	4319	7	1	2567	2	1	t	f	\N	วันทำการ
9216	4320	7	1	2567	2	1	t	f	\N	วันทำการ
9217	4321	7	1	2567	2	1	t	f	\N	วันทำการ
9218	4322	7	1	2567	2	1	t	f	\N	วันทำการ
9219	4323	7	1	2567	2	1	f	f	\N	วันหยุด
9220	4324	7	1	2567	2	1	f	f	\N	วันหยุด
9221	4325	7	1	2567	2	2	t	f	\N	วันทำการ
9222	4326	7	1	2567	2	2	t	f	\N	วันทำการ
9223	4327	7	1	2567	2	2	t	f	\N	วันทำการ
9224	4328	7	1	2567	2	2	t	f	\N	วันทำการ
9225	4329	7	1	2567	2	2	t	f	\N	วันทำการ
9226	4330	7	1	2567	2	2	f	f	\N	วันหยุด
9227	4331	7	1	2567	2	2	f	f	\N	วันหยุด
9228	4332	7	1	2567	2	3	t	f	\N	วันทำการ
9229	4333	7	1	2567	2	3	t	f	\N	วันทำการ
9230	4334	7	1	2567	2	3	t	f	\N	วันทำการ
9231	4335	7	1	2567	2	3	f	t	วันพ่อแห่งชาติ	วันหยุดนักขัตฤกษ์
9232	4336	7	1	2567	2	3	t	f	\N	วันทำการ
9233	4337	7	1	2567	2	3	f	f	\N	วันหยุด
9234	4338	7	1	2567	2	3	f	f	\N	วันหยุด
9235	4339	7	1	2567	2	4	t	f	\N	วันทำการ
9236	4340	7	1	2567	2	4	f	t	วันรัฐธรรมนูญ	วันหยุดนักขัตฤกษ์
9237	4341	7	1	2567	2	4	t	f	\N	วันทำการ
9238	4342	7	1	2567	2	4	t	f	\N	วันทำการ
9239	4343	7	1	2567	2	4	t	f	\N	วันทำการ
9240	4344	7	1	2567	2	4	f	f	\N	วันหยุด
9241	4345	7	1	2567	2	4	f	f	\N	วันหยุด
9242	4346	7	1	2567	2	5	t	f	\N	วันทำการ
9243	4347	7	1	2567	2	5	t	f	\N	วันทำการ
9244	4348	7	1	2567	2	5	t	f	\N	วันทำการ
9245	4349	7	1	2567	2	5	t	f	\N	วันทำการ
9246	4350	7	1	2567	2	5	t	f	\N	วันทำการ
9247	4351	7	1	2567	2	5	f	f	\N	วันหยุด
9248	4352	7	1	2567	2	5	f	f	\N	วันหยุด
9249	4353	7	1	2567	2	6	t	f	\N	วันทำการ
9250	4354	7	1	2567	2	6	f	t	วันคริสต์มาสอีฟ	วันหยุดนักขัตฤกษ์
9251	4355	7	1	2567	2	6	f	t	วันคริสต์มาส	วันหยุดนักขัตฤกษ์
9252	4356	7	1	2567	2	6	t	f	\N	วันทำการ
9253	4357	7	1	2567	2	6	t	f	\N	วันทำการ
9254	4358	7	1	2567	2	6	f	f	\N	วันหยุด
9255	4359	7	1	2567	2	6	f	f	\N	วันหยุด
9256	4360	7	1	2567	2	7	f	t	วันหยุดราชการธันวาคม	วันหยุดนักขัตฤกษ์
9257	4361	7	1	2567	2	7	f	t	วันสิ้นปี	วันหยุดนักขัตฤกษ์
9258	4362	7	1	2567	2	7	f	t	วันขึ้นปีใหม่	วันหยุดนักขัตฤกษ์
9259	4363	7	1	2567	2	7	f	t	วันหยุดพิเศษ (ครม.)	วันหยุดนักขัตฤกษ์
9260	4364	7	1	2567	2	7	t	f	\N	วันทำการ
9261	4365	7	1	2567	2	7	f	f	\N	วันหยุด
9262	4366	7	1	2567	2	7	f	f	\N	วันหยุด
9263	4367	7	1	2567	2	8	t	f	\N	วันทำการ
9264	4368	7	1	2567	2	8	t	f	\N	วันทำการ
9265	4369	7	1	2567	2	8	t	f	\N	วันทำการ
9266	4370	7	1	2567	2	8	t	f	\N	วันทำการ
9267	4371	7	1	2567	2	8	t	f	\N	วันทำการ
9268	4372	7	1	2567	2	8	f	f	\N	วันหยุด
9269	4373	7	1	2567	2	8	f	f	\N	วันหยุด
9270	4374	7	1	2567	2	9	t	f	\N	วันทำการ
9271	4375	7	1	2567	2	9	t	f	\N	วันทำการ
9272	4376	7	1	2567	2	9	t	f	\N	วันทำการ
9273	4377	7	1	2567	2	9	t	f	\N	วันทำการ
9274	4378	7	1	2567	2	9	t	f	\N	วันทำการ
9275	4379	7	1	2567	2	9	f	f	\N	วันหยุด
9276	4380	7	1	2567	2	9	f	f	\N	วันหยุด
9277	4381	7	1	2567	2	10	t	f	\N	วันทำการ
9278	4382	7	1	2567	2	10	t	f	\N	วันทำการ
9279	4383	7	1	2567	2	10	t	f	\N	วันทำการ
9280	4384	7	1	2567	2	10	t	f	\N	วันทำการ
9281	4385	7	1	2567	2	10	t	f	\N	วันทำการ
9282	4386	7	1	2567	2	10	f	f	\N	วันหยุด
9283	4387	7	1	2567	2	10	f	f	\N	วันหยุด
9284	4388	7	1	2567	2	11	t	f	\N	วันทำการ
9285	4389	7	1	2567	2	11	t	f	\N	วันทำการ
9286	4390	7	1	2567	2	11	f	t	วันตรุษจีน	วันหยุดนักขัตฤกษ์
9287	4391	7	1	2567	2	11	f	t	วันตรุษจีน (วันที่ 2)	วันหยุดนักขัตฤกษ์
9288	4392	7	1	2567	2	11	f	t	วันตรุษจีน (วันที่ 3)	วันหยุดนักขัตฤกษ์
9289	4393	7	1	2567	2	11	f	f	\N	วันหยุด
9290	4394	7	1	2567	2	11	f	f	\N	วันหยุด
9291	4395	7	1	2567	2	12	t	f	\N	วันทำการ
9292	4396	7	1	2567	2	12	t	f	\N	วันทำการ
9293	4397	7	1	2567	2	12	t	f	\N	วันทำการ
9294	4398	7	1	2567	2	12	t	f	\N	วันทำการ
9295	4399	7	1	2567	2	12	t	f	\N	วันทำการ
9296	4400	7	1	2567	2	12	f	f	\N	วันหยุด
9297	4401	7	1	2567	2	12	f	f	\N	วันหยุด
9298	4402	7	1	2567	2	13	t	f	\N	วันทำการ
9299	4403	7	1	2567	2	13	t	f	\N	วันทำการ
9300	4404	7	1	2567	2	13	f	t	วันมาฆบูชา	วันหยุดนักขัตฤกษ์
9301	4405	7	1	2567	2	13	t	f	\N	วันทำการ
9302	4406	7	1	2567	2	13	f	t	วันวาเลนไทน์	วันหยุดนักขัตฤกษ์
9303	4407	7	1	2567	2	13	f	f	\N	วันหยุด
9304	4408	7	1	2567	2	13	f	f	\N	วันหยุด
9305	4409	7	1	2567	2	14	t	f	\N	วันทำการ
9306	4410	7	1	2567	2	14	t	f	\N	วันทำการ
9307	4411	7	1	2567	2	14	t	f	\N	วันทำการ
9308	4412	7	1	2567	2	14	t	f	\N	วันทำการ
9309	4413	7	1	2567	2	14	t	f	\N	วันทำการ
9310	4414	7	1	2567	2	14	f	f	\N	วันหยุด
9311	4415	7	1	2567	2	14	f	f	\N	วันหยุด
9312	4416	7	1	2567	2	15	t	f	\N	วันทำการ
9313	4417	7	1	2567	2	15	t	f	\N	วันทำการ
9314	4418	7	1	2567	2	15	t	f	\N	วันทำการ
9315	4419	7	1	2567	2	15	t	f	\N	วันทำการ
9316	4420	7	1	2567	2	15	t	f	\N	วันทำการ
9317	4421	7	1	2567	2	15	f	f	\N	วันหยุด
9318	4422	7	1	2567	2	15	f	f	\N	วันหยุด
9319	4423	7	1	2567	2	16	t	f	\N	วันทำการ
9320	4424	7	1	2567	2	16	t	f	\N	วันทำการ
9321	4425	7	1	2567	2	16	t	f	\N	วันทำการ
9322	4426	7	1	2567	2	16	t	f	\N	วันทำการ
9323	4427	7	1	2567	2	16	t	f	\N	วันทำการ
9324	4428	7	1	2567	2	16	f	f	\N	วันหยุด
9325	4429	7	1	2567	2	16	f	f	\N	วันหยุด
9326	4430	7	1	2567	2	17	t	f	\N	วันทำการ
9327	4431	7	1	2567	2	17	t	f	\N	วันทำการ
9328	4432	7	1	2567	2	17	t	f	\N	วันทำการ
9329	4433	7	1	2567	2	17	t	f	\N	วันทำการ
9330	4434	7	1	2567	2	17	t	f	\N	วันทำการ
9331	4435	7	1	2567	2	17	f	f	\N	วันหยุด
9332	4436	7	1	2567	2	17	f	f	\N	วันหยุด
9333	4437	7	1	2567	2	18	t	f	\N	วันทำการ
9334	4438	7	1	2567	2	18	t	f	\N	วันทำการ
9335	4439	7	1	2567	2	18	t	f	\N	วันทำการ
9336	4440	7	1	2567	2	18	t	f	\N	วันทำการ
9337	4441	7	1	2567	2	18	t	f	\N	วันทำการ
9338	4442	7	1	2567	2	18	f	f	\N	วันหยุด
9339	4443	7	1	2567	\N	\N	f	f	\N	วันหยุด
9340	4444	7	1	2567	\N	\N	f	f	\N	ปิดภาค
9341	4445	7	1	2567	\N	\N	f	f	\N	ปิดภาค
9342	4446	7	1	2567	\N	\N	f	f	\N	ปิดภาค
9343	4447	7	1	2567	\N	\N	f	f	\N	ปิดภาค
9344	4448	7	1	2567	\N	\N	f	f	\N	ปิดภาค
9345	4449	7	1	2567	\N	\N	f	f	\N	วันหยุด
9346	4450	7	1	2567	\N	\N	f	f	\N	วันหยุด
9347	4451	7	1	2567	\N	\N	f	f	\N	ปิดภาค
9348	4452	7	1	2567	\N	\N	f	f	\N	ปิดภาค
9349	4453	7	1	2567	\N	\N	f	f	\N	ปิดภาค
9350	4454	7	1	2567	\N	\N	f	f	\N	ปิดภาค
9351	4455	7	1	2567	\N	\N	f	f	\N	ปิดภาค
9352	4456	7	1	2567	\N	\N	f	f	\N	วันหยุด
9353	4457	7	1	2567	\N	\N	f	t	วันจักรี	วันหยุดนักขัตฤกษ์
9354	4458	7	1	2567	\N	\N	f	t	ชดเชยวันจักรี	วันหยุดนักขัตฤกษ์
9355	4459	7	1	2567	\N	\N	f	f	\N	ปิดภาค
9356	4460	7	1	2567	\N	\N	f	f	\N	ปิดภาค
9357	4461	7	1	2567	\N	\N	f	f	\N	ปิดภาค
9358	4462	7	1	2567	\N	\N	f	f	\N	ปิดภาค
9359	4463	7	1	2567	\N	\N	f	f	\N	วันหยุด
9360	4464	7	1	2567	\N	\N	f	t	วันสงกรานต์	วันหยุดนักขัตฤกษ์
9361	4465	7	1	2567	\N	\N	f	t	วันสงกรานต์	วันหยุดนักขัตฤกษ์
9362	4466	7	1	2567	\N	\N	f	t	วันสงกรานต์	วันหยุดนักขัตฤกษ์
9363	4467	7	1	2567	\N	\N	f	t	วันหยุดชดเชยวันสงกรานต์	วันหยุดนักขัตฤกษ์
9364	4468	7	1	2567	3	1	t	f	\N	วันทำการ
9365	4469	7	1	2567	3	1	t	f	\N	วันทำการ
9366	4470	7	1	2567	3	1	f	f	\N	วันหยุด
9367	4471	7	1	2567	3	1	f	f	\N	วันหยุด
9368	4472	7	1	2567	3	2	t	f	\N	วันทำการ
9369	4473	7	1	2567	3	2	t	f	\N	วันทำการ
9370	4474	7	1	2567	3	2	t	f	\N	วันทำการ
9371	4475	7	1	2567	3	2	t	f	\N	วันทำการ
9372	4476	7	1	2567	3	2	t	f	\N	วันทำการ
9373	4477	7	1	2567	3	2	f	f	\N	วันหยุด
9374	4478	7	1	2567	3	2	f	f	\N	วันหยุด
9375	4479	7	1	2567	3	3	t	f	\N	วันทำการ
9376	4480	7	1	2567	3	3	t	f	\N	วันทำการ
9377	4481	7	1	2567	3	3	t	f	\N	วันทำการ
9378	4482	7	1	2567	3	3	f	t	วันแรงงานแห่งชาติ	วันหยุดนักขัตฤกษ์
9379	4483	7	1	2567	3	3	t	f	\N	วันทำการ
9380	4484	7	1	2567	3	3	f	f	\N	วันหยุด
9381	4485	7	1	2567	3	3	f	t	วันฉัตรมงคล	วันหยุดนักขัตฤกษ์
9382	4486	7	1	2567	3	4	f	t	ชดเชยวันฉัตรมงคล	วันหยุดนักขัตฤกษ์
9383	4487	7	1	2567	3	4	t	f	\N	วันทำการ
9384	4488	7	1	2567	3	4	t	f	\N	วันทำการ
9385	4489	7	1	2567	3	4	t	f	\N	วันทำการ
9386	4490	7	1	2567	3	4	f	t	วันพืชมงคล	วันหยุดนักขัตฤกษ์
9387	4491	7	1	2567	3	4	f	f	\N	วันหยุด
9388	4492	7	1	2567	3	4	f	t	วันวิสาขบูชา	วันหยุดนักขัตฤกษ์
9389	4493	7	1	2567	3	5	f	t	วันหยุดชดเชยวันวิสาขบูชา	วันหยุดนักขัตฤกษ์
9390	4494	7	1	2567	3	5	t	f	\N	วันทำการ
9391	4495	7	1	2567	3	5	t	f	\N	วันทำการ
9392	4496	7	1	2567	3	5	t	f	\N	วันทำการ
9393	4497	7	1	2567	3	5	t	f	\N	วันทำการ
9394	4498	7	1	2567	3	5	f	f	\N	วันหยุด
9395	4499	7	1	2567	3	5	f	f	\N	วันหยุด
9396	4500	7	1	2567	3	6	t	f	\N	วันทำการ
9397	4501	7	1	2567	3	6	t	f	\N	วันทำการ
9398	4502	7	1	2567	3	6	t	f	\N	วันทำการ
9399	4503	7	1	2567	3	6	t	f	\N	วันทำการ
9400	4504	7	1	2567	3	6	t	f	\N	วันทำการ
9401	4505	7	1	2567	3	6	f	f	\N	วันหยุด
9402	4506	7	1	2567	3	6	f	f	\N	วันหยุด
9403	4507	7	1	2567	3	7	t	f	\N	วันทำการ
9404	4508	7	1	2567	3	7	t	f	\N	วันทำการ
9405	4509	7	1	2567	3	7	t	f	\N	วันทำการ
9406	4510	7	1	2567	3	7	t	f	\N	วันทำการ
9407	4511	7	1	2567	3	7	t	f	\N	วันทำการ
9408	4512	7	1	2567	3	7	f	f	\N	วันหยุด
9409	4513	7	1	2567	3	7	f	f	\N	วันหยุด
9410	4514	7	1	2567	3	8	f	t	นักขัตฤกษ์	วันหยุดนักขัตฤกษ์
9411	4515	7	1	2567	3	8	f	t	วันเฉลิมฯ พระราชินี	วันหยุดนักขัตฤกษ์
9412	4516	7	1	2567	3	8	t	f	\N	วันทำการ
9413	4517	7	1	2567	3	8	t	f	\N	วันทำการ
9414	4518	7	1	2567	3	8	t	f	\N	วันทำการ
9415	4519	7	1	2567	3	8	f	f	\N	วันหยุด
9416	4520	7	1	2567	3	8	f	f	\N	วันหยุด
9767	7644	1	16	2568	1	1	t	f	\N	วันทำการ
9768	7645	1	16	2568	1	1	t	f	\N	วันทำการ
9769	7646	1	16	2568	1	1	t	f	\N	วันทำการ
9770	7647	1	16	2568	1	1	f	f	\N	วันหยุด
9771	7648	1	16	2568	1	1	f	f	\N	วันหยุด
9772	7649	1	16	2568	1	2	t	f	\N	วันทำการ
9773	7650	1	16	2568	1	2	t	f	\N	วันทำการ
9774	7651	1	16	2568	1	2	t	f	\N	วันทำการ
9775	7652	1	16	2568	1	2	t	f	\N	วันทำการ
9776	7653	1	16	2568	1	2	t	f	\N	วันทำการ
9777	7654	1	16	2568	1	2	f	f	\N	วันหยุด
9778	7655	1	16	2568	1	2	f	f	\N	วันหยุด
9779	7656	1	16	2568	1	3	t	f	\N	วันทำการ
9780	7657	1	16	2568	1	3	t	f	\N	วันทำการ
9781	7658	1	16	2568	1	3	t	f	\N	วันทำการ
9782	7659	1	16	2568	1	3	t	f	\N	วันทำการ
9783	7660	1	16	2568	1	3	t	f	\N	วันทำการ
9784	7661	1	16	2568	1	3	f	f	\N	วันหยุด
9785	7662	1	16	2568	1	3	f	f	\N	วันหยุด
9786	7663	1	16	2568	1	4	t	f	\N	วันทำการ
9787	7664	1	16	2568	1	4	t	f	\N	วันทำการ
9788	7665	1	16	2568	1	4	t	f	\N	วันทำการ
9789	7666	1	16	2568	1	4	t	f	\N	วันทำการ
9790	7667	1	16	2568	1	4	t	f	\N	วันทำการ
9791	7668	1	16	2568	1	4	f	f	\N	วันหยุด
9792	7669	1	16	2568	1	4	f	f	\N	วันหยุด
9793	7670	1	16	2568	1	5	t	f	\N	วันทำการ
9794	7671	1	16	2568	1	5	t	f	\N	วันทำการ
9795	7672	1	16	2568	1	5	t	f	\N	วันทำการ
9796	7673	1	16	2568	1	5	t	f	\N	วันทำการ
9797	7674	1	16	2568	1	5	t	f	\N	วันทำการ
9798	7675	1	16	2568	1	5	f	f	\N	วันหยุด
9799	7676	1	16	2568	1	5	f	f	\N	วันหยุด
9800	7677	1	16	2568	1	6	t	f	\N	วันทำการ
9801	7678	1	16	2568	1	6	t	f	\N	วันทำการ
9802	7679	1	16	2568	1	6	t	f	\N	วันทำการ
9803	7680	1	16	2568	1	6	t	f	\N	วันทำการ
9804	7681	1	16	2568	1	6	t	f	\N	วันทำการ
9805	7682	1	16	2568	1	6	f	f	\N	วันหยุด
9806	7683	1	16	2568	1	6	f	f	\N	วันหยุด
9807	7684	1	16	2568	1	7	f	t	วันสงขลานครินทร์	วันหยุดนักขัตฤกษ์
9808	7685	1	16	2568	1	7	t	f	\N	วันทำการ
9809	7686	1	16	2568	1	7	t	f	\N	วันทำการ
9810	7687	1	16	2568	1	7	t	f	\N	วันทำการ
9811	7688	1	16	2568	1	7	t	f	\N	วันทำการ
9812	7689	1	16	2568	1	7	f	f	\N	วันหยุด
9813	7690	1	16	2568	1	7	f	f	\N	วันหยุด
9814	7691	1	16	2568	1	8	t	f	\N	วันทำการ
9815	7692	1	16	2568	1	8	t	f	\N	วันทำการ
9816	7693	1	16	2568	1	8	t	f	\N	วันทำการ
9817	7694	1	16	2568	1	8	t	f	\N	วันทำการ
9818	7695	1	16	2568	1	8	t	f	\N	วันทำการ
9819	7696	1	16	2568	1	8	f	f	\N	วันหยุด
9820	7697	1	16	2568	1	8	f	f	\N	วันหยุด
9821	7698	1	16	2568	1	9	t	f	\N	วันทำการ
9822	7699	1	16	2568	1	9	t	f	\N	วันทำการ
9823	7700	1	16	2568	1	9	t	f	\N	วันทำการ
9824	7701	1	16	2568	1	9	t	f	\N	วันทำการ
9825	7702	1	16	2568	1	9	t	f	\N	วันทำการ
9826	7703	1	16	2568	1	9	f	f	\N	วันหยุด
9827	7704	1	16	2568	1	9	f	f	\N	วันหยุด
9828	7705	1	16	2568	1	10	f	t	วันนวมินทรมหาราช	วันหยุดนักขัตฤกษ์
9829	7706	1	16	2568	1	10	t	f	\N	วันทำการ
9830	7707	1	16	2568	1	10	t	f	\N	วันทำการ
9831	7708	1	16	2568	1	10	t	f	\N	วันทำการ
9832	7709	1	16	2568	1	10	t	f	\N	วันทำการ
9833	7710	1	16	2568	1	10	f	f	\N	วันหยุด
9834	7711	1	16	2568	1	10	f	f	\N	วันหยุด
9835	7712	1	16	2568	1	11	t	f	\N	วันทำการ
9836	7713	1	16	2568	1	11	t	f	\N	วันทำการ
9837	7714	1	16	2568	1	11	t	f	\N	วันทำการ
9838	7715	1	16	2568	1	11	f	t	วันปิยมหาราช	วันหยุดนักขัตฤกษ์
9839	7716	1	16	2568	1	11	t	f	\N	วันทำการ
9840	7717	1	16	2568	1	11	f	f	\N	วันหยุด
9841	7718	1	16	2568	1	11	f	f	\N	วันหยุด
9842	7719	1	16	2568	1	12	t	f	\N	วันทำการ
9843	7720	1	16	2568	1	12	t	f	\N	วันทำการ
9844	7721	1	16	2568	1	12	t	f	\N	วันทำการ
9845	7722	1	16	2568	1	12	t	f	\N	วันทำการ
9846	7723	1	16	2568	1	12	t	f	\N	วันทำการ
9847	7724	1	16	2568	1	12	f	f	\N	วันหยุด
9848	7725	1	16	2568	1	12	f	f	\N	วันหยุด
9849	7726	1	16	2568	1	13	t	f	\N	วันทำการ
9850	7727	1	16	2568	1	13	t	f	\N	วันทำการ
9851	7728	1	16	2568	1	13	t	f	\N	วันทำการ
9852	7729	1	16	2568	1	13	t	f	\N	วันทำการ
9853	7730	1	16	2568	1	13	t	f	\N	วันทำการ
9854	7731	1	16	2568	1	13	f	f	\N	วันหยุด
9855	7732	1	16	2568	1	13	f	f	\N	วันหยุด
9856	7733	1	16	2568	1	14	t	f	\N	วันทำการ
9857	7734	1	16	2568	1	14	t	f	\N	วันทำการ
9858	7735	1	16	2568	1	14	t	f	\N	วันทำการ
9859	7736	1	16	2568	1	14	t	f	\N	วันทำการ
9860	7737	1	16	2568	1	14	t	f	\N	วันทำการ
9861	7738	1	16	2568	1	14	f	f	\N	วันหยุด
9862	7739	1	16	2568	1	14	f	f	\N	วันหยุด
9863	7740	1	16	2568	1	15	t	f	\N	วันทำการ
9864	7741	1	16	2568	1	15	t	f	\N	วันทำการ
9865	7742	1	16	2568	1	15	t	f	\N	วันทำการ
9866	7743	1	16	2568	1	15	t	f	\N	วันทำการ
9867	7744	1	16	2568	1	15	t	f	\N	วันทำการ
9868	7745	1	16	2568	1	15	f	f	\N	วันหยุด
9869	7746	1	16	2568	1	15	f	f	\N	วันหยุด
9870	7747	1	16	2568	1	16	t	f	\N	วันทำการ
9871	7748	1	16	2568	1	16	t	f	\N	วันทำการ
9872	7749	1	16	2568	1	16	t	f	\N	วันทำการ
9873	7750	1	16	2568	1	16	t	f	\N	วันทำการ
9874	7751	1	16	2568	1	16	t	f	\N	วันทำการ
9875	7752	1	16	2568	1	16	f	f	\N	วันหยุด
9876	7753	1	16	2568	1	16	f	f	\N	วันหยุด
9877	7754	1	16	2568	1	17	t	f	\N	วันทำการ
9878	7755	1	16	2568	1	17	t	f	\N	วันทำการ
9879	7756	1	16	2568	1	17	t	f	\N	วันทำการ
9880	7757	1	16	2568	1	17	t	f	\N	วันทำการ
9881	7758	1	16	2568	1	17	f	t	วันพ่อแห่งชาติ	วันหยุดนักขัตฤกษ์
9882	7759	1	16	2568	1	17	f	f	\N	วันหยุด
9883	7760	1	16	2568	1	17	f	f	\N	วันหยุด
9884	7761	1	16	2568	1	18	t	f	\N	วันทำการ
9885	7762	1	16	2568	1	18	t	f	\N	วันทำการ
9886	7763	1	16	2568	1	18	f	t	วันรัฐธรรมนูญ	วันหยุดนักขัตฤกษ์
9887	7764	1	16	2568	1	18	t	f	\N	วันทำการ
9888	7765	1	16	2568	1	18	t	f	\N	วันทำการ
9889	7766	1	16	2568	1	18	f	f	\N	วันหยุด
9890	7767	1	16	2568	\N	\N	f	f	\N	วันหยุด
9891	7768	1	16	2568	\N	\N	f	f	\N	ปิดภาค
9892	7769	1	16	2568	\N	\N	f	f	\N	ปิดภาค
9893	7770	1	16	2568	\N	\N	f	f	\N	ปิดภาค
9894	7771	1	16	2568	\N	\N	f	f	\N	ปิดภาค
9895	7772	1	16	2568	\N	\N	f	f	\N	ปิดภาค
9896	7773	1	16	2568	\N	\N	f	f	\N	วันหยุด
9897	7774	1	16	2568	\N	\N	f	f	\N	วันหยุด
9898	7775	1	16	2568	\N	\N	f	f	\N	ปิดภาค
9899	7776	1	16	2568	\N	\N	f	f	\N	ปิดภาค
9900	7777	1	16	2568	\N	\N	f	t	วันคริสต์มาสอีฟ	วันหยุดนักขัตฤกษ์
9901	7778	1	16	2568	\N	\N	f	t	วันคริสต์มาส	วันหยุดนักขัตฤกษ์
9902	7779	1	16	2568	\N	\N	f	f	\N	ปิดภาค
9903	7780	1	16	2568	\N	\N	f	f	\N	วันหยุด
9904	7781	1	16	2568	\N	\N	f	f	\N	วันหยุด
9905	7782	1	16	2568	\N	\N	f	f	\N	ปิดภาค
9906	7783	1	16	2568	\N	\N	f	f	\N	ปิดภาค
9907	7784	1	16	2568	\N	\N	f	t	วันสิ้นปี	วันหยุดนักขัตฤกษ์
9908	7785	1	16	2568	\N	\N	f	t	วันขื้นปีใหม่	วันหยุดนักขัตฤกษ์
9909	7786	1	16	2568	\N	\N	f	t	วันหยุดราชการธันวาคม	วันหยุดนักขัตฤกษ์
9910	7787	1	16	2568	\N	\N	f	f	\N	วันหยุด
9911	7788	1	16	2568	\N	\N	f	f	\N	วันหยุด
9912	7789	1	16	2568	\N	\N	f	f	\N	ปิดภาค
9913	7790	1	16	2568	\N	\N	f	f	\N	ปิดภาค
9914	7791	1	16	2568	\N	\N	f	f	\N	ปิดภาค
9915	7792	1	16	2568	\N	\N	f	f	\N	ปิดภาค
9916	7793	1	16	2568	\N	\N	f	f	\N	ปิดภาค
9917	7794	1	16	2568	\N	\N	f	f	\N	วันหยุด
9918	7795	1	16	2568	\N	\N	f	f	\N	วันหยุด
9919	7796	1	16	2568	2	1	t	f	\N	วันทำการ
9920	7797	1	16	2568	2	1	t	f	\N	วันทำการ
9921	7798	1	16	2568	2	1	t	f	\N	วันทำการ
9922	7799	1	16	2568	2	1	t	f	\N	วันทำการ
9923	7800	1	16	2568	2	1	t	f	\N	วันทำการ
9924	7801	1	16	2568	2	1	f	f	\N	วันหยุด
9925	7802	1	16	2568	2	1	f	f	\N	วันหยุด
9926	7803	1	16	2568	2	2	t	f	\N	วันทำการ
9927	7804	1	16	2568	2	2	t	f	\N	วันทำการ
9928	7805	1	16	2568	2	2	t	f	\N	วันทำการ
9929	7806	1	16	2568	2	2	t	f	\N	วันทำการ
9930	7807	1	16	2568	2	2	t	f	\N	วันทำการ
9931	7808	1	16	2568	2	2	f	f	\N	วันหยุด
9932	7809	1	16	2568	2	2	f	f	\N	วันหยุด
9933	7810	1	16	2568	2	3	t	f	\N	วันทำการ
9934	7811	1	16	2568	2	3	t	f	\N	วันทำการ
9935	7812	1	16	2568	2	3	t	f	\N	วันทำการ
9936	7813	1	16	2568	2	3	t	f	\N	วันทำการ
9937	7814	1	16	2568	2	3	t	f	\N	วันทำการ
9938	7815	1	16	2568	2	3	f	f	\N	วันหยุด
9939	7816	1	16	2568	2	3	f	t	วันมาฆบูชา	วันหยุดนักขัตฤกษ์
9940	7817	1	16	2568	2	4	t	f	\N	วันทำการ
9941	7818	1	16	2568	2	4	t	f	\N	วันทำการ
9942	7819	1	16	2568	2	4	t	f	\N	วันทำการ
9943	7820	1	16	2568	2	4	t	f	\N	วันทำการ
9944	7821	1	16	2568	2	4	t	f	\N	วันทำการ
9945	7822	1	16	2568	2	4	f	f	\N	วันหยุด
9946	7823	1	16	2568	2	4	f	f	\N	วันหยุด
9947	7824	1	16	2568	2	5	t	f	\N	วันทำการ
9948	7825	1	16	2568	2	5	t	f	\N	วันทำการ
9949	7826	1	16	2568	2	5	t	f	\N	วันทำการ
9950	7827	1	16	2568	2	5	t	f	\N	วันทำการ
9951	7828	1	16	2568	2	5	t	f	\N	วันทำการ
9952	7829	1	16	2568	2	5	f	t	วันวาเลนไทน์	วันหยุดนักขัตฤกษ์
9953	7830	1	16	2568	2	5	f	f	\N	วันหยุด
9954	7831	1	16	2568	2	6	t	f	\N	วันทำการ
9955	7832	1	16	2568	2	6	f	t	วันตรุษจีน	วันหยุดนักขัตฤกษ์
9956	7833	1	16	2568	2	6	f	t	วันตรุษจีน (วันที่ 2)	วันหยุดนักขัตฤกษ์
9957	7834	1	16	2568	2	6	f	t	วันตรุษจีน (วันที่ 3)	วันหยุดนักขัตฤกษ์
9958	7835	1	16	2568	2	6	t	f	\N	วันทำการ
9959	7836	1	16	2568	2	6	f	f	\N	วันหยุด
9960	7837	1	16	2568	2	6	f	f	\N	วันหยุด
9961	7838	1	16	2568	2	7	t	f	\N	วันทำการ
9962	7839	1	16	2568	2	7	t	f	\N	วันทำการ
9963	7840	1	16	2568	2	7	t	f	\N	วันทำการ
9964	7841	1	16	2568	2	7	t	f	\N	วันทำการ
9965	7842	1	16	2568	2	7	t	f	\N	วันทำการ
9966	7843	1	16	2568	2	7	f	f	\N	วันหยุด
9967	7844	1	16	2568	2	7	f	f	\N	วันหยุด
9968	7845	1	16	2568	2	8	t	f	\N	วันทำการ
9969	7846	1	16	2568	2	8	f	t	วันมาฆบูชา	วันหยุดนักขัตฤกษ์
9970	7847	1	16	2568	2	8	t	f	\N	วันทำการ
9971	7848	1	16	2568	2	8	t	f	\N	วันทำการ
9972	7849	1	16	2568	2	8	t	f	\N	วันทำการ
9973	7850	1	16	2568	2	8	f	f	\N	วันหยุด
9974	7851	1	16	2568	2	8	f	f	\N	วันหยุด
9975	7852	1	16	2568	2	9	t	f	\N	วันทำการ
9976	7853	1	16	2568	2	9	t	f	\N	วันทำการ
9977	7854	1	16	2568	2	9	t	f	\N	วันทำการ
9978	7855	1	16	2568	2	9	t	f	\N	วันทำการ
9979	7856	1	16	2568	2	9	t	f	\N	วันทำการ
9980	7857	1	16	2568	2	9	f	f	\N	วันหยุด
9981	7858	1	16	2568	2	9	f	f	\N	วันหยุด
9982	7859	1	16	2568	2	10	t	f	\N	วันทำการ
9983	7860	1	16	2568	2	10	t	f	\N	วันทำการ
9984	7861	1	16	2568	2	10	t	f	\N	วันทำการ
9985	7862	1	16	2568	2	10	t	f	\N	วันทำการ
9986	7863	1	16	2568	2	10	t	f	\N	วันทำการ
9987	7864	1	16	2568	2	10	f	f	\N	วันหยุด
9988	7865	1	16	2568	2	10	f	f	\N	วันหยุด
9989	7866	1	16	2568	2	11	t	f	\N	วันทำการ
9990	7867	1	16	2568	2	11	t	f	\N	วันทำการ
9991	7868	1	16	2568	2	11	t	f	\N	วันทำการ
9992	7869	1	16	2568	2	11	t	f	\N	วันทำการ
9993	7870	1	16	2568	2	11	t	f	\N	วันทำการ
9994	7871	1	16	2568	2	11	f	f	\N	วันหยุด
9995	7872	1	16	2568	2	11	f	f	\N	วันหยุด
9996	7873	1	16	2568	2	12	t	f	\N	วันทำการ
9997	7874	1	16	2568	2	12	t	f	\N	วันทำการ
9998	7875	1	16	2568	2	12	t	f	\N	วันทำการ
9999	7876	1	16	2568	2	12	t	f	\N	วันทำการ
10000	7877	1	16	2568	2	12	t	f	\N	วันทำการ
10001	7878	1	16	2568	2	12	f	f	\N	วันหยุด
10002	7879	1	16	2568	2	12	f	f	\N	วันหยุด
10003	7880	1	16	2568	2	13	f	t	วันจักรี	วันหยุดนักขัตฤกษ์
10004	7881	1	16	2568	2	13	t	f	\N	วันทำการ
10005	7882	1	16	2568	2	13	t	f	\N	วันทำการ
10006	7883	1	16	2568	2	13	t	f	\N	วันทำการ
10007	7884	1	16	2568	2	13	t	f	\N	วันทำการ
10008	7885	1	16	2568	2	13	f	f	\N	วันหยุด
10009	7886	1	16	2568	2	13	f	f	\N	วันหยุด
10010	7887	1	16	2568	2	14	f	t	วันสงกรานต์	วันหยุดนักขัตฤกษ์
10011	7888	1	16	2568	2	14	f	t	วันสงกรานต์	วันหยุดนักขัตฤกษ์
10012	7889	1	16	2568	2	14	f	t	วันสงกรานต์	วันหยุดนักขัตฤกษ์
10013	7890	1	16	2568	2	14	t	f	\N	วันทำการ
10014	7891	1	16	2568	2	14	t	f	\N	วันทำการ
10015	7892	1	16	2568	2	14	f	f	\N	วันหยุด
10016	7893	1	16	2568	2	14	f	f	\N	วันหยุด
10017	7894	1	16	2568	2	15	t	f	\N	วันทำการ
10018	7895	1	16	2568	2	15	t	f	\N	วันทำการ
10019	7896	1	16	2568	2	15	t	f	\N	วันทำการ
10020	7897	1	16	2568	2	15	t	f	\N	วันทำการ
10021	7898	1	16	2568	2	15	t	f	\N	วันทำการ
10022	7899	1	16	2568	2	15	f	f	\N	วันหยุด
10023	7900	1	16	2568	2	15	f	f	\N	วันหยุด
10024	7901	1	16	2568	2	16	t	f	\N	วันทำการ
10025	7902	1	16	2568	2	16	t	f	\N	วันทำการ
10026	7903	1	16	2568	2	16	t	f	\N	วันทำการ
10027	7904	1	16	2568	2	16	t	f	\N	วันทำการ
10028	7905	1	16	2568	2	16	f	t	วันแรงงานแห่งชาติ	วันหยุดนักขัตฤกษ์
10029	7906	1	16	2568	2	16	f	f	\N	วันหยุด
10030	7907	1	16	2568	2	16	f	f	\N	วันหยุด
10031	7908	1	16	2568	2	17	f	t	วันฉัตรมงคล	วันหยุดนักขัตฤกษ์
10032	7909	1	16	2568	2	17	t	f	\N	วันทำการ
10033	7910	1	16	2568	2	17	t	f	\N	วันทำการ
10034	7911	1	16	2568	2	17	t	f	\N	วันทำการ
10035	7912	1	16	2568	2	17	t	f	\N	วันทำการ
10036	7913	1	16	2568	2	17	f	f	\N	วันหยุด
10037	7914	1	16	2568	2	17	f	f	\N	วันหยุด
10038	7915	1	16	2568	2	18	f	t	วันพืชมงคล	วันหยุดนักขัตฤกษ์
10039	7916	1	16	2568	2	18	t	f	\N	วันทำการ
10040	7917	1	16	2568	2	18	t	f	\N	วันทำการ
10041	7918	1	16	2568	2	18	t	f	\N	วันทำการ
10042	7919	1	16	2568	2	18	t	f	\N	วันทำการ
10043	4494	1	17	2568	1	1	t	f	\N	วันทำการ
10044	4495	1	17	2568	1	1	t	f	\N	วันทำการ
10045	4496	1	17	2568	1	1	t	f	\N	วันทำการ
10046	4497	1	17	2568	1	1	t	f	\N	วันทำการ
10047	4498	1	17	2568	1	1	f	f	\N	วันหยุด
10048	4499	1	17	2568	1	1	f	f	\N	วันหยุด
10049	4500	1	17	2568	1	2	t	f	\N	วันทำการ
10050	4501	1	17	2568	1	2	t	f	\N	วันทำการ
10051	4502	1	17	2568	1	2	t	f	\N	วันทำการ
10052	4503	1	17	2568	1	2	t	f	\N	วันทำการ
10053	4504	1	17	2568	1	2	t	f	\N	วันทำการ
10054	4505	1	17	2568	1	2	f	f	\N	วันหยุด
10055	4506	1	17	2568	1	2	f	f	\N	วันหยุด
10056	4507	1	17	2568	1	3	t	f	\N	วันทำการ
10057	4508	1	17	2568	1	3	t	f	\N	วันทำการ
10058	4509	1	17	2568	1	3	t	f	\N	วันทำการ
10059	4510	1	17	2568	1	3	t	f	\N	วันทำการ
10060	4511	1	17	2568	1	3	t	f	\N	วันทำการ
10061	4512	1	17	2568	1	3	f	f	\N	วันหยุด
10062	4513	1	17	2568	1	3	f	f	\N	วันหยุด
10063	4514	1	17	2568	1	4	f	t	นักขัตฤกษ์	วันหยุดนักขัตฤกษ์
10064	4515	1	17	2568	1	4	f	t	วันเฉลิมฯ พระราชินี	วันหยุดนักขัตฤกษ์
10065	4516	1	17	2568	1	4	t	f	\N	วันทำการ
10066	4517	1	17	2568	1	4	t	f	\N	วันทำการ
10067	4518	1	17	2568	1	4	t	f	\N	วันทำการ
10068	4519	1	17	2568	1	4	f	t	วันรายออีดี้ลอัดฮา	วันหยุดนักขัตฤกษ์
10069	4520	1	17	2568	1	4	f	f	\N	วันหยุด
10070	8246	1	17	2568	1	5	t	f	\N	วันทำการ
10071	8247	1	17	2568	1	5	t	f	\N	วันทำการ
10072	8248	1	17	2568	1	5	t	f	\N	วันทำการ
10073	8249	1	17	2568	1	5	t	f	\N	วันทำการ
10074	8250	1	17	2568	1	5	t	f	\N	วันทำการ
10075	8251	1	17	2568	1	5	f	f	\N	วันหยุด
10076	8252	1	17	2568	1	5	f	f	\N	วันหยุด
10077	8253	1	17	2568	1	6	t	f	\N	วันทำการ
10078	8254	1	17	2568	1	6	t	f	\N	วันทำการ
10079	8255	1	17	2568	1	6	t	f	\N	วันทำการ
10080	8256	1	17	2568	1	6	t	f	\N	วันทำการ
10081	8257	1	17	2568	1	6	t	f	\N	วันทำการ
10082	8258	1	17	2568	1	6	f	f	\N	วันหยุด
10083	8259	1	17	2568	1	6	f	f	\N	วันหยุด
10084	7593	1	17	2568	1	7	t	f	\N	วันทำการ
10085	7594	1	17	2568	1	7	t	f	\N	วันทำการ
10086	7595	1	17	2568	1	7	t	f	\N	วันทำการ
10087	7596	1	17	2568	1	7	t	f	\N	วันทำการ
10088	7597	1	17	2568	1	7	t	f	\N	วันทำการ
10089	7598	1	17	2568	1	7	f	f	\N	วันหยุด
10090	7599	1	17	2568	1	7	f	f	\N	วันหยุด
10091	7600	1	17	2568	1	8	t	f	\N	วันทำการ
10092	7601	1	17	2568	1	8	t	f	\N	วันทำการ
10093	7602	1	17	2568	1	8	t	f	\N	วันทำการ
10094	7603	1	17	2568	1	8	t	f	\N	วันทำการ
10095	7604	1	17	2568	1	8	t	f	\N	วันทำการ
10096	7605	1	17	2568	1	8	f	f	\N	วันหยุด
10097	7606	1	17	2568	1	8	f	f	\N	วันหยุด
10098	7607	1	17	2568	1	9	t	f	\N	วันทำการ
10099	7608	1	17	2568	1	9	t	f	\N	วันทำการ
10100	7609	1	17	2568	1	9	t	f	\N	วันทำการ
10101	7610	1	17	2568	1	9	f	t	วันอาสาฬหบูชา	วันหยุดนักขัตฤกษ์
10102	7611	1	17	2568	1	9	f	t	วันเข้าพรรษา	วันหยุดนักขัตฤกษ์
10103	7612	1	17	2568	1	9	f	f	\N	วันหยุด
10104	7613	1	17	2568	1	9	f	f	\N	วันหยุด
10105	7614	1	17	2568	1	10	f	t	ชดเชยวันอาสาฬหบูชา	วันหยุดนักขัตฤกษ์
10106	7615	1	17	2568	1	10	t	f	\N	วันทำการ
10107	7616	1	17	2568	1	10	t	f	\N	วันทำการ
10108	7617	1	17	2568	1	10	t	f	\N	วันทำการ
10109	7618	1	17	2568	1	10	t	f	\N	วันทำการ
10110	7619	1	17	2568	1	10	f	f	\N	วันหยุด
10111	7620	1	17	2568	1	10	f	f	\N	วันหยุด
10112	7621	1	17	2568	1	11	t	f	\N	วันทำการ
10113	7622	1	17	2568	1	11	t	f	\N	วันทำการ
10114	7623	1	17	2568	1	11	t	f	\N	วันทำการ
10115	7624	1	17	2568	1	11	t	f	\N	วันทำการ
10116	7625	1	17	2568	1	11	t	f	\N	วันทำการ
10117	7626	1	17	2568	1	11	f	f	\N	วันหยุด
10118	7627	1	17	2568	1	11	f	f	\N	วันหยุด
10119	7628	1	17	2568	1	12	f	t	วันเฉลิมฯ ร.10	วันหยุดนักขัตฤกษ์
10120	7629	1	17	2568	1	12	t	f	\N	วันทำการ
10121	7630	1	17	2568	1	12	t	f	\N	วันทำการ
10122	7631	1	17	2568	1	12	t	f	\N	วันทำการ
10123	7632	1	17	2568	1	12	t	f	\N	วันทำการ
10124	7633	1	17	2568	1	12	f	f	\N	วันหยุด
10125	7634	1	17	2568	1	12	f	f	\N	วันหยุด
10126	7635	1	17	2568	1	13	t	f	\N	วันทำการ
10127	7636	1	17	2568	1	13	t	f	\N	วันทำการ
10128	7637	1	17	2568	1	13	t	f	\N	วันทำการ
10129	7638	1	17	2568	1	13	t	f	\N	วันทำการ
10130	7639	1	17	2568	1	13	t	f	\N	วันทำการ
10131	7640	1	17	2568	1	13	f	f	\N	วันหยุด
10132	7641	1	17	2568	1	13	f	f	\N	วันหยุด
10133	7642	1	17	2568	1	14	f	t	นักขัตฤกษ์	วันหยุดนักขัตฤกษ์
10134	7643	1	17	2568	1	14	f	t	วันแม่แห่งชาติ	วันหยุดนักขัตฤกษ์
10135	7644	1	17	2568	1	14	t	f	\N	วันทำการ
10136	7645	1	17	2568	1	14	t	f	\N	วันทำการ
10137	7646	1	17	2568	1	14	t	f	\N	วันทำการ
10138	7647	1	17	2568	1	14	f	f	\N	วันหยุด
10139	7648	1	17	2568	1	14	f	f	\N	วันหยุด
10140	7649	1	17	2568	1	15	t	f	\N	วันทำการ
10141	7650	1	17	2568	1	15	t	f	\N	วันทำการ
10142	7651	1	17	2568	1	15	t	f	\N	วันทำการ
10143	7652	1	17	2568	1	15	t	f	\N	วันทำการ
10144	7653	1	17	2568	1	15	t	f	\N	วันทำการ
10145	7654	1	17	2568	1	15	f	f	\N	วันหยุด
10146	7655	1	17	2568	1	15	f	f	\N	วันหยุด
10147	7656	1	17	2568	1	16	t	f	\N	วันทำการ
10148	7657	1	17	2568	1	16	t	f	\N	วันทำการ
10149	7658	1	17	2568	1	16	t	f	\N	วันทำการ
10150	7659	1	17	2568	1	16	t	f	\N	วันทำการ
10151	7660	1	17	2568	1	16	t	f	\N	วันทำการ
10152	7661	1	17	2568	1	16	f	f	\N	วันหยุด
10153	7662	1	17	2568	1	16	f	f	\N	วันหยุด
10154	7663	1	17	2568	1	17	t	f	\N	วันทำการ
10155	7664	1	17	2568	1	17	t	f	\N	วันทำการ
10156	7665	1	17	2568	1	17	t	f	\N	วันทำการ
10157	7666	1	17	2568	1	17	t	f	\N	วันทำการ
10158	7667	1	17	2568	1	17	t	f	\N	วันทำการ
10159	7668	1	17	2568	1	17	f	f	\N	วันหยุด
10160	7669	1	17	2568	1	17	f	f	\N	วันหยุด
10161	7670	1	17	2568	1	18	t	f	\N	วันทำการ
10162	7671	1	17	2568	1	18	t	f	\N	วันทำการ
10163	7672	1	17	2568	1	18	t	f	\N	วันทำการ
10164	7673	1	17	2568	1	18	t	f	\N	วันทำการ
10165	7674	1	17	2568	1	18	t	f	\N	วันทำการ
10166	7675	1	17	2568	1	18	f	f	\N	วันหยุด
10167	7676	1	17	2568	1	18	f	f	\N	วันหยุด
10168	7677	1	17	2568	1	19	t	f	\N	วันทำการ
10169	7678	1	17	2568	1	19	t	f	\N	วันทำการ
10170	7679	1	17	2568	1	19	t	f	\N	วันทำการ
10171	7680	1	17	2568	1	19	t	f	\N	วันทำการ
10172	7681	1	17	2568	1	19	t	f	\N	วันทำการ
10173	7682	1	17	2568	1	19	f	f	\N	วันหยุด
10174	7683	1	17	2568	1	19	f	f	\N	วันหยุด
10175	7684	1	17	2568	1	20	f	t	วันสงขลานครินทร์	วันหยุดนักขัตฤกษ์
10176	7685	1	17	2568	1	20	t	f	\N	วันทำการ
10177	7686	1	17	2568	1	20	t	f	\N	วันทำการ
10178	7687	1	17	2568	1	20	t	f	\N	วันทำการ
10179	7688	1	17	2568	1	20	t	f	\N	วันทำการ
10180	7689	1	17	2568	1	20	f	f	\N	วันหยุด
10181	7690	1	17	2568	1	20	f	f	\N	วันหยุด
10182	7691	1	17	2568	1	21	t	f	\N	วันทำการ
10183	7692	1	17	2568	1	21	t	f	\N	วันทำการ
10184	7693	1	17	2568	1	21	t	f	\N	วันทำการ
10185	7694	1	17	2568	1	21	t	f	\N	วันทำการ
10186	7695	1	17	2568	1	21	t	f	\N	วันทำการ
10187	7696	1	17	2568	1	21	f	f	\N	วันหยุด
10188	7697	1	17	2568	1	21	f	f	\N	วันหยุด
10189	7698	1	17	2568	1	22	t	f	\N	วันทำการ
10190	7699	1	17	2568	1	22	t	f	\N	วันทำการ
10191	7700	1	17	2568	1	22	t	f	\N	วันทำการ
10192	7701	1	17	2568	1	22	t	f	\N	วันทำการ
10193	7702	1	17	2568	1	22	t	f	\N	วันทำการ
10194	7703	1	17	2568	1	22	f	f	\N	วันหยุด
10195	7704	1	17	2568	1	22	f	f	\N	วันหยุด
10196	7705	1	17	2568	1	23	f	t	วันนวมินทรมหาราช	วันหยุดนักขัตฤกษ์
10197	7706	1	17	2568	1	23	t	f	\N	วันทำการ
10198	7707	1	17	2568	1	23	t	f	\N	วันทำการ
10199	7708	1	17	2568	1	23	t	f	\N	วันทำการ
10200	7709	1	17	2568	1	23	t	f	\N	วันทำการ
10201	7710	1	17	2568	1	23	f	f	\N	วันหยุด
10202	7711	1	17	2568	1	23	f	f	\N	วันหยุด
10203	7712	1	17	2568	1	24	t	f	\N	วันทำการ
10204	7713	1	17	2568	1	24	t	f	\N	วันทำการ
10205	7714	1	17	2568	1	24	t	f	\N	วันทำการ
10206	7715	1	17	2568	1	24	f	t	วันปิยมหาราช	วันหยุดนักขัตฤกษ์
10207	7716	1	17	2568	1	24	t	f	\N	วันทำการ
10208	7717	1	17	2568	1	24	f	f	\N	วันหยุด
10209	7718	1	17	2568	1	24	f	f	\N	วันหยุด
10210	7719	1	17	2568	1	25	t	f	\N	วันทำการ
10211	7720	1	17	2568	1	25	t	f	\N	วันทำการ
10212	7721	1	17	2568	1	25	t	f	\N	วันทำการ
10213	7722	1	17	2568	1	25	t	f	\N	วันทำการ
10214	7723	1	17	2568	1	25	t	f	\N	วันทำการ
10215	7724	1	17	2568	1	25	f	f	\N	วันหยุด
10216	7725	1	17	2568	1	25	f	f	\N	วันหยุด
10217	7726	1	17	2568	1	26	t	f	\N	วันทำการ
10218	7727	1	17	2568	1	26	t	f	\N	วันทำการ
10219	7728	1	17	2568	1	26	t	f	\N	วันทำการ
10220	7729	1	17	2568	1	26	t	f	\N	วันทำการ
10221	7730	1	17	2568	1	26	t	f	\N	วันทำการ
10222	7731	1	17	2568	1	26	f	f	\N	วันหยุด
10223	7732	1	17	2568	1	26	f	f	\N	วันหยุด
10224	7733	1	17	2568	1	27	t	f	\N	วันทำการ
10225	7734	1	17	2568	1	27	t	f	\N	วันทำการ
10226	7735	1	17	2568	1	27	t	f	\N	วันทำการ
10227	7736	1	17	2568	1	27	t	f	\N	วันทำการ
10228	7737	1	17	2568	1	27	t	f	\N	วันทำการ
10229	7738	1	17	2568	1	27	f	f	\N	วันหยุด
10230	7739	1	17	2568	1	27	f	f	\N	วันหยุด
10231	7740	1	17	2568	1	28	t	f	\N	วันทำการ
10232	7741	1	17	2568	1	28	t	f	\N	วันทำการ
10233	7742	1	17	2568	1	28	t	f	\N	วันทำการ
10234	7743	1	17	2568	1	28	t	f	\N	วันทำการ
10235	7744	1	17	2568	1	28	t	f	\N	วันทำการ
10236	7745	1	17	2568	1	28	f	f	\N	วันหยุด
10237	7746	1	17	2568	1	28	f	f	\N	วันหยุด
10238	7747	1	17	2568	1	29	t	f	\N	วันทำการ
10239	7748	1	17	2568	1	29	t	f	\N	วันทำการ
10240	7749	1	17	2568	1	29	t	f	\N	วันทำการ
10241	7750	1	17	2568	1	29	t	f	\N	วันทำการ
10242	7751	1	17	2568	1	29	t	f	\N	วันทำการ
10243	7752	1	17	2568	1	29	f	f	\N	วันหยุด
10244	7753	1	17	2568	1	29	f	f	\N	วันหยุด
10245	7754	1	17	2568	1	30	t	f	\N	วันทำการ
10246	7755	1	17	2568	1	30	t	f	\N	วันทำการ
10247	7756	1	17	2568	1	30	t	f	\N	วันทำการ
10248	7757	1	17	2568	1	30	t	f	\N	วันทำการ
10249	7758	1	17	2568	1	30	f	t	วันพ่อแห่งชาติ	วันหยุดนักขัตฤกษ์
10250	7759	1	17	2568	1	30	f	f	\N	วันหยุด
10251	7760	1	17	2568	1	30	f	f	\N	วันหยุด
10252	7761	1	17	2568	1	31	t	f	\N	วันทำการ
10253	7762	1	17	2568	1	31	t	f	\N	วันทำการ
10254	7763	1	17	2568	1	31	f	t	วันรัฐธรรมนูญ	วันหยุดนักขัตฤกษ์
10255	7764	1	17	2568	1	31	t	f	\N	วันทำการ
10256	7765	1	17	2568	1	31	t	f	\N	วันทำการ
10257	7766	1	17	2568	1	31	f	f	\N	วันหยุด
10258	7767	1	17	2568	1	31	f	f	\N	วันหยุด
10259	7768	1	17	2568	1	32	t	f	\N	วันทำการ
10260	7769	1	17	2568	1	32	t	f	\N	วันทำการ
10261	7770	1	17	2568	1	32	t	f	\N	วันทำการ
10262	7771	1	17	2568	1	32	t	f	\N	วันทำการ
10263	7772	1	17	2568	1	32	t	f	\N	วันทำการ
10264	7773	1	17	2568	1	32	f	f	\N	วันหยุด
10265	7774	1	17	2568	1	32	f	f	\N	วันหยุด
10266	7775	1	17	2568	1	33	t	f	\N	วันทำการ
10267	7776	1	17	2568	1	33	t	f	\N	วันทำการ
10268	7777	1	17	2568	1	33	f	t	วันคริสต์มาสอีฟ	วันหยุดนักขัตฤกษ์
10269	7778	1	17	2568	1	33	f	t	วันคริสต์มาส	วันหยุดนักขัตฤกษ์
10270	7779	1	17	2568	1	33	t	f	\N	วันทำการ
10271	7780	1	17	2568	1	33	f	f	\N	วันหยุด
10272	7781	1	17	2568	1	33	f	f	\N	วันหยุด
10273	7782	1	17	2568	1	34	t	f	\N	วันทำการ
10274	7783	1	17	2568	1	34	t	f	\N	วันทำการ
10275	7784	1	17	2568	1	34	f	t	วันสิ้นปี	วันหยุดนักขัตฤกษ์
10276	7785	1	17	2568	1	34	f	t	วันขื้นปีใหม่	วันหยุดนักขัตฤกษ์
10277	7786	1	17	2568	1	34	f	t	วันหยุดราชการธันวาคม	วันหยุดนักขัตฤกษ์
10278	7787	1	17	2568	1	34	f	f	\N	วันหยุด
10279	7788	1	17	2568	1	34	f	f	\N	วันหยุด
10280	7789	1	17	2568	1	35	t	f	\N	วันทำการ
10281	7790	1	17	2568	1	35	t	f	\N	วันทำการ
10282	7791	1	17	2568	1	35	t	f	\N	วันทำการ
10283	7792	1	17	2568	1	35	t	f	\N	วันทำการ
10284	7793	1	17	2568	1	35	t	f	\N	วันทำการ
10285	7794	1	17	2568	1	35	f	f	\N	วันหยุด
10286	7795	1	17	2568	1	35	f	f	\N	วันหยุด
10287	7796	1	17	2568	1	36	t	f	\N	วันทำการ
10288	7797	1	17	2568	1	36	t	f	\N	วันทำการ
10289	7798	1	17	2568	1	36	t	f	\N	วันทำการ
10290	7799	1	17	2568	1	36	t	f	\N	วันทำการ
10291	7800	1	17	2568	1	36	t	f	\N	วันทำการ
10292	7801	1	17	2568	1	36	f	f	\N	วันหยุด
10293	7802	1	17	2568	1	36	f	f	\N	วันหยุด
10294	7803	1	17	2568	1	37	t	f	\N	วันทำการ
10295	7804	1	17	2568	1	37	t	f	\N	วันทำการ
10296	7805	1	17	2568	1	37	t	f	\N	วันทำการ
10297	7806	1	17	2568	1	37	t	f	\N	วันทำการ
10298	7807	1	17	2568	1	37	t	f	\N	วันทำการ
10299	7808	1	17	2568	1	37	f	f	\N	วันหยุด
10300	7809	1	17	2568	1	37	f	f	\N	วันหยุด
10301	7810	1	17	2568	1	38	t	f	\N	วันทำการ
10302	7811	1	17	2568	1	38	t	f	\N	วันทำการ
10303	7812	1	17	2568	1	38	t	f	\N	วันทำการ
10304	7813	1	17	2568	1	38	t	f	\N	วันทำการ
10305	7814	1	17	2568	1	38	t	f	\N	วันทำการ
10306	7815	1	17	2568	1	38	f	f	\N	วันหยุด
10307	7816	1	17	2568	1	38	f	t	วันมาฆบูชา	วันหยุดนักขัตฤกษ์
10308	7817	1	17	2568	1	39	t	f	\N	วันทำการ
10309	7818	1	17	2568	1	39	t	f	\N	วันทำการ
10310	7819	1	17	2568	1	39	t	f	\N	วันทำการ
10311	7820	1	17	2568	1	39	t	f	\N	วันทำการ
10312	7821	1	17	2568	1	39	t	f	\N	วันทำการ
10313	7822	1	17	2568	1	39	f	f	\N	วันหยุด
10314	7823	1	17	2568	1	39	f	f	\N	วันหยุด
10315	7824	1	17	2568	1	40	t	f	\N	วันทำการ
10316	7825	1	17	2568	1	40	t	f	\N	วันทำการ
10317	7826	1	17	2568	1	40	t	f	\N	วันทำการ
10318	7827	1	17	2568	1	40	t	f	\N	วันทำการ
10319	7828	1	17	2568	1	40	t	f	\N	วันทำการ
10320	7829	1	17	2568	1	40	f	t	วันวาเลนไทน์	วันหยุดนักขัตฤกษ์
10321	7830	1	17	2568	1	40	f	f	\N	วันหยุด
10322	7831	1	17	2568	1	41	t	f	\N	วันทำการ
10323	7832	1	17	2568	1	41	f	t	วันตรุษจีน	วันหยุดนักขัตฤกษ์
10324	7833	1	17	2568	1	41	f	t	วันตรุษจีน (วันที่ 2)	วันหยุดนักขัตฤกษ์
10325	7834	1	17	2568	1	41	f	t	วันตรุษจีน (วันที่ 3)	วันหยุดนักขัตฤกษ์
10326	7835	1	17	2568	1	41	t	f	\N	วันทำการ
10327	7836	1	17	2568	1	41	f	f	\N	วันหยุด
10328	7837	1	17	2568	1	41	f	f	\N	วันหยุด
10329	7838	1	17	2568	1	42	t	f	\N	วันทำการ
10330	7839	1	17	2568	1	42	t	f	\N	วันทำการ
10331	7840	1	17	2568	1	42	t	f	\N	วันทำการ
10332	7841	1	17	2568	1	42	t	f	\N	วันทำการ
10333	7842	1	17	2568	1	42	t	f	\N	วันทำการ
10334	7843	1	17	2568	1	42	f	f	\N	วันหยุด
10335	7844	1	17	2568	1	42	f	f	\N	วันหยุด
10336	7845	1	17	2568	1	43	t	f	\N	วันทำการ
10337	7846	1	17	2568	1	43	f	t	วันมาฆบูชา	วันหยุดนักขัตฤกษ์
10338	7847	1	17	2568	1	43	t	f	\N	วันทำการ
10339	7848	1	17	2568	1	43	t	f	\N	วันทำการ
10340	7849	1	17	2568	1	43	t	f	\N	วันทำการ
10341	7850	1	17	2568	1	43	f	f	\N	วันหยุด
10342	7851	1	17	2568	1	43	f	f	\N	วันหยุด
10343	7852	1	17	2568	1	44	t	f	\N	วันทำการ
10344	7853	1	17	2568	1	44	t	f	\N	วันทำการ
10345	7854	1	17	2568	1	44	t	f	\N	วันทำการ
10346	7855	1	17	2568	1	44	t	f	\N	วันทำการ
10347	7856	1	17	2568	1	44	t	f	\N	วันทำการ
10348	7857	1	17	2568	1	44	f	f	\N	วันหยุด
10349	7858	1	17	2568	1	44	f	f	\N	วันหยุด
10350	7859	1	17	2568	1	45	t	f	\N	วันทำการ
10351	7860	1	17	2568	1	45	t	f	\N	วันทำการ
10352	7861	1	17	2568	1	45	t	f	\N	วันทำการ
10353	7862	1	17	2568	1	45	t	f	\N	วันทำการ
10354	7863	1	17	2568	1	45	t	f	\N	วันทำการ
10355	7864	1	17	2568	1	45	f	f	\N	วันหยุด
10356	7865	1	17	2568	1	45	f	f	\N	วันหยุด
10357	7866	1	17	2568	1	46	t	f	\N	วันทำการ
10358	7867	1	17	2568	1	46	t	f	\N	วันทำการ
10359	7868	1	17	2568	1	46	t	f	\N	วันทำการ
10360	7869	1	17	2568	1	46	t	f	\N	วันทำการ
10361	7870	1	17	2568	1	46	t	f	\N	วันทำการ
10362	7871	1	17	2568	1	46	f	f	\N	วันหยุด
10363	7872	1	17	2568	1	46	f	f	\N	วันหยุด
10364	7873	1	17	2568	1	47	t	f	\N	วันทำการ
10365	7874	1	17	2568	1	47	t	f	\N	วันทำการ
10366	7875	1	17	2568	1	47	t	f	\N	วันทำการ
10367	7876	1	17	2568	1	47	t	f	\N	วันทำการ
10368	7877	1	17	2568	1	47	t	f	\N	วันทำการ
10369	7878	1	17	2568	1	47	f	f	\N	วันหยุด
10370	7879	1	17	2568	1	47	f	f	\N	วันหยุด
10371	7880	1	17	2568	1	48	f	t	วันจักรี	วันหยุดนักขัตฤกษ์
10372	7881	1	17	2568	1	48	t	f	\N	วันทำการ
10373	7882	1	17	2568	1	48	t	f	\N	วันทำการ
10374	7883	1	17	2568	1	48	t	f	\N	วันทำการ
10375	7884	1	17	2568	1	48	t	f	\N	วันทำการ
10376	7593	1	18	2568	1	1	t	f	\N	วันทำการ
10377	7594	1	18	2568	1	1	t	f	\N	วันทำการ
10378	7595	1	18	2568	1	1	t	f	\N	วันทำการ
10379	7596	1	18	2568	1	1	t	f	\N	วันทำการ
10380	7597	1	18	2568	1	1	t	f	\N	วันทำการ
10381	7598	1	18	2568	1	1	f	f	\N	วันหยุด
10382	7599	1	18	2568	1	1	f	f	\N	วันหยุด
10383	7600	1	18	2568	1	2	t	f	\N	วันทำการ
10384	7601	1	18	2568	1	2	t	f	\N	วันทำการ
10385	7602	1	18	2568	1	2	t	f	\N	วันทำการ
10386	7603	1	18	2568	1	2	t	f	\N	วันทำการ
10387	7604	1	18	2568	1	2	t	f	\N	วันทำการ
10388	7605	1	18	2568	1	2	f	f	\N	วันหยุด
10389	7606	1	18	2568	1	2	f	f	\N	วันหยุด
10390	7607	1	18	2568	1	3	t	f	\N	วันทำการ
10391	7608	1	18	2568	1	3	t	f	\N	วันทำการ
10392	7609	1	18	2568	1	3	t	f	\N	วันทำการ
10393	7610	1	18	2568	1	3	f	t	วันอาสาฬหบูชา	วันหยุดนักขัตฤกษ์
10394	7611	1	18	2568	1	3	f	t	วันเข้าพรรษา	วันหยุดนักขัตฤกษ์
10395	7612	1	18	2568	1	3	f	f	\N	วันหยุด
10396	7613	1	18	2568	1	3	f	f	\N	วันหยุด
10397	7614	1	18	2568	1	4	f	t	ชดเชยวันอาสาฬหบูชา	วันหยุดนักขัตฤกษ์
10398	7615	1	18	2568	1	4	t	f	\N	วันทำการ
10399	7616	1	18	2568	1	4	t	f	\N	วันทำการ
10400	7617	1	18	2568	1	4	t	f	\N	วันทำการ
10401	7618	1	18	2568	1	4	t	f	\N	วันทำการ
10402	7619	1	18	2568	1	4	f	f	\N	วันหยุด
10403	7620	1	18	2568	1	4	f	f	\N	วันหยุด
10404	7621	1	18	2568	1	5	t	f	\N	วันทำการ
10405	7622	1	18	2568	1	5	t	f	\N	วันทำการ
10406	7623	1	18	2568	1	5	t	f	\N	วันทำการ
10407	7624	1	18	2568	1	5	t	f	\N	วันทำการ
10408	7625	1	18	2568	1	5	t	f	\N	วันทำการ
10409	7626	1	18	2568	1	5	f	f	\N	วันหยุด
10410	7627	1	18	2568	1	5	f	f	\N	วันหยุด
10411	7628	1	18	2568	1	6	f	t	วันเฉลิมฯ ร.10	วันหยุดนักขัตฤกษ์
10412	7629	1	18	2568	1	6	t	f	\N	วันทำการ
10413	7630	1	18	2568	1	6	t	f	\N	วันทำการ
10414	7631	1	18	2568	1	6	t	f	\N	วันทำการ
10415	7632	1	18	2568	1	6	t	f	\N	วันทำการ
10416	7633	1	18	2568	1	6	f	f	\N	วันหยุด
10417	7634	1	18	2568	1	6	f	f	\N	วันหยุด
10418	7635	1	18	2568	1	7	t	f	\N	วันทำการ
10419	7636	1	18	2568	1	7	t	f	\N	วันทำการ
10420	7637	1	18	2568	1	7	t	f	\N	วันทำการ
10421	7638	1	18	2568	1	7	t	f	\N	วันทำการ
10422	7639	1	18	2568	1	7	t	f	\N	วันทำการ
10423	7640	1	18	2568	1	7	f	f	\N	วันหยุด
10424	7641	1	18	2568	1	7	f	f	\N	วันหยุด
10425	7642	1	18	2568	1	8	f	t	นักขัตฤกษ์	วันหยุดนักขัตฤกษ์
10426	7643	1	18	2568	1	8	f	t	วันแม่แห่งชาติ	วันหยุดนักขัตฤกษ์
10427	7644	1	18	2568	1	8	t	f	\N	วันทำการ
10428	7645	1	18	2568	1	8	t	f	\N	วันทำการ
10429	7646	1	18	2568	1	8	t	f	\N	วันทำการ
10430	7647	1	18	2568	1	8	f	f	\N	วันหยุด
10431	7648	1	18	2568	1	8	f	f	\N	วันหยุด
10432	7649	1	18	2568	1	9	t	f	\N	วันทำการ
10433	7650	1	18	2568	1	9	t	f	\N	วันทำการ
10434	7651	1	18	2568	1	9	t	f	\N	วันทำการ
10435	7652	1	18	2568	1	9	t	f	\N	วันทำการ
10436	7653	1	18	2568	1	9	t	f	\N	วันทำการ
10437	7654	1	18	2568	1	9	f	f	\N	วันหยุด
10438	7655	1	18	2568	1	9	f	f	\N	วันหยุด
10439	7656	1	18	2568	1	10	t	f	\N	วันทำการ
10440	7657	1	18	2568	1	10	t	f	\N	วันทำการ
10441	7658	1	18	2568	1	10	t	f	\N	วันทำการ
10442	7659	1	18	2568	1	10	t	f	\N	วันทำการ
10443	7660	1	18	2568	1	10	t	f	\N	วันทำการ
10444	7661	1	18	2568	1	10	f	f	\N	วันหยุด
10445	7662	1	18	2568	1	10	f	f	\N	วันหยุด
10446	7663	1	18	2568	1	11	t	f	\N	วันทำการ
10447	7664	1	18	2568	1	11	t	f	\N	วันทำการ
10448	7665	1	18	2568	1	11	t	f	\N	วันทำการ
10449	7666	1	18	2568	1	11	t	f	\N	วันทำการ
10450	7667	1	18	2568	1	11	t	f	\N	วันทำการ
10451	7668	1	18	2568	1	11	f	f	\N	วันหยุด
10452	7669	1	18	2568	1	11	f	f	\N	วันหยุด
10453	7670	1	18	2568	1	12	t	f	\N	วันทำการ
10454	7671	1	18	2568	1	12	t	f	\N	วันทำการ
10455	7672	1	18	2568	1	12	t	f	\N	วันทำการ
10456	7673	1	18	2568	1	12	t	f	\N	วันทำการ
10457	7674	1	18	2568	1	12	t	f	\N	วันทำการ
10458	7675	1	18	2568	1	12	f	f	\N	วันหยุด
10459	7676	1	18	2568	1	12	f	f	\N	วันหยุด
10460	7677	1	18	2568	1	13	t	f	\N	วันทำการ
10461	7678	1	18	2568	1	13	t	f	\N	วันทำการ
10462	7679	1	18	2568	1	13	t	f	\N	วันทำการ
10463	7680	1	18	2568	1	13	t	f	\N	วันทำการ
10464	7681	1	18	2568	1	13	t	f	\N	วันทำการ
10465	7682	1	18	2568	1	13	f	f	\N	วันหยุด
10466	7683	1	18	2568	1	13	f	f	\N	วันหยุด
10467	7684	1	18	2568	1	14	f	t	วันสงขลานครินทร์	วันหยุดนักขัตฤกษ์
10468	7685	1	18	2568	1	14	t	f	\N	วันทำการ
10469	7686	1	18	2568	1	14	t	f	\N	วันทำการ
10470	7687	1	18	2568	1	14	t	f	\N	วันทำการ
10471	7688	1	18	2568	1	14	t	f	\N	วันทำการ
10472	7689	1	18	2568	1	14	f	f	\N	วันหยุด
10473	7690	1	18	2568	1	14	f	f	\N	วันหยุด
10474	7691	1	18	2568	1	15	t	f	\N	วันทำการ
10475	7692	1	18	2568	1	15	t	f	\N	วันทำการ
10476	7693	1	18	2568	1	15	t	f	\N	วันทำการ
10477	7694	1	18	2568	1	15	t	f	\N	วันทำการ
10478	7695	1	18	2568	1	15	t	f	\N	วันทำการ
10479	7696	1	18	2568	1	15	f	f	\N	วันหยุด
10480	7697	1	18	2568	1	15	f	f	\N	วันหยุด
10481	7698	1	18	2568	1	16	t	f	\N	วันทำการ
10482	7699	1	18	2568	1	16	t	f	\N	วันทำการ
10483	7700	1	18	2568	1	16	t	f	\N	วันทำการ
10484	7701	1	18	2568	1	16	t	f	\N	วันทำการ
10485	7702	1	18	2568	1	16	t	f	\N	วันทำการ
10486	7703	1	18	2568	1	16	f	f	\N	วันหยุด
10487	7704	1	18	2568	1	16	f	f	\N	วันหยุด
10488	7705	1	18	2568	1	17	f	t	วันนวมินทรมหาราช	วันหยุดนักขัตฤกษ์
10489	7706	1	18	2568	1	17	t	f	\N	วันทำการ
10490	7707	1	18	2568	1	17	t	f	\N	วันทำการ
10491	7708	1	18	2568	1	17	t	f	\N	วันทำการ
10492	7709	1	18	2568	1	17	t	f	\N	วันทำการ
10493	7710	1	18	2568	1	17	f	f	\N	วันหยุด
10494	7711	1	18	2568	1	17	f	f	\N	วันหยุด
10495	7712	1	18	2568	1	18	t	f	\N	วันทำการ
10496	7713	1	18	2568	1	18	t	f	\N	วันทำการ
10497	7714	1	18	2568	1	18	t	f	\N	วันทำการ
10498	7715	1	18	2568	1	18	f	t	วันปิยมหาราช	วันหยุดนักขัตฤกษ์
10499	7716	1	18	2568	1	18	t	f	\N	วันทำการ
10500	7717	1	18	2568	1	18	f	f	\N	วันหยุด
10501	7718	1	18	2568	1	18	f	f	\N	วันหยุด
10502	7719	1	18	2568	1	19	t	f	\N	วันทำการ
10503	7720	1	18	2568	1	19	t	f	\N	วันทำการ
10504	7721	1	18	2568	1	19	t	f	\N	วันทำการ
10505	7722	1	18	2568	1	19	t	f	\N	วันทำการ
10506	7723	1	18	2568	1	19	t	f	\N	วันทำการ
10507	7724	1	18	2568	1	19	f	f	\N	วันหยุด
10508	7725	1	18	2568	1	19	f	f	\N	วันหยุด
10509	7726	1	18	2568	1	20	t	f	\N	วันทำการ
10510	7727	1	18	2568	1	20	t	f	\N	วันทำการ
10511	7728	1	18	2568	1	20	t	f	\N	วันทำการ
10512	7729	1	18	2568	1	20	t	f	\N	วันทำการ
10513	7730	1	18	2568	1	20	t	f	\N	วันทำการ
10514	7731	1	18	2568	1	20	f	f	\N	วันหยุด
10515	7732	1	18	2568	1	20	f	f	\N	วันหยุด
10516	7733	1	18	2568	1	21	t	f	\N	วันทำการ
10517	7734	1	18	2568	1	21	t	f	\N	วันทำการ
10518	7735	1	18	2568	1	21	t	f	\N	วันทำการ
10519	7736	1	18	2568	1	21	t	f	\N	วันทำการ
10520	7737	1	18	2568	1	21	t	f	\N	วันทำการ
10521	7738	1	18	2568	1	21	f	f	\N	วันหยุด
10522	7739	1	18	2568	1	21	f	f	\N	วันหยุด
10523	7740	1	18	2568	1	22	t	f	\N	วันทำการ
10524	7741	1	18	2568	1	22	t	f	\N	วันทำการ
10525	7742	1	18	2568	1	22	t	f	\N	วันทำการ
10526	7743	1	18	2568	1	22	t	f	\N	วันทำการ
10527	7744	1	18	2568	1	22	t	f	\N	วันทำการ
10528	7745	1	18	2568	1	22	f	f	\N	วันหยุด
10529	7746	1	18	2568	1	22	f	f	\N	วันหยุด
10530	7747	1	18	2568	1	23	t	f	\N	วันทำการ
10531	7748	1	18	2568	1	23	t	f	\N	วันทำการ
10532	7749	1	18	2568	1	23	t	f	\N	วันทำการ
10533	7750	1	18	2568	1	23	t	f	\N	วันทำการ
10534	7751	1	18	2568	1	23	t	f	\N	วันทำการ
10535	7752	1	18	2568	1	23	f	f	\N	วันหยุด
10536	7753	1	18	2568	1	23	f	f	\N	วันหยุด
10537	7754	1	18	2568	1	24	t	f	\N	วันทำการ
10538	7755	1	18	2568	1	24	t	f	\N	วันทำการ
10539	7756	1	18	2568	1	24	t	f	\N	วันทำการ
10540	7757	1	18	2568	1	24	t	f	\N	วันทำการ
10541	7758	1	18	2568	1	24	f	t	วันพ่อแห่งชาติ	วันหยุดนักขัตฤกษ์
10542	7759	1	18	2568	1	24	f	f	\N	วันหยุด
10543	7760	1	18	2568	1	24	f	f	\N	วันหยุด
10544	7761	1	18	2568	1	25	t	f	\N	วันทำการ
10545	7762	1	18	2568	1	25	t	f	\N	วันทำการ
10546	7763	1	18	2568	1	25	f	t	วันรัฐธรรมนูญ	วันหยุดนักขัตฤกษ์
10547	7764	1	18	2568	1	25	t	f	\N	วันทำการ
10548	7765	1	18	2568	1	25	t	f	\N	วันทำการ
10549	7766	1	18	2568	1	25	f	f	\N	วันหยุด
10550	7767	1	18	2568	1	25	f	f	\N	วันหยุด
10551	7768	1	18	2568	1	26	t	f	\N	วันทำการ
10552	7769	1	18	2568	1	26	t	f	\N	วันทำการ
10553	7770	1	18	2568	1	26	t	f	\N	วันทำการ
10554	7771	1	18	2568	1	26	t	f	\N	วันทำการ
10555	7772	1	18	2568	1	26	t	f	\N	วันทำการ
10556	7773	1	18	2568	1	26	f	f	\N	วันหยุด
10557	7774	1	18	2568	1	26	f	f	\N	วันหยุด
10558	7775	1	18	2568	1	27	t	f	\N	วันทำการ
10559	7776	1	18	2568	1	27	t	f	\N	วันทำการ
10560	7777	1	18	2568	1	27	f	t	วันคริสต์มาสอีฟ	วันหยุดนักขัตฤกษ์
10561	7778	1	18	2568	1	27	f	t	วันคริสต์มาส	วันหยุดนักขัตฤกษ์
10562	7779	1	18	2568	1	27	t	f	\N	วันทำการ
10563	7780	1	18	2568	1	27	f	f	\N	วันหยุด
10564	7781	1	18	2568	1	27	f	f	\N	วันหยุด
10565	7782	1	18	2568	1	28	t	f	\N	วันทำการ
10566	7783	1	18	2568	1	28	t	f	\N	วันทำการ
10567	7784	1	18	2568	1	28	f	t	วันสิ้นปี	วันหยุดนักขัตฤกษ์
10568	7785	1	18	2568	1	28	f	t	วันขื้นปีใหม่	วันหยุดนักขัตฤกษ์
10569	7786	1	18	2568	1	28	f	t	วันหยุดราชการธันวาคม	วันหยุดนักขัตฤกษ์
10570	7787	1	18	2568	1	28	f	f	\N	วันหยุด
10571	7788	1	18	2568	1	28	f	f	\N	วันหยุด
10572	7789	1	18	2568	1	29	t	f	\N	วันทำการ
10573	7790	1	18	2568	1	29	t	f	\N	วันทำการ
10574	7791	1	18	2568	1	29	t	f	\N	วันทำการ
10575	7792	1	18	2568	1	29	t	f	\N	วันทำการ
10576	7793	1	18	2568	1	29	t	f	\N	วันทำการ
10577	7794	1	18	2568	1	29	f	f	\N	วันหยุด
10578	7795	1	18	2568	1	29	f	f	\N	วันหยุด
10579	7796	1	18	2568	1	30	t	f	\N	วันทำการ
10580	7797	1	18	2568	1	30	t	f	\N	วันทำการ
10581	7798	1	18	2568	1	30	t	f	\N	วันทำการ
10582	7799	1	18	2568	1	30	t	f	\N	วันทำการ
10583	7800	1	18	2568	1	30	t	f	\N	วันทำการ
10584	7801	1	18	2568	1	30	f	f	\N	วันหยุด
10585	7802	1	18	2568	1	30	f	f	\N	วันหยุด
10586	7803	1	18	2568	1	31	t	f	\N	วันทำการ
10587	7804	1	18	2568	1	31	t	f	\N	วันทำการ
10588	7805	1	18	2568	1	31	t	f	\N	วันทำการ
10589	7806	1	18	2568	1	31	t	f	\N	วันทำการ
10590	7807	1	18	2568	1	31	t	f	\N	วันทำการ
10591	7808	1	18	2568	1	31	f	f	\N	วันหยุด
10592	7809	1	18	2568	1	31	f	f	\N	วันหยุด
10593	7810	1	18	2568	1	32	t	f	\N	วันทำการ
10594	7811	1	18	2568	1	32	t	f	\N	วันทำการ
10595	7812	1	18	2568	1	32	t	f	\N	วันทำการ
10596	7813	1	18	2568	1	32	t	f	\N	วันทำการ
10597	7814	1	18	2568	1	32	t	f	\N	วันทำการ
10598	7815	1	18	2568	1	32	f	f	\N	วันหยุด
10599	7816	1	18	2568	1	32	f	t	วันมาฆบูชา	วันหยุดนักขัตฤกษ์
10600	7817	1	18	2568	1	33	t	f	\N	วันทำการ
10601	7818	1	18	2568	1	33	t	f	\N	วันทำการ
10602	7819	1	18	2568	1	33	t	f	\N	วันทำการ
10603	7820	1	18	2568	1	33	t	f	\N	วันทำการ
10604	7821	1	18	2568	1	33	t	f	\N	วันทำการ
10605	7822	1	18	2568	1	33	f	f	\N	วันหยุด
10606	7823	1	18	2568	1	33	f	f	\N	วันหยุด
10607	7824	1	18	2568	1	34	t	f	\N	วันทำการ
10608	7825	1	18	2568	1	34	t	f	\N	วันทำการ
10609	7826	1	18	2568	1	34	t	f	\N	วันทำการ
10610	7827	1	18	2568	1	34	t	f	\N	วันทำการ
10611	7828	1	18	2568	1	34	t	f	\N	วันทำการ
10612	7829	1	18	2568	1	34	f	t	วันวาเลนไทน์	วันหยุดนักขัตฤกษ์
10613	7830	1	18	2568	1	34	f	f	\N	วันหยุด
10614	7831	1	18	2568	1	35	t	f	\N	วันทำการ
10615	7832	1	18	2568	1	35	f	t	วันตรุษจีน	วันหยุดนักขัตฤกษ์
10616	7833	1	18	2568	1	35	f	t	วันตรุษจีน (วันที่ 2)	วันหยุดนักขัตฤกษ์
10617	7834	1	18	2568	1	35	f	t	วันตรุษจีน (วันที่ 3)	วันหยุดนักขัตฤกษ์
10618	7835	1	18	2568	1	35	t	f	\N	วันทำการ
10619	7836	1	18	2568	1	35	f	f	\N	วันหยุด
10620	7837	1	18	2568	1	35	f	f	\N	วันหยุด
10621	7838	1	18	2568	1	36	t	f	\N	วันทำการ
10622	7839	1	18	2568	1	36	t	f	\N	วันทำการ
10623	7840	1	18	2568	1	36	t	f	\N	วันทำการ
10624	7841	1	18	2568	1	36	t	f	\N	วันทำการ
10625	7842	1	18	2568	1	36	t	f	\N	วันทำการ
10626	7843	1	18	2568	1	36	f	f	\N	วันหยุด
10627	7844	1	18	2568	1	36	f	f	\N	วันหยุด
10628	7845	1	18	2568	1	37	t	f	\N	วันทำการ
10629	7846	1	18	2568	1	37	f	t	วันมาฆบูชา	วันหยุดนักขัตฤกษ์
10630	7847	1	18	2568	1	37	t	f	\N	วันทำการ
10631	7848	1	18	2568	1	37	t	f	\N	วันทำการ
10632	7849	1	18	2568	1	37	t	f	\N	วันทำการ
10633	7850	1	18	2568	1	37	f	f	\N	วันหยุด
10634	7851	1	18	2568	1	37	f	f	\N	วันหยุด
10635	7852	1	18	2568	1	38	t	f	\N	วันทำการ
10636	7853	1	18	2568	1	38	t	f	\N	วันทำการ
10637	7854	1	18	2568	1	38	t	f	\N	วันทำการ
10638	7855	1	18	2568	1	38	t	f	\N	วันทำการ
10639	7856	1	18	2568	1	38	t	f	\N	วันทำการ
10640	7857	1	18	2568	1	38	f	f	\N	วันหยุด
10641	7858	1	18	2568	1	38	f	f	\N	วันหยุด
10642	7859	1	18	2568	1	39	t	f	\N	วันทำการ
10643	7860	1	18	2568	1	39	t	f	\N	วันทำการ
10644	7861	1	18	2568	1	39	t	f	\N	วันทำการ
10645	7862	1	18	2568	1	39	t	f	\N	วันทำการ
10646	7863	1	18	2568	1	39	t	f	\N	วันทำการ
10647	7864	1	18	2568	1	39	f	f	\N	วันหยุด
10648	7865	1	18	2568	1	39	f	f	\N	วันหยุด
10649	7866	1	18	2568	1	40	t	f	\N	วันทำการ
10650	7867	1	18	2568	1	40	t	f	\N	วันทำการ
10651	7868	1	18	2568	1	40	t	f	\N	วันทำการ
10652	7869	1	18	2568	1	40	t	f	\N	วันทำการ
10653	7870	1	18	2568	1	40	t	f	\N	วันทำการ
10654	7871	1	18	2568	1	40	f	f	\N	วันหยุด
10655	7872	1	18	2568	1	40	f	f	\N	วันหยุด
10656	7873	1	18	2568	1	41	t	f	\N	วันทำการ
10657	7874	1	18	2568	1	41	t	f	\N	วันทำการ
10658	7875	1	18	2568	1	41	t	f	\N	วันทำการ
10659	7876	1	18	2568	1	41	t	f	\N	วันทำการ
10660	7877	1	18	2568	1	41	t	f	\N	วันทำการ
10661	7878	1	18	2568	1	41	f	f	\N	วันหยุด
10662	7879	1	18	2568	1	41	f	f	\N	วันหยุด
10663	7880	1	18	2568	1	42	f	t	วันจักรี	วันหยุดนักขัตฤกษ์
10664	7881	1	18	2568	1	42	t	f	\N	วันทำการ
10665	7882	1	18	2568	1	42	t	f	\N	วันทำการ
10666	7883	1	18	2568	1	42	t	f	\N	วันทำการ
10667	7884	1	18	2568	1	42	t	f	\N	วันทำการ
10668	7885	1	18	2568	1	42	f	f	\N	วันหยุด
10669	7886	1	18	2568	1	42	f	f	\N	วันหยุด
10670	7887	1	18	2568	1	43	f	t	วันสงกรานต์	วันหยุดนักขัตฤกษ์
10671	7888	1	18	2568	1	43	f	t	วันสงกรานต์	วันหยุดนักขัตฤกษ์
10672	7889	1	18	2568	1	43	f	t	วันสงกรานต์	วันหยุดนักขัตฤกษ์
10673	7890	1	18	2568	1	43	t	f	\N	วันทำการ
10674	7891	1	18	2568	1	43	t	f	\N	วันทำการ
10675	7892	1	18	2568	1	43	f	f	\N	วันหยุด
10676	7893	1	18	2568	1	43	f	f	\N	วันหยุด
10677	7894	1	18	2568	1	44	t	f	\N	วันทำการ
10678	7895	1	18	2568	1	44	t	f	\N	วันทำการ
10679	7896	1	18	2568	1	44	t	f	\N	วันทำการ
10680	7897	1	18	2568	1	44	t	f	\N	วันทำการ
10681	7898	1	18	2568	1	44	t	f	\N	วันทำการ
9417	7593	1	1	2568	1	1	t	f	\N	วันทำการ
9418	7594	1	1	2568	1	1	t	f	\N	วันทำการ
9419	7595	1	1	2568	1	1	t	f	\N	วันทำการ
9420	7596	1	1	2568	1	1	t	f	\N	วันทำการ
9421	7597	1	1	2568	1	1	t	f	\N	วันทำการ
9422	7598	1	1	2568	1	1	f	f	\N	วันหยุด
9423	7599	1	1	2568	1	1	f	f	\N	วันหยุด
9424	7600	1	1	2568	1	2	t	f	\N	วันทำการ
9425	7601	1	1	2568	1	2	t	f	\N	วันทำการ
9426	7602	1	1	2568	1	2	t	f	\N	วันทำการ
9427	7603	1	1	2568	1	2	t	f	\N	วันทำการ
9428	7604	1	1	2568	1	2	t	f	\N	วันทำการ
9429	7605	1	1	2568	1	2	f	f	\N	วันหยุด
9430	7606	1	1	2568	1	2	f	f	\N	วันหยุด
9431	7607	1	1	2568	1	3	t	f	\N	วันทำการ
9432	7608	1	1	2568	1	3	t	f	\N	วันทำการ
9433	7609	1	1	2568	1	3	t	f	\N	วันทำการ
9434	7610	1	1	2568	1	3	f	t	วันอาสาฬหบูชา	วันหยุดนักขัตฤกษ์
9435	7611	1	1	2568	1	3	f	t	วันเข้าพรรษา	วันหยุดนักขัตฤกษ์
9436	7612	1	1	2568	1	3	f	f	\N	วันหยุด
9437	7613	1	1	2568	1	3	f	f	\N	วันหยุด
9438	7614	1	1	2568	1	4	f	t	ชดเชยวันอาสาฬหบูชา	วันหยุดนักขัตฤกษ์
9439	7615	1	1	2568	1	4	t	f	\N	วันทำการ
9440	7616	1	1	2568	1	4	t	f	\N	วันทำการ
9441	7617	1	1	2568	1	4	t	f	\N	วันทำการ
9442	7618	1	1	2568	1	4	t	f	\N	วันทำการ
9443	7619	1	1	2568	1	4	f	f	\N	วันหยุด
9444	7620	1	1	2568	1	4	f	f	\N	วันหยุด
9445	7621	1	1	2568	1	5	t	f	\N	วันทำการ
9446	7622	1	1	2568	1	5	t	f	\N	วันทำการ
9447	7623	1	1	2568	1	5	t	f	\N	วันทำการ
9448	7624	1	1	2568	1	5	t	f	\N	วันทำการ
9449	7625	1	1	2568	1	5	t	f	\N	วันทำการ
9450	7626	1	1	2568	1	5	f	f	\N	วันหยุด
9451	7627	1	1	2568	1	5	f	f	\N	วันหยุด
9452	7628	1	1	2568	1	6	f	t	วันเฉลิมฯ ร.10	วันหยุดนักขัตฤกษ์
9453	7629	1	1	2568	1	6	t	f	\N	วันทำการ
9454	7630	1	1	2568	1	6	t	f	\N	วันทำการ
9455	7631	1	1	2568	1	6	t	f	\N	วันทำการ
9456	7632	1	1	2568	1	6	t	f	\N	วันทำการ
9457	7633	1	1	2568	1	6	f	f	\N	วันหยุด
9458	7634	1	1	2568	1	6	f	f	\N	วันหยุด
9459	7635	1	1	2568	1	7	t	f	\N	วันทำการ
9460	7636	1	1	2568	1	7	t	f	\N	วันทำการ
9461	7637	1	1	2568	1	7	t	f	\N	วันทำการ
9462	7638	1	1	2568	1	7	t	f	\N	วันทำการ
9463	7639	1	1	2568	1	7	t	f	\N	วันทำการ
9464	7640	1	1	2568	1	7	f	f	\N	วันหยุด
9465	7641	1	1	2568	1	7	f	f	\N	วันหยุด
9466	7642	1	1	2568	1	8	f	t	นักขัตฤกษ์	วันหยุดนักขัตฤกษ์
9467	7643	1	1	2568	1	8	f	t	วันแม่แห่งชาติ	วันหยุดนักขัตฤกษ์
9468	7644	1	1	2568	1	8	t	f	\N	วันทำการ
9469	7645	1	1	2568	1	8	t	f	\N	วันทำการ
9470	7646	1	1	2568	1	8	t	f	\N	วันทำการ
9471	7647	1	1	2568	1	8	f	f	\N	วันหยุด
9472	7648	1	1	2568	1	8	f	f	\N	วันหยุด
9473	7649	1	1	2568	1	9	t	f	\N	วันทำการ
9474	7650	1	1	2568	1	9	t	f	\N	วันทำการ
9475	7651	1	1	2568	1	9	t	f	\N	วันทำการ
9476	7652	1	1	2568	1	9	t	f	\N	วันทำการ
9477	7653	1	1	2568	1	9	t	f	\N	วันทำการ
9478	7654	1	1	2568	1	9	f	f	\N	วันหยุด
9479	7655	1	1	2568	1	9	f	f	\N	วันหยุด
9480	7656	1	1	2568	1	10	t	f	\N	วันทำการ
9481	7657	1	1	2568	1	10	t	f	\N	วันทำการ
9482	7658	1	1	2568	1	10	t	f	\N	วันทำการ
9483	7659	1	1	2568	1	10	t	f	\N	วันทำการ
9484	7660	1	1	2568	1	10	t	f	\N	วันทำการ
9485	7661	1	1	2568	1	10	f	f	\N	วันหยุด
9486	7662	1	1	2568	1	10	f	f	\N	วันหยุด
9487	7663	1	1	2568	1	11	t	f	\N	วันทำการ
9488	7664	1	1	2568	1	11	t	f	\N	วันทำการ
9489	7665	1	1	2568	1	11	t	f	\N	วันทำการ
9490	7666	1	1	2568	1	11	t	f	\N	วันทำการ
9491	7667	1	1	2568	1	11	t	f	\N	วันทำการ
9492	7668	1	1	2568	1	11	f	f	\N	วันหยุด
9493	7669	1	1	2568	1	11	f	f	\N	วันหยุด
9494	7670	1	1	2568	1	12	t	f	\N	วันทำการ
9495	7671	1	1	2568	1	12	t	f	\N	วันทำการ
9496	7672	1	1	2568	1	12	t	f	\N	วันทำการ
9497	7673	1	1	2568	1	12	t	f	\N	วันทำการ
9498	7674	1	1	2568	1	12	t	f	\N	วันทำการ
9499	7675	1	1	2568	1	12	f	f	\N	วันหยุด
9500	7676	1	1	2568	1	12	f	f	\N	วันหยุด
9501	7677	1	1	2568	1	13	t	f	\N	วันทำการ
9502	7678	1	1	2568	1	13	t	f	\N	วันทำการ
9503	7679	1	1	2568	1	13	t	f	\N	วันทำการ
9504	7680	1	1	2568	1	13	t	f	\N	วันทำการ
9505	7681	1	1	2568	1	13	t	f	\N	วันทำการ
9506	7682	1	1	2568	1	13	f	f	\N	วันหยุด
9507	7683	1	1	2568	1	13	f	f	\N	วันหยุด
9508	7684	1	1	2568	1	14	f	t	วันสงขลานครินทร์	วันหยุดนักขัตฤกษ์
9509	7685	1	1	2568	1	14	t	f	\N	วันทำการ
9510	7686	1	1	2568	1	14	t	f	\N	วันทำการ
9511	7687	1	1	2568	1	14	t	f	\N	วันทำการ
9512	7688	1	1	2568	1	14	t	f	\N	วันทำการ
9513	7689	1	1	2568	1	14	f	f	\N	วันหยุด
9514	7690	1	1	2568	1	14	f	f	\N	วันหยุด
9515	7691	1	1	2568	1	15	t	f	\N	วันทำการ
9516	7692	1	1	2568	1	15	t	f	\N	วันทำการ
9517	7693	1	1	2568	1	15	t	f	\N	วันทำการ
9518	7694	1	1	2568	1	15	t	f	\N	วันทำการ
9519	7695	1	1	2568	1	15	t	f	\N	วันทำการ
9520	7696	1	1	2568	1	15	f	f	\N	วันหยุด
9521	7697	1	1	2568	1	15	f	f	\N	วันหยุด
9522	7698	1	1	2568	1	16	t	f	\N	วันทำการ
9523	7699	1	1	2568	1	16	t	f	\N	วันทำการ
9524	7700	1	1	2568	1	16	t	f	\N	วันทำการ
9525	7701	1	1	2568	1	16	t	f	\N	วันทำการ
9526	7702	1	1	2568	1	16	t	f	\N	วันทำการ
9527	7703	1	1	2568	1	16	f	f	\N	วันหยุด
9528	7704	1	1	2568	1	16	f	f	\N	วันหยุด
9529	7705	1	1	2568	1	17	f	t	วันนวมินทรมหาราช	วันหยุดนักขัตฤกษ์
9530	7706	1	1	2568	1	17	t	f	\N	วันทำการ
9531	7707	1	1	2568	1	17	t	f	\N	วันทำการ
9532	7708	1	1	2568	1	17	t	f	\N	วันทำการ
9533	7709	1	1	2568	1	17	t	f	\N	วันทำการ
9534	7710	1	1	2568	1	17	f	f	\N	วันหยุด
9535	7711	1	1	2568	1	17	f	f	\N	วันหยุด
9536	7712	1	1	2568	1	18	t	f	\N	วันทำการ
9537	7713	1	1	2568	1	18	t	f	\N	วันทำการ
9538	7714	1	1	2568	1	18	t	f	\N	วันทำการ
9539	7715	1	1	2568	1	18	f	t	วันปิยมหาราช	วันหยุดนักขัตฤกษ์
9540	7716	1	1	2568	1	18	t	f	\N	วันทำการ
9541	7717	1	1	2568	1	18	f	f	\N	วันหยุด
9542	7718	1	1	2568	1	18	f	f	\N	วันหยุด
9543	7719	1	1	2568	1	19	t	f	\N	วันทำการ
9544	7720	1	1	2568	\N	\N	f	f	\N	ปิดภาค
9545	7721	1	1	2568	\N	\N	f	f	\N	ปิดภาค
9546	7722	1	1	2568	\N	\N	f	f	\N	ปิดภาค
9547	7723	1	1	2568	\N	\N	f	f	\N	ปิดภาค
9548	7724	1	1	2568	\N	\N	f	f	\N	วันหยุด
9549	7725	1	1	2568	\N	\N	f	f	\N	วันหยุด
9550	7726	1	1	2568	\N	\N	f	f	\N	ปิดภาค
9551	7727	1	1	2568	\N	\N	f	f	\N	ปิดภาค
9552	7728	1	1	2568	\N	\N	f	f	\N	ปิดภาค
9553	7729	1	1	2568	\N	\N	f	f	\N	ปิดภาค
9554	7730	1	1	2568	\N	\N	f	f	\N	ปิดภาค
9555	7731	1	1	2568	\N	\N	f	f	\N	วันหยุด
9556	7732	1	1	2568	\N	\N	f	f	\N	วันหยุด
9557	7733	1	1	2568	\N	\N	f	f	\N	ปิดภาค
9558	7734	1	1	2568	\N	\N	f	f	\N	ปิดภาค
9559	7735	1	1	2568	\N	\N	f	f	\N	ปิดภาค
9560	7736	1	1	2568	\N	\N	f	f	\N	ปิดภาค
9561	7737	1	1	2568	\N	\N	f	f	\N	ปิดภาค
9562	7738	1	1	2568	\N	\N	f	f	\N	วันหยุด
9563	7739	1	1	2568	\N	\N	f	f	\N	วันหยุด
9564	7740	1	1	2568	2	1	t	f	\N	วันทำการ
9565	7741	1	1	2568	2	1	t	f	\N	วันทำการ
9566	7742	1	1	2568	2	1	t	f	\N	วันทำการ
9567	7743	1	1	2568	2	1	t	f	\N	วันทำการ
9568	7744	1	1	2568	2	1	t	f	\N	วันทำการ
9569	7745	1	1	2568	2	1	f	f	\N	วันหยุด
9570	7746	1	1	2568	2	1	f	f	\N	วันหยุด
9571	7747	1	1	2568	2	2	t	f	\N	วันทำการ
9572	7748	1	1	2568	2	2	t	f	\N	วันทำการ
9573	7749	1	1	2568	2	2	t	f	\N	วันทำการ
9574	7750	1	1	2568	2	2	t	f	\N	วันทำการ
9575	7751	1	1	2568	2	2	t	f	\N	วันทำการ
9576	7752	1	1	2568	2	2	f	f	\N	วันหยุด
9577	7753	1	1	2568	2	2	f	f	\N	วันหยุด
9578	7754	1	1	2568	2	3	t	f	\N	วันทำการ
9579	7755	1	1	2568	2	3	t	f	\N	วันทำการ
9580	7756	1	1	2568	2	3	t	f	\N	วันทำการ
9581	7757	1	1	2568	2	3	t	f	\N	วันทำการ
9582	7758	1	1	2568	2	3	f	t	วันพ่อแห่งชาติ	วันหยุดนักขัตฤกษ์
9583	7759	1	1	2568	2	3	f	f	\N	วันหยุด
9584	7760	1	1	2568	2	3	f	f	\N	วันหยุด
9585	7761	1	1	2568	2	4	t	f	\N	วันทำการ
9586	7762	1	1	2568	2	4	t	f	\N	วันทำการ
9587	7763	1	1	2568	2	4	f	t	วันรัฐธรรมนูญ	วันหยุดนักขัตฤกษ์
9588	7764	1	1	2568	2	4	t	f	\N	วันทำการ
9589	7765	1	1	2568	2	4	t	f	\N	วันทำการ
9590	7766	1	1	2568	2	4	f	f	\N	วันหยุด
9591	7767	1	1	2568	2	4	f	f	\N	วันหยุด
9592	7768	1	1	2568	2	5	t	f	\N	วันทำการ
9593	7769	1	1	2568	2	5	t	f	\N	วันทำการ
9594	7770	1	1	2568	2	5	t	f	\N	วันทำการ
9595	7771	1	1	2568	2	5	t	f	\N	วันทำการ
9596	7772	1	1	2568	2	5	t	f	\N	วันทำการ
9597	7773	1	1	2568	2	5	f	f	\N	วันหยุด
9598	7774	1	1	2568	2	5	f	f	\N	วันหยุด
9599	7775	1	1	2568	2	6	t	f	\N	วันทำการ
9600	7776	1	1	2568	2	6	t	f	\N	วันทำการ
9601	7777	1	1	2568	2	6	f	t	วันคริสต์มาสอีฟ	วันหยุดนักขัตฤกษ์
9602	7778	1	1	2568	2	6	f	t	วันคริสต์มาส	วันหยุดนักขัตฤกษ์
9603	7779	1	1	2568	2	6	t	f	\N	วันทำการ
9604	7780	1	1	2568	2	6	f	f	\N	วันหยุด
9605	7781	1	1	2568	2	6	f	f	\N	วันหยุด
9606	7782	1	1	2568	2	7	t	f	\N	วันทำการ
9607	7783	1	1	2568	2	7	t	f	\N	วันทำการ
9608	7784	1	1	2568	2	7	f	t	วันสิ้นปี	วันหยุดนักขัตฤกษ์
9609	7785	1	1	2568	2	7	f	t	วันขื้นปีใหม่	วันหยุดนักขัตฤกษ์
9610	7786	1	1	2568	2	7	f	t	วันหยุดราชการธันวาคม	วันหยุดนักขัตฤกษ์
9611	7787	1	1	2568	2	7	f	f	\N	วันหยุด
9612	7788	1	1	2568	2	7	f	f	\N	วันหยุด
9613	7789	1	1	2568	2	8	t	f	\N	วันทำการ
9614	7790	1	1	2568	2	8	t	f	\N	วันทำการ
9615	7791	1	1	2568	2	8	t	f	\N	วันทำการ
9616	7792	1	1	2568	2	8	t	f	\N	วันทำการ
9617	7793	1	1	2568	2	8	t	f	\N	วันทำการ
9618	7794	1	1	2568	2	8	f	f	\N	วันหยุด
9619	7795	1	1	2568	2	8	f	f	\N	วันหยุด
9620	7796	1	1	2568	2	9	t	f	\N	วันทำการ
9621	7797	1	1	2568	2	9	t	f	\N	วันทำการ
9622	7798	1	1	2568	2	9	t	f	\N	วันทำการ
9623	7799	1	1	2568	2	9	t	f	\N	วันทำการ
9624	7800	1	1	2568	2	9	t	f	\N	วันทำการ
9625	7801	1	1	2568	2	9	f	f	\N	วันหยุด
9626	7802	1	1	2568	2	9	f	f	\N	วันหยุด
9627	7803	1	1	2568	2	10	t	f	\N	วันทำการ
9628	7804	1	1	2568	2	10	t	f	\N	วันทำการ
9629	7805	1	1	2568	2	10	t	f	\N	วันทำการ
9630	7806	1	1	2568	2	10	t	f	\N	วันทำการ
9631	7807	1	1	2568	2	10	t	f	\N	วันทำการ
9632	7808	1	1	2568	2	10	f	f	\N	วันหยุด
9633	7809	1	1	2568	2	10	f	f	\N	วันหยุด
9634	7810	1	1	2568	2	11	t	f	\N	วันทำการ
9635	7811	1	1	2568	2	11	t	f	\N	วันทำการ
9636	7812	1	1	2568	2	11	t	f	\N	วันทำการ
9637	7813	1	1	2568	2	11	t	f	\N	วันทำการ
9638	7814	1	1	2568	2	11	t	f	\N	วันทำการ
9639	7815	1	1	2568	2	11	f	f	\N	วันหยุด
9640	7816	1	1	2568	2	11	f	t	วันมาฆบูชา	วันหยุดนักขัตฤกษ์
9641	7817	1	1	2568	2	12	t	f	\N	วันทำการ
9642	7818	1	1	2568	2	12	t	f	\N	วันทำการ
9643	7819	1	1	2568	2	12	t	f	\N	วันทำการ
9644	7820	1	1	2568	2	12	t	f	\N	วันทำการ
9645	7821	1	1	2568	2	12	t	f	\N	วันทำการ
9646	7822	1	1	2568	2	12	f	f	\N	วันหยุด
9647	7823	1	1	2568	2	12	f	f	\N	วันหยุด
9648	7824	1	1	2568	2	13	t	f	\N	วันทำการ
9649	7825	1	1	2568	2	13	t	f	\N	วันทำการ
9650	7826	1	1	2568	2	13	t	f	\N	วันทำการ
9651	7827	1	1	2568	2	13	t	f	\N	วันทำการ
9652	7828	1	1	2568	2	13	t	f	\N	วันทำการ
9653	7829	1	1	2568	2	13	f	t	วันวาเลนไทน์	วันหยุดนักขัตฤกษ์
9654	7830	1	1	2568	2	13	f	f	\N	วันหยุด
9655	7831	1	1	2568	2	14	t	f	\N	วันทำการ
9656	7832	1	1	2568	2	14	f	t	วันตรุษจีน	วันหยุดนักขัตฤกษ์
9657	7833	1	1	2568	2	14	f	t	วันตรุษจีน (วันที่ 2)	วันหยุดนักขัตฤกษ์
9658	7834	1	1	2568	2	14	f	t	วันตรุษจีน (วันที่ 3)	วันหยุดนักขัตฤกษ์
9659	7835	1	1	2568	2	14	t	f	\N	วันทำการ
9660	7836	1	1	2568	2	14	f	f	\N	วันหยุด
9661	7837	1	1	2568	2	14	f	f	\N	วันหยุด
9662	7838	1	1	2568	2	15	t	f	\N	วันทำการ
9663	7839	1	1	2568	2	15	t	f	\N	วันทำการ
9664	7840	1	1	2568	2	15	t	f	\N	วันทำการ
9665	7841	1	1	2568	2	15	t	f	\N	วันทำการ
9666	7842	1	1	2568	2	15	t	f	\N	วันทำการ
9667	7843	1	1	2568	2	15	f	f	\N	วันหยุด
9668	7844	1	1	2568	2	15	f	f	\N	วันหยุด
9669	7845	1	1	2568	2	16	t	f	\N	วันทำการ
9670	7846	1	1	2568	2	16	f	t	วันมาฆบูชา	วันหยุดนักขัตฤกษ์
9671	7847	1	1	2568	2	16	t	f	\N	วันทำการ
9672	7848	1	1	2568	2	16	t	f	\N	วันทำการ
9673	7849	1	1	2568	2	16	t	f	\N	วันทำการ
9674	7850	1	1	2568	2	16	f	f	\N	วันหยุด
9675	7851	1	1	2568	2	16	f	f	\N	วันหยุด
9676	7852	1	1	2568	2	17	t	f	\N	วันทำการ
9677	7853	1	1	2568	2	17	t	f	\N	วันทำการ
9678	7854	1	1	2568	2	17	t	f	\N	วันทำการ
9679	7855	1	1	2568	2	17	t	f	\N	วันทำการ
9680	7856	1	1	2568	2	17	t	f	\N	วันทำการ
9681	7857	1	1	2568	2	17	f	f	\N	วันหยุด
9682	7858	1	1	2568	2	17	f	f	\N	วันหยุด
9683	7859	1	1	2568	2	18	t	f	\N	วันทำการ
9684	7860	1	1	2568	2	18	t	f	\N	วันทำการ
9685	7861	1	1	2568	2	18	t	f	\N	วันทำการ
9686	7862	1	1	2568	2	18	t	f	\N	วันทำการ
9687	7863	1	1	2568	2	18	t	f	\N	วันทำการ
9688	7864	1	1	2568	2	18	f	f	\N	วันหยุด
9689	7865	1	1	2568	\N	\N	f	f	\N	วันหยุด
9690	7866	1	1	2568	\N	\N	f	f	\N	ปิดภาค
9691	7867	1	1	2568	\N	\N	f	f	\N	ปิดภาค
9692	7868	1	1	2568	\N	\N	f	f	\N	ปิดภาค
9693	7869	1	1	2568	\N	\N	f	f	\N	ปิดภาค
9694	7870	1	1	2568	\N	\N	f	f	\N	ปิดภาค
9695	7871	1	1	2568	\N	\N	f	f	\N	วันหยุด
9696	7872	1	1	2568	\N	\N	f	f	\N	วันหยุด
9697	7873	1	1	2568	\N	\N	f	f	\N	ปิดภาค
9698	7874	1	1	2568	\N	\N	f	f	\N	ปิดภาค
9699	7875	1	1	2568	\N	\N	f	f	\N	ปิดภาค
9700	7876	1	1	2568	\N	\N	f	f	\N	ปิดภาค
9701	7877	1	1	2568	\N	\N	f	f	\N	ปิดภาค
9702	7878	1	1	2568	\N	\N	f	f	\N	วันหยุด
9703	7879	1	1	2568	\N	\N	f	f	\N	วันหยุด
9704	7880	1	1	2568	\N	\N	f	t	วันจักรี	วันหยุดนักขัตฤกษ์
9705	7881	1	1	2568	\N	\N	f	f	\N	ปิดภาค
9706	7882	1	1	2568	\N	\N	f	f	\N	ปิดภาค
9707	7883	1	1	2568	\N	\N	f	f	\N	ปิดภาค
9708	7884	1	1	2568	\N	\N	f	f	\N	ปิดภาค
9709	7885	1	1	2568	\N	\N	f	f	\N	วันหยุด
9710	7886	1	1	2568	\N	\N	f	f	\N	วันหยุด
9711	7887	1	1	2568	\N	\N	f	t	วันสงกรานต์	วันหยุดนักขัตฤกษ์
9712	7888	1	1	2568	\N	\N	f	t	วันสงกรานต์	วันหยุดนักขัตฤกษ์
9713	7889	1	1	2568	\N	\N	f	t	วันสงกรานต์	วันหยุดนักขัตฤกษ์
9714	7890	1	1	2568	3	1	t	f	\N	วันทำการ
9715	7891	1	1	2568	3	1	t	f	\N	วันทำการ
9716	7892	1	1	2568	3	1	f	f	\N	วันหยุด
9717	7893	1	1	2568	3	1	f	f	\N	วันหยุด
9718	7894	1	1	2568	3	2	t	f	\N	วันทำการ
9719	7895	1	1	2568	3	2	t	f	\N	วันทำการ
9720	7896	1	1	2568	3	2	t	f	\N	วันทำการ
9721	7897	1	1	2568	3	2	t	f	\N	วันทำการ
9722	7898	1	1	2568	3	2	t	f	\N	วันทำการ
9723	7899	1	1	2568	3	2	f	f	\N	วันหยุด
9724	7900	1	1	2568	3	2	f	f	\N	วันหยุด
9725	7901	1	1	2568	3	3	t	f	\N	วันทำการ
9726	7902	1	1	2568	3	3	t	f	\N	วันทำการ
9727	7903	1	1	2568	3	3	t	f	\N	วันทำการ
9728	7904	1	1	2568	3	3	t	f	\N	วันทำการ
9729	7905	1	1	2568	3	3	f	t	วันแรงงานแห่งชาติ	วันหยุดนักขัตฤกษ์
9730	7906	1	1	2568	3	3	f	f	\N	วันหยุด
9731	7907	1	1	2568	3	3	f	f	\N	วันหยุด
9732	7908	1	1	2568	3	4	f	t	วันฉัตรมงคล	วันหยุดนักขัตฤกษ์
9733	7909	1	1	2568	3	4	t	f	\N	วันทำการ
9734	7910	1	1	2568	3	4	t	f	\N	วันทำการ
9735	7911	1	1	2568	3	4	t	f	\N	วันทำการ
9736	7912	1	1	2568	3	4	t	f	\N	วันทำการ
9737	7913	1	1	2568	3	4	f	f	\N	วันหยุด
9738	7914	1	1	2568	3	4	f	f	\N	วันหยุด
9739	7915	1	1	2568	3	5	f	t	วันพืชมงคล	วันหยุดนักขัตฤกษ์
9740	7916	1	1	2568	3	5	t	f	\N	วันทำการ
9741	7917	1	1	2568	3	5	t	f	\N	วันทำการ
9742	7918	1	1	2568	3	5	t	f	\N	วันทำการ
9743	7919	1	1	2568	3	5	t	f	\N	วันทำการ
9744	7920	1	1	2568	3	5	f	f	\N	วันหยุด
9745	7921	1	1	2568	3	5	f	f	\N	วันหยุด
9746	7922	1	1	2568	3	6	t	f	\N	วันทำการ
9747	7923	1	1	2568	3	6	t	f	\N	วันทำการ
9748	7924	1	1	2568	3	6	t	f	\N	วันทำการ
9749	7925	1	1	2568	3	6	t	f	\N	วันทำการ
9750	7926	1	1	2568	3	6	t	f	\N	วันทำการ
9751	7927	1	1	2568	3	6	f	f	\N	วันหยุด
9752	7928	1	1	2568	3	6	f	f	\N	วันหยุด
9753	7929	1	1	2568	3	7	t	f	\N	วันทำการ
9754	7930	1	1	2568	3	7	t	f	\N	วันทำการ
9755	7931	1	1	2568	3	7	t	f	\N	วันทำการ
9756	7932	1	1	2568	3	7	t	f	\N	วันทำการ
9757	7933	1	1	2568	3	7	t	f	\N	วันทำการ
9758	7934	1	1	2568	3	7	f	f	\N	วันหยุด
9759	7935	1	1	2568	3	7	f	t	วันวิสาขบูชา	วันหยุดนักขัตฤกษ์
9760	7936	1	1	2568	3	8	f	t	วันหยุดชดเชยวันวิสาขบูชา	วันหยุดนักขัตฤกษ์
9761	7937	1	1	2568	3	8	t	f	\N	วันทำการ
9762	7938	1	1	2568	3	8	f	t	วันเฉลิมพระชนมพรรษาสมเด็จพระนางเจ้าสุทิดา	วันหยุดนักขัตฤกษ์
9763	7939	1	1	2568	3	8	t	f	\N	วันทำการ
9764	7940	1	1	2568	3	8	t	f	\N	วันทำการ
9765	7941	1	1	2568	3	8	f	f	\N	วันหยุด
9766	7942	1	1	2568	3	8	f	f	\N	วันหยุด
12297	7593	4	1	2568	1	1	t	f	\N	วันทำการ
12298	7594	4	1	2568	1	1	t	f	\N	วันทำการ
12299	7595	4	1	2568	1	1	t	f	\N	วันทำการ
12300	7596	4	1	2568	1	1	t	f	\N	วันทำการ
12301	7597	4	1	2568	1	1	t	f	\N	วันทำการ
12302	7598	4	1	2568	1	1	f	f	\N	วันหยุด
12303	7599	4	1	2568	1	1	f	f	\N	วันหยุด
12304	7600	4	1	2568	1	2	t	f	\N	วันทำการ
12305	7601	4	1	2568	1	2	t	f	\N	วันทำการ
12306	7602	4	1	2568	1	2	t	f	\N	วันทำการ
12307	7603	4	1	2568	1	2	t	f	\N	วันทำการ
12308	7604	4	1	2568	1	2	t	f	\N	วันทำการ
12309	7605	4	1	2568	1	2	f	f	\N	วันหยุด
12310	7606	4	1	2568	1	2	f	f	\N	วันหยุด
12311	7607	4	1	2568	1	3	t	f	\N	วันทำการ
12312	7608	4	1	2568	1	3	t	f	\N	วันทำการ
12313	7609	4	1	2568	1	3	t	f	\N	วันทำการ
12314	7610	4	1	2568	1	3	f	t	วันอาสาฬหบูชา	วันหยุดนักขัตฤกษ์
12315	7611	4	1	2568	1	3	f	t	วันเข้าพรรษา	วันหยุดนักขัตฤกษ์
12316	7612	4	1	2568	1	3	f	f	\N	วันหยุด
12317	7613	4	1	2568	1	3	f	f	\N	วันหยุด
12318	7614	4	1	2568	1	4	f	t	ชดเชยวันอาสาฬหบูชา	วันหยุดนักขัตฤกษ์
12319	7615	4	1	2568	1	4	t	f	\N	วันทำการ
12320	7616	4	1	2568	1	4	t	f	\N	วันทำการ
12321	7617	4	1	2568	1	4	t	f	\N	วันทำการ
12322	7618	4	1	2568	1	4	t	f	\N	วันทำการ
12323	7619	4	1	2568	1	4	f	f	\N	วันหยุด
12324	7620	4	1	2568	1	4	f	f	\N	วันหยุด
12325	7621	4	1	2568	1	5	t	f	\N	วันทำการ
12326	7622	4	1	2568	1	5	t	f	\N	วันทำการ
12327	7623	4	1	2568	1	5	t	f	\N	วันทำการ
12328	7624	4	1	2568	1	5	t	f	\N	วันทำการ
12329	7625	4	1	2568	1	5	t	f	\N	วันทำการ
12330	7626	4	1	2568	1	5	f	f	\N	วันหยุด
12331	7627	4	1	2568	1	5	f	f	\N	วันหยุด
12332	7628	4	1	2568	1	6	f	t	วันเฉลิมฯ ร.10	วันหยุดนักขัตฤกษ์
12333	7629	4	1	2568	1	6	t	f	\N	วันทำการ
12334	7630	4	1	2568	1	6	t	f	\N	วันทำการ
12335	7631	4	1	2568	1	6	t	f	\N	วันทำการ
12336	7632	4	1	2568	1	6	t	f	\N	วันทำการ
12337	7633	4	1	2568	1	6	f	f	\N	วันหยุด
12338	7634	4	1	2568	1	6	f	f	\N	วันหยุด
12339	7635	4	1	2568	1	7	t	f	\N	วันทำการ
12340	7636	4	1	2568	1	7	t	f	\N	วันทำการ
12341	7637	4	1	2568	1	7	t	f	\N	วันทำการ
12342	7638	4	1	2568	1	7	t	f	\N	วันทำการ
12343	7639	4	1	2568	1	7	t	f	\N	วันทำการ
12344	7640	4	1	2568	1	7	f	f	\N	วันหยุด
12345	7641	4	1	2568	1	7	f	f	\N	วันหยุด
12346	7642	4	1	2568	1	8	f	t	นักขัตฤกษ์	วันหยุดนักขัตฤกษ์
12347	7643	4	1	2568	1	8	f	t	วันแม่แห่งชาติ	วันหยุดนักขัตฤกษ์
12348	7644	4	1	2568	1	8	t	f	\N	วันทำการ
12349	7645	4	1	2568	1	8	t	f	\N	วันทำการ
12350	7646	4	1	2568	1	8	t	f	\N	วันทำการ
12351	7647	4	1	2568	1	8	f	f	\N	วันหยุด
12352	7648	4	1	2568	1	8	f	f	\N	วันหยุด
12353	7649	4	1	2568	1	9	t	f	\N	วันทำการ
12354	7650	4	1	2568	1	9	t	f	\N	วันทำการ
12355	7651	4	1	2568	1	9	t	f	\N	วันทำการ
12356	7652	4	1	2568	1	9	t	f	\N	วันทำการ
12357	7653	4	1	2568	1	9	t	f	\N	วันทำการ
12358	7654	4	1	2568	1	9	f	f	\N	วันหยุด
12359	7655	4	1	2568	1	9	f	f	\N	วันหยุด
12360	7656	4	1	2568	1	10	t	f	\N	วันทำการ
12361	7657	4	1	2568	1	10	t	f	\N	วันทำการ
12362	7658	4	1	2568	1	10	t	f	\N	วันทำการ
12363	7659	4	1	2568	1	10	t	f	\N	วันทำการ
12364	7660	4	1	2568	1	10	t	f	\N	วันทำการ
12365	7661	4	1	2568	1	10	f	f	\N	วันหยุด
12366	7662	4	1	2568	1	10	f	f	\N	วันหยุด
12367	7663	4	1	2568	1	11	t	f	\N	วันทำการ
12368	7664	4	1	2568	1	11	t	f	\N	วันทำการ
12369	7665	4	1	2568	1	11	t	f	\N	วันทำการ
12370	7666	4	1	2568	1	11	t	f	\N	วันทำการ
12371	7667	4	1	2568	1	11	t	f	\N	วันทำการ
12372	7668	4	1	2568	1	11	f	f	\N	วันหยุด
12373	7669	4	1	2568	1	11	f	f	\N	วันหยุด
12374	7670	4	1	2568	1	12	t	f	\N	วันทำการ
12375	7671	4	1	2568	1	12	t	f	\N	วันทำการ
12376	7672	4	1	2568	1	12	t	f	\N	วันทำการ
12377	7673	4	1	2568	1	12	t	f	\N	วันทำการ
12378	7674	4	1	2568	1	12	t	f	\N	วันทำการ
12379	7675	4	1	2568	1	12	f	f	\N	วันหยุด
12380	7676	4	1	2568	1	12	f	f	\N	วันหยุด
12381	7677	4	1	2568	1	13	t	f	\N	วันทำการ
12382	7678	4	1	2568	1	13	t	f	\N	วันทำการ
12383	7679	4	1	2568	1	13	t	f	\N	วันทำการ
12384	7680	4	1	2568	1	13	t	f	\N	วันทำการ
12385	7681	4	1	2568	1	13	t	f	\N	วันทำการ
12386	7682	4	1	2568	1	13	f	f	\N	วันหยุด
12387	7683	4	1	2568	1	13	f	f	\N	วันหยุด
12388	7684	4	1	2568	1	14	f	t	วันสงขลานครินทร์	วันหยุดนักขัตฤกษ์
12389	7685	4	1	2568	1	14	t	f	\N	วันทำการ
12390	7686	4	1	2568	1	14	t	f	\N	วันทำการ
12391	7687	4	1	2568	1	14	t	f	\N	วันทำการ
12392	7688	4	1	2568	1	14	t	f	\N	วันทำการ
12393	7689	4	1	2568	1	14	f	f	\N	วันหยุด
12394	7690	4	1	2568	1	14	f	f	\N	วันหยุด
12395	7691	4	1	2568	1	15	t	f	\N	วันทำการ
12396	7692	4	1	2568	1	15	t	f	\N	วันทำการ
12397	7693	4	1	2568	1	15	t	f	\N	วันทำการ
12398	7694	4	1	2568	1	15	t	f	\N	วันทำการ
12399	7695	4	1	2568	1	15	t	f	\N	วันทำการ
12400	7696	4	1	2568	1	15	f	f	\N	วันหยุด
12401	7697	4	1	2568	1	15	f	f	\N	วันหยุด
12402	7698	4	1	2568	1	16	t	f	\N	วันทำการ
12403	7699	4	1	2568	1	16	t	f	\N	วันทำการ
12404	7700	4	1	2568	1	16	t	f	\N	วันทำการ
12405	7701	4	1	2568	1	16	t	f	\N	วันทำการ
12406	7702	4	1	2568	1	16	t	f	\N	วันทำการ
12407	7703	4	1	2568	1	16	f	f	\N	วันหยุด
12408	7704	4	1	2568	1	16	f	f	\N	วันหยุด
12409	7705	4	1	2568	1	17	f	t	วันนวมินทรมหาราช	วันหยุดนักขัตฤกษ์
12410	7706	4	1	2568	1	17	t	f	\N	วันทำการ
12411	7707	4	1	2568	1	17	t	f	\N	วันทำการ
12412	7708	4	1	2568	1	17	t	f	\N	วันทำการ
12413	7709	4	1	2568	1	17	t	f	\N	วันทำการ
12414	7710	4	1	2568	1	17	f	f	\N	วันหยุด
12415	7711	4	1	2568	1	17	f	f	\N	วันหยุด
12416	7712	4	1	2568	1	18	t	f	\N	วันทำการ
12417	7713	4	1	2568	1	18	t	f	\N	วันทำการ
12418	7714	4	1	2568	1	18	t	f	\N	วันทำการ
12419	7715	4	1	2568	1	18	f	t	วันปิยมหาราช	วันหยุดนักขัตฤกษ์
12420	7716	4	1	2568	1	18	t	f	\N	วันทำการ
12421	7717	4	1	2568	1	18	f	f	\N	วันหยุด
12422	7718	4	1	2568	1	18	f	f	\N	วันหยุด
12423	7719	4	1	2568	1	19	t	f	\N	วันทำการ
12424	7720	4	1	2568	\N	\N	f	f	\N	ปิดภาค
12425	7721	4	1	2568	\N	\N	f	f	\N	ปิดภาค
12426	7722	4	1	2568	\N	\N	f	f	\N	ปิดภาค
12427	7723	4	1	2568	\N	\N	f	f	\N	ปิดภาค
12428	7724	4	1	2568	\N	\N	f	f	\N	วันหยุด
12429	7725	4	1	2568	\N	\N	f	f	\N	วันหยุด
12430	7726	4	1	2568	\N	\N	f	f	\N	ปิดภาค
12431	7727	4	1	2568	\N	\N	f	f	\N	ปิดภาค
12432	7728	4	1	2568	\N	\N	f	f	\N	ปิดภาค
12433	7729	4	1	2568	\N	\N	f	f	\N	ปิดภาค
12434	7730	4	1	2568	\N	\N	f	f	\N	ปิดภาค
12435	7731	4	1	2568	\N	\N	f	f	\N	วันหยุด
12436	7732	4	1	2568	\N	\N	f	f	\N	วันหยุด
12437	7733	4	1	2568	\N	\N	f	f	\N	ปิดภาค
12438	7734	4	1	2568	\N	\N	f	f	\N	ปิดภาค
12439	7735	4	1	2568	\N	\N	f	f	\N	ปิดภาค
12440	7736	4	1	2568	\N	\N	f	f	\N	ปิดภาค
12441	7737	4	1	2568	\N	\N	f	f	\N	ปิดภาค
12442	7738	4	1	2568	\N	\N	f	f	\N	วันหยุด
12443	7739	4	1	2568	\N	\N	f	f	\N	วันหยุด
12444	7740	4	1	2568	2	1	t	f	\N	วันทำการ
12445	7741	4	1	2568	2	1	t	f	\N	วันทำการ
12446	7742	4	1	2568	2	1	t	f	\N	วันทำการ
12447	7743	4	1	2568	2	1	t	f	\N	วันทำการ
12448	7744	4	1	2568	2	1	t	f	\N	วันทำการ
12449	7745	4	1	2568	2	1	f	f	\N	วันหยุด
12450	7746	4	1	2568	2	1	f	f	\N	วันหยุด
12451	7747	4	1	2568	2	2	t	f	\N	วันทำการ
12452	7748	4	1	2568	2	2	t	f	\N	วันทำการ
12453	7749	4	1	2568	2	2	t	f	\N	วันทำการ
12454	7750	4	1	2568	2	2	t	f	\N	วันทำการ
12455	7751	4	1	2568	2	2	t	f	\N	วันทำการ
12456	7752	4	1	2568	2	2	f	f	\N	วันหยุด
12457	7753	4	1	2568	2	2	f	f	\N	วันหยุด
12458	7754	4	1	2568	2	3	t	f	\N	วันทำการ
12459	7755	4	1	2568	2	3	t	f	\N	วันทำการ
12460	7756	4	1	2568	2	3	t	f	\N	วันทำการ
12461	7757	4	1	2568	2	3	t	f	\N	วันทำการ
12462	7758	4	1	2568	2	3	f	t	วันพ่อแห่งชาติ	วันหยุดนักขัตฤกษ์
12463	7759	4	1	2568	2	3	f	f	\N	วันหยุด
12464	7760	4	1	2568	2	3	f	f	\N	วันหยุด
12465	7761	4	1	2568	2	4	t	f	\N	วันทำการ
12466	7762	4	1	2568	2	4	t	f	\N	วันทำการ
12467	7763	4	1	2568	2	4	f	t	วันรัฐธรรมนูญ	วันหยุดนักขัตฤกษ์
12468	7764	4	1	2568	2	4	t	f	\N	วันทำการ
12469	7765	4	1	2568	2	4	t	f	\N	วันทำการ
12470	7766	4	1	2568	2	4	f	f	\N	วันหยุด
12471	7767	4	1	2568	2	4	f	f	\N	วันหยุด
12472	7768	4	1	2568	2	5	t	f	\N	วันทำการ
12473	7769	4	1	2568	2	5	t	f	\N	วันทำการ
12474	7770	4	1	2568	2	5	t	f	\N	วันทำการ
12475	7771	4	1	2568	2	5	t	f	\N	วันทำการ
12476	7772	4	1	2568	2	5	t	f	\N	วันทำการ
12477	7773	4	1	2568	2	5	f	f	\N	วันหยุด
12478	7774	4	1	2568	2	5	f	f	\N	วันหยุด
12479	7775	4	1	2568	2	6	t	f	\N	วันทำการ
12480	7776	4	1	2568	2	6	t	f	\N	วันทำการ
12481	7777	4	1	2568	2	6	f	t	วันคริสต์มาสอีฟ	วันหยุดนักขัตฤกษ์
12482	7778	4	1	2568	2	6	f	t	วันคริสต์มาส	วันหยุดนักขัตฤกษ์
12483	7779	4	1	2568	2	6	t	f	\N	วันทำการ
12484	7780	4	1	2568	2	6	f	f	\N	วันหยุด
12485	7781	4	1	2568	2	6	f	f	\N	วันหยุด
12486	7782	4	1	2568	2	7	t	f	\N	วันทำการ
12487	7783	4	1	2568	2	7	t	f	\N	วันทำการ
12488	7784	4	1	2568	2	7	f	t	วันสิ้นปี	วันหยุดนักขัตฤกษ์
12489	7785	4	1	2568	2	7	f	t	วันขื้นปีใหม่	วันหยุดนักขัตฤกษ์
12490	7786	4	1	2568	2	7	f	t	วันหยุดราชการธันวาคม	วันหยุดนักขัตฤกษ์
12491	7787	4	1	2568	2	7	f	f	\N	วันหยุด
12492	7788	4	1	2568	2	7	f	f	\N	วันหยุด
12493	7789	4	1	2568	2	8	t	f	\N	วันทำการ
12494	7790	4	1	2568	2	8	t	f	\N	วันทำการ
12495	7791	4	1	2568	2	8	t	f	\N	วันทำการ
12496	7792	4	1	2568	2	8	t	f	\N	วันทำการ
12497	7793	4	1	2568	2	8	t	f	\N	วันทำการ
12498	7794	4	1	2568	2	8	f	f	\N	วันหยุด
12499	7795	4	1	2568	2	8	f	f	\N	วันหยุด
12500	7796	4	1	2568	2	9	t	f	\N	วันทำการ
12501	7797	4	1	2568	2	9	t	f	\N	วันทำการ
12502	7798	4	1	2568	2	9	t	f	\N	วันทำการ
12503	7799	4	1	2568	2	9	t	f	\N	วันทำการ
12504	7800	4	1	2568	2	9	t	f	\N	วันทำการ
12505	7801	4	1	2568	2	9	f	f	\N	วันหยุด
12506	7802	4	1	2568	2	9	f	f	\N	วันหยุด
12507	7803	4	1	2568	2	10	t	f	\N	วันทำการ
12508	7804	4	1	2568	2	10	t	f	\N	วันทำการ
12509	7805	4	1	2568	2	10	t	f	\N	วันทำการ
12510	7806	4	1	2568	2	10	t	f	\N	วันทำการ
12511	7807	4	1	2568	2	10	t	f	\N	วันทำการ
12512	7808	4	1	2568	2	10	f	f	\N	วันหยุด
12513	7809	4	1	2568	2	10	f	f	\N	วันหยุด
12514	7810	4	1	2568	2	11	t	f	\N	วันทำการ
12515	7811	4	1	2568	2	11	t	f	\N	วันทำการ
12516	7812	4	1	2568	2	11	t	f	\N	วันทำการ
12517	7813	4	1	2568	2	11	t	f	\N	วันทำการ
12518	7814	4	1	2568	2	11	t	f	\N	วันทำการ
12519	7815	4	1	2568	2	11	f	f	\N	วันหยุด
12520	7816	4	1	2568	2	11	f	t	วันมาฆบูชา	วันหยุดนักขัตฤกษ์
12521	7817	4	1	2568	2	12	t	f	\N	วันทำการ
12522	7818	4	1	2568	2	12	t	f	\N	วันทำการ
12523	7819	4	1	2568	2	12	t	f	\N	วันทำการ
12524	7820	4	1	2568	2	12	t	f	\N	วันทำการ
12525	7821	4	1	2568	2	12	t	f	\N	วันทำการ
12526	7822	4	1	2568	2	12	f	f	\N	วันหยุด
12527	7823	4	1	2568	2	12	f	f	\N	วันหยุด
12528	7824	4	1	2568	2	13	t	f	\N	วันทำการ
12529	7825	4	1	2568	2	13	t	f	\N	วันทำการ
12530	7826	4	1	2568	2	13	t	f	\N	วันทำการ
12531	7827	4	1	2568	2	13	t	f	\N	วันทำการ
12532	7828	4	1	2568	2	13	t	f	\N	วันทำการ
12533	7829	4	1	2568	2	13	f	t	วันวาเลนไทน์	วันหยุดนักขัตฤกษ์
12534	7830	4	1	2568	2	13	f	f	\N	วันหยุด
12535	7831	4	1	2568	2	14	t	f	\N	วันทำการ
12536	7832	4	1	2568	2	14	f	t	วันตรุษจีน	วันหยุดนักขัตฤกษ์
12537	7833	4	1	2568	2	14	f	t	วันตรุษจีน (วันที่ 2)	วันหยุดนักขัตฤกษ์
12538	7834	4	1	2568	2	14	f	t	วันตรุษจีน (วันที่ 3)	วันหยุดนักขัตฤกษ์
12539	7835	4	1	2568	2	14	t	f	\N	วันทำการ
12540	7836	4	1	2568	2	14	f	f	\N	วันหยุด
12541	7837	4	1	2568	2	14	f	f	\N	วันหยุด
12542	7838	4	1	2568	2	15	t	f	\N	วันทำการ
12543	7839	4	1	2568	2	15	t	f	\N	วันทำการ
12544	7840	4	1	2568	2	15	t	f	\N	วันทำการ
12545	7841	4	1	2568	2	15	t	f	\N	วันทำการ
12546	7842	4	1	2568	2	15	t	f	\N	วันทำการ
12547	7843	4	1	2568	2	15	f	f	\N	วันหยุด
12548	7844	4	1	2568	2	15	f	f	\N	วันหยุด
12549	7845	4	1	2568	2	16	t	f	\N	วันทำการ
12628	7924	4	1	2568	3	6	t	f	\N	วันทำการ
12550	7846	4	1	2568	2	16	f	t	วันมาฆบูชา	วันหยุดนักขัตฤกษ์
12551	7847	4	1	2568	2	16	t	f	\N	วันทำการ
12552	7848	4	1	2568	2	16	t	f	\N	วันทำการ
12553	7849	4	1	2568	2	16	t	f	\N	วันทำการ
12554	7850	4	1	2568	2	16	f	f	\N	วันหยุด
12555	7851	4	1	2568	2	16	f	f	\N	วันหยุด
12556	7852	4	1	2568	2	17	t	f	\N	วันทำการ
12557	7853	4	1	2568	2	17	t	f	\N	วันทำการ
12558	7854	4	1	2568	2	17	t	f	\N	วันทำการ
12559	7855	4	1	2568	2	17	t	f	\N	วันทำการ
12560	7856	4	1	2568	2	17	t	f	\N	วันทำการ
12561	7857	4	1	2568	2	17	f	f	\N	วันหยุด
12562	7858	4	1	2568	2	17	f	f	\N	วันหยุด
12563	7859	4	1	2568	2	18	t	f	\N	วันทำการ
12564	7860	4	1	2568	2	18	t	f	\N	วันทำการ
12565	7861	4	1	2568	2	18	t	f	\N	วันทำการ
12566	7862	4	1	2568	2	18	t	f	\N	วันทำการ
12567	7863	4	1	2568	2	18	t	f	\N	วันทำการ
12568	7864	4	1	2568	2	18	f	f	\N	วันหยุด
12569	7865	4	1	2568	\N	\N	f	f	\N	วันหยุด
12570	7866	4	1	2568	\N	\N	f	f	\N	ปิดภาค
12571	7867	4	1	2568	\N	\N	f	f	\N	ปิดภาค
12572	7868	4	1	2568	\N	\N	f	f	\N	ปิดภาค
12573	7869	4	1	2568	\N	\N	f	f	\N	ปิดภาค
12574	7870	4	1	2568	\N	\N	f	f	\N	ปิดภาค
12575	7871	4	1	2568	\N	\N	f	f	\N	วันหยุด
12576	7872	4	1	2568	\N	\N	f	f	\N	วันหยุด
12577	7873	4	1	2568	\N	\N	f	f	\N	ปิดภาค
12578	7874	4	1	2568	\N	\N	f	f	\N	ปิดภาค
12579	7875	4	1	2568	\N	\N	f	f	\N	ปิดภาค
12580	7876	4	1	2568	\N	\N	f	f	\N	ปิดภาค
12581	7877	4	1	2568	\N	\N	f	f	\N	ปิดภาค
12582	7878	4	1	2568	\N	\N	f	f	\N	วันหยุด
12583	7879	4	1	2568	\N	\N	f	f	\N	วันหยุด
12584	7880	4	1	2568	\N	\N	f	t	วันจักรี	วันหยุดนักขัตฤกษ์
12585	7881	4	1	2568	\N	\N	f	f	\N	ปิดภาค
12586	7882	4	1	2568	\N	\N	f	f	\N	ปิดภาค
12587	7883	4	1	2568	\N	\N	f	f	\N	ปิดภาค
12588	7884	4	1	2568	\N	\N	f	f	\N	ปิดภาค
12589	7885	4	1	2568	\N	\N	f	f	\N	วันหยุด
12590	7886	4	1	2568	\N	\N	f	f	\N	วันหยุด
12591	7887	4	1	2568	\N	\N	f	t	วันสงกรานต์	วันหยุดนักขัตฤกษ์
12592	7888	4	1	2568	\N	\N	f	t	วันสงกรานต์	วันหยุดนักขัตฤกษ์
12593	7889	4	1	2568	\N	\N	f	t	วันสงกรานต์	วันหยุดนักขัตฤกษ์
12594	7890	4	1	2568	3	1	t	f	\N	วันทำการ
12595	7891	4	1	2568	3	1	t	f	\N	วันทำการ
12596	7892	4	1	2568	3	1	f	f	\N	วันหยุด
12597	7893	4	1	2568	3	1	f	f	\N	วันหยุด
12598	7894	4	1	2568	3	2	t	f	\N	วันทำการ
12599	7895	4	1	2568	3	2	t	f	\N	วันทำการ
12600	7896	4	1	2568	3	2	t	f	\N	วันทำการ
12601	7897	4	1	2568	3	2	t	f	\N	วันทำการ
12602	7898	4	1	2568	3	2	t	f	\N	วันทำการ
12603	7899	4	1	2568	3	2	f	f	\N	วันหยุด
12604	7900	4	1	2568	3	2	f	f	\N	วันหยุด
12605	7901	4	1	2568	3	3	t	f	\N	วันทำการ
12606	7902	4	1	2568	3	3	t	f	\N	วันทำการ
12607	7903	4	1	2568	3	3	t	f	\N	วันทำการ
12608	7904	4	1	2568	3	3	t	f	\N	วันทำการ
12609	7905	4	1	2568	3	3	f	t	วันแรงงานแห่งชาติ	วันหยุดนักขัตฤกษ์
12610	7906	4	1	2568	3	3	f	f	\N	วันหยุด
12611	7907	4	1	2568	3	3	f	f	\N	วันหยุด
12612	7908	4	1	2568	3	4	f	t	วันฉัตรมงคล	วันหยุดนักขัตฤกษ์
12613	7909	4	1	2568	3	4	t	f	\N	วันทำการ
12614	7910	4	1	2568	3	4	t	f	\N	วันทำการ
12615	7911	4	1	2568	3	4	t	f	\N	วันทำการ
12616	7912	4	1	2568	3	4	t	f	\N	วันทำการ
12617	7913	4	1	2568	3	4	f	f	\N	วันหยุด
12618	7914	4	1	2568	3	4	f	f	\N	วันหยุด
12619	7915	4	1	2568	3	5	f	t	วันพืชมงคล	วันหยุดนักขัตฤกษ์
12620	7916	4	1	2568	3	5	t	f	\N	วันทำการ
12621	7917	4	1	2568	3	5	t	f	\N	วันทำการ
12622	7918	4	1	2568	3	5	t	f	\N	วันทำการ
12623	7919	4	1	2568	3	5	t	f	\N	วันทำการ
12624	7920	4	1	2568	3	5	f	f	\N	วันหยุด
12625	7921	4	1	2568	3	5	f	f	\N	วันหยุด
12626	7922	4	1	2568	3	6	t	f	\N	วันทำการ
12627	7923	4	1	2568	3	6	t	f	\N	วันทำการ
12629	7925	4	1	2568	3	6	t	f	\N	วันทำการ
12630	7926	4	1	2568	3	6	t	f	\N	วันทำการ
12631	7927	4	1	2568	3	6	f	f	\N	วันหยุด
12632	7928	4	1	2568	3	6	f	f	\N	วันหยุด
12633	7929	4	1	2568	3	7	t	f	\N	วันทำการ
12634	7930	4	1	2568	3	7	t	f	\N	วันทำการ
12635	7931	4	1	2568	3	7	t	f	\N	วันทำการ
12636	7932	4	1	2568	3	7	t	f	\N	วันทำการ
12637	7933	4	1	2568	3	7	t	f	\N	วันทำการ
12638	7934	4	1	2568	3	7	f	f	\N	วันหยุด
12639	7935	4	1	2568	3	7	f	t	วันวิสาขบูชา	วันหยุดนักขัตฤกษ์
12640	7936	4	1	2568	3	8	f	t	วันหยุดชดเชยวันวิสาขบูชา	วันหยุดนักขัตฤกษ์
12641	7937	4	1	2568	3	8	t	f	\N	วันทำการ
12642	7938	4	1	2568	3	8	f	t	วันเฉลิมพระชนมพรรษาสมเด็จพระนางเจ้าสุทิดา	วันหยุดนักขัตฤกษ์
12643	7939	4	1	2568	3	8	t	f	\N	วันทำการ
12644	7940	4	1	2568	3	8	t	f	\N	วันทำการ
12645	7941	4	1	2568	3	8	f	f	\N	วันหยุด
12646	7942	4	1	2568	3	8	f	f	\N	วันหยุด
12647	7593	5	1	2568	1	1	t	f	\N	วันทำการ
12648	7594	5	1	2568	1	1	t	f	\N	วันทำการ
12649	7595	5	1	2568	1	1	t	f	\N	วันทำการ
12650	7596	5	1	2568	1	1	t	f	\N	วันทำการ
12651	7597	5	1	2568	1	1	t	f	\N	วันทำการ
12652	7598	5	1	2568	1	1	f	f	\N	วันหยุด
12653	7599	5	1	2568	1	1	f	f	\N	วันหยุด
12654	7600	5	1	2568	1	2	t	f	\N	วันทำการ
12655	7601	5	1	2568	1	2	t	f	\N	วันทำการ
12656	7602	5	1	2568	1	2	t	f	\N	วันทำการ
12657	7603	5	1	2568	1	2	t	f	\N	วันทำการ
12658	7604	5	1	2568	1	2	t	f	\N	วันทำการ
12659	7605	5	1	2568	1	2	f	f	\N	วันหยุด
12660	7606	5	1	2568	1	2	f	f	\N	วันหยุด
12661	7607	5	1	2568	1	3	t	f	\N	วันทำการ
12662	7608	5	1	2568	1	3	t	f	\N	วันทำการ
12663	7609	5	1	2568	1	3	t	f	\N	วันทำการ
12664	7610	5	1	2568	1	3	f	t	วันอาสาฬหบูชา	วันหยุดนักขัตฤกษ์
12665	7611	5	1	2568	1	3	f	t	วันเข้าพรรษา	วันหยุดนักขัตฤกษ์
12666	7612	5	1	2568	1	3	f	f	\N	วันหยุด
12667	7613	5	1	2568	1	3	f	f	\N	วันหยุด
12668	7614	5	1	2568	1	4	f	t	ชดเชยวันอาสาฬหบูชา	วันหยุดนักขัตฤกษ์
12669	7615	5	1	2568	1	4	t	f	\N	วันทำการ
12670	7616	5	1	2568	1	4	t	f	\N	วันทำการ
12671	7617	5	1	2568	1	4	t	f	\N	วันทำการ
12672	7618	5	1	2568	1	4	t	f	\N	วันทำการ
12673	7619	5	1	2568	1	4	f	f	\N	วันหยุด
12674	7620	5	1	2568	1	4	f	f	\N	วันหยุด
12675	7621	5	1	2568	1	5	t	f	\N	วันทำการ
12676	7622	5	1	2568	1	5	t	f	\N	วันทำการ
12677	7623	5	1	2568	1	5	t	f	\N	วันทำการ
12678	7624	5	1	2568	1	5	t	f	\N	วันทำการ
12679	7625	5	1	2568	1	5	t	f	\N	วันทำการ
12680	7626	5	1	2568	1	5	f	f	\N	วันหยุด
12681	7627	5	1	2568	1	5	f	f	\N	วันหยุด
12682	7628	5	1	2568	1	6	f	t	วันเฉลิมฯ ร.10	วันหยุดนักขัตฤกษ์
12683	7629	5	1	2568	1	6	t	f	\N	วันทำการ
12684	7630	5	1	2568	1	6	t	f	\N	วันทำการ
12685	7631	5	1	2568	1	6	t	f	\N	วันทำการ
12686	7632	5	1	2568	1	6	t	f	\N	วันทำการ
12687	7633	5	1	2568	1	6	f	f	\N	วันหยุด
12688	7634	5	1	2568	1	6	f	f	\N	วันหยุด
12689	7635	5	1	2568	1	7	t	f	\N	วันทำการ
12690	7636	5	1	2568	1	7	t	f	\N	วันทำการ
12691	7637	5	1	2568	1	7	t	f	\N	วันทำการ
12692	7638	5	1	2568	1	7	t	f	\N	วันทำการ
12693	7639	5	1	2568	1	7	t	f	\N	วันทำการ
12694	7640	5	1	2568	1	7	f	f	\N	วันหยุด
12695	7641	5	1	2568	1	7	f	f	\N	วันหยุด
12696	7642	5	1	2568	1	8	f	t	นักขัตฤกษ์	วันหยุดนักขัตฤกษ์
12697	7643	5	1	2568	1	8	f	t	วันแม่แห่งชาติ	วันหยุดนักขัตฤกษ์
12698	7644	5	1	2568	1	8	t	f	\N	วันทำการ
12699	7645	5	1	2568	1	8	t	f	\N	วันทำการ
12700	7646	5	1	2568	1	8	t	f	\N	วันทำการ
12701	7647	5	1	2568	1	8	f	f	\N	วันหยุด
12702	7648	5	1	2568	1	8	f	f	\N	วันหยุด
12703	7649	5	1	2568	1	9	t	f	\N	วันทำการ
12704	7650	5	1	2568	1	9	t	f	\N	วันทำการ
12705	7651	5	1	2568	1	9	t	f	\N	วันทำการ
12706	7652	5	1	2568	1	9	t	f	\N	วันทำการ
12707	7653	5	1	2568	1	9	t	f	\N	วันทำการ
12708	7654	5	1	2568	1	9	f	f	\N	วันหยุด
12709	7655	5	1	2568	1	9	f	f	\N	วันหยุด
12710	7656	5	1	2568	1	10	t	f	\N	วันทำการ
12711	7657	5	1	2568	1	10	t	f	\N	วันทำการ
12712	7658	5	1	2568	1	10	t	f	\N	วันทำการ
12713	7659	5	1	2568	1	10	t	f	\N	วันทำการ
12714	7660	5	1	2568	1	10	t	f	\N	วันทำการ
12715	7661	5	1	2568	1	10	f	f	\N	วันหยุด
12716	7662	5	1	2568	1	10	f	f	\N	วันหยุด
12717	7663	5	1	2568	1	11	t	f	\N	วันทำการ
12718	7664	5	1	2568	1	11	t	f	\N	วันทำการ
12719	7665	5	1	2568	1	11	t	f	\N	วันทำการ
12720	7666	5	1	2568	1	11	t	f	\N	วันทำการ
12721	7667	5	1	2568	1	11	t	f	\N	วันทำการ
12722	7668	5	1	2568	1	11	f	f	\N	วันหยุด
12723	7669	5	1	2568	1	11	f	f	\N	วันหยุด
12724	7670	5	1	2568	1	12	t	f	\N	วันทำการ
12725	7671	5	1	2568	1	12	t	f	\N	วันทำการ
12726	7672	5	1	2568	1	12	t	f	\N	วันทำการ
12727	7673	5	1	2568	1	12	t	f	\N	วันทำการ
12728	7674	5	1	2568	1	12	t	f	\N	วันทำการ
12729	7675	5	1	2568	1	12	f	f	\N	วันหยุด
12730	7676	5	1	2568	1	12	f	f	\N	วันหยุด
12731	7677	5	1	2568	1	13	t	f	\N	วันทำการ
12732	7678	5	1	2568	1	13	t	f	\N	วันทำการ
12733	7679	5	1	2568	1	13	t	f	\N	วันทำการ
12734	7680	5	1	2568	1	13	t	f	\N	วันทำการ
12735	7681	5	1	2568	1	13	t	f	\N	วันทำการ
12736	7682	5	1	2568	1	13	f	f	\N	วันหยุด
12737	7683	5	1	2568	1	13	f	f	\N	วันหยุด
12738	7684	5	1	2568	1	14	f	t	วันสงขลานครินทร์	วันหยุดนักขัตฤกษ์
12739	7685	5	1	2568	1	14	t	f	\N	วันทำการ
12740	7686	5	1	2568	1	14	t	f	\N	วันทำการ
12741	7687	5	1	2568	1	14	t	f	\N	วันทำการ
12742	7688	5	1	2568	1	14	t	f	\N	วันทำการ
12743	7689	5	1	2568	1	14	f	f	\N	วันหยุด
12744	7690	5	1	2568	1	14	f	f	\N	วันหยุด
12745	7691	5	1	2568	1	15	t	f	\N	วันทำการ
12746	7692	5	1	2568	1	15	t	f	\N	วันทำการ
12747	7693	5	1	2568	1	15	t	f	\N	วันทำการ
12748	7694	5	1	2568	1	15	t	f	\N	วันทำการ
12749	7695	5	1	2568	1	15	t	f	\N	วันทำการ
12750	7696	5	1	2568	1	15	f	f	\N	วันหยุด
12751	7697	5	1	2568	1	15	f	f	\N	วันหยุด
12752	7698	5	1	2568	1	16	t	f	\N	วันทำการ
12753	7699	5	1	2568	1	16	t	f	\N	วันทำการ
12754	7700	5	1	2568	1	16	t	f	\N	วันทำการ
12755	7701	5	1	2568	1	16	t	f	\N	วันทำการ
12756	7702	5	1	2568	1	16	t	f	\N	วันทำการ
12757	7703	5	1	2568	1	16	f	f	\N	วันหยุด
12758	7704	5	1	2568	1	16	f	f	\N	วันหยุด
12759	7705	5	1	2568	1	17	f	t	วันนวมินทรมหาราช	วันหยุดนักขัตฤกษ์
12760	7706	5	1	2568	1	17	t	f	\N	วันทำการ
12761	7707	5	1	2568	1	17	t	f	\N	วันทำการ
12762	7708	5	1	2568	1	17	t	f	\N	วันทำการ
12763	7709	5	1	2568	1	17	t	f	\N	วันทำการ
12764	7710	5	1	2568	1	17	f	f	\N	วันหยุด
12765	7711	5	1	2568	1	17	f	f	\N	วันหยุด
12766	7712	5	1	2568	1	18	t	f	\N	วันทำการ
12767	7713	5	1	2568	1	18	t	f	\N	วันทำการ
12768	7714	5	1	2568	1	18	t	f	\N	วันทำการ
12769	7715	5	1	2568	1	18	f	t	วันปิยมหาราช	วันหยุดนักขัตฤกษ์
12770	7716	5	1	2568	1	18	t	f	\N	วันทำการ
12771	7717	5	1	2568	1	18	f	f	\N	วันหยุด
12772	7718	5	1	2568	1	18	f	f	\N	วันหยุด
12773	7719	5	1	2568	1	19	t	f	\N	วันทำการ
12774	7720	5	1	2568	\N	\N	f	f	\N	ปิดภาค
12775	7721	5	1	2568	\N	\N	f	f	\N	ปิดภาค
12776	7722	5	1	2568	\N	\N	f	f	\N	ปิดภาค
12777	7723	5	1	2568	\N	\N	f	f	\N	ปิดภาค
12778	7724	5	1	2568	\N	\N	f	f	\N	วันหยุด
12779	7725	5	1	2568	\N	\N	f	f	\N	วันหยุด
12780	7726	5	1	2568	\N	\N	f	f	\N	ปิดภาค
12781	7727	5	1	2568	\N	\N	f	f	\N	ปิดภาค
12782	7728	5	1	2568	\N	\N	f	f	\N	ปิดภาค
12783	7729	5	1	2568	\N	\N	f	f	\N	ปิดภาค
12784	7730	5	1	2568	\N	\N	f	f	\N	ปิดภาค
12785	7731	5	1	2568	\N	\N	f	f	\N	วันหยุด
12786	7732	5	1	2568	\N	\N	f	f	\N	วันหยุด
12787	7733	5	1	2568	\N	\N	f	f	\N	ปิดภาค
12788	7734	5	1	2568	\N	\N	f	f	\N	ปิดภาค
12789	7735	5	1	2568	\N	\N	f	f	\N	ปิดภาค
12790	7736	5	1	2568	\N	\N	f	f	\N	ปิดภาค
12791	7737	5	1	2568	\N	\N	f	f	\N	ปิดภาค
12792	7738	5	1	2568	\N	\N	f	f	\N	วันหยุด
12793	7739	5	1	2568	\N	\N	f	f	\N	วันหยุด
12794	7740	5	1	2568	2	1	t	f	\N	วันทำการ
12795	7741	5	1	2568	2	1	t	f	\N	วันทำการ
12796	7742	5	1	2568	2	1	t	f	\N	วันทำการ
12797	7743	5	1	2568	2	1	t	f	\N	วันทำการ
12798	7744	5	1	2568	2	1	t	f	\N	วันทำการ
12799	7745	5	1	2568	2	1	f	f	\N	วันหยุด
12800	7746	5	1	2568	2	1	f	f	\N	วันหยุด
12801	7747	5	1	2568	2	2	t	f	\N	วันทำการ
12802	7748	5	1	2568	2	2	t	f	\N	วันทำการ
12803	7749	5	1	2568	2	2	t	f	\N	วันทำการ
12804	7750	5	1	2568	2	2	t	f	\N	วันทำการ
12805	7751	5	1	2568	2	2	t	f	\N	วันทำการ
12806	7752	5	1	2568	2	2	f	f	\N	วันหยุด
12807	7753	5	1	2568	2	2	f	f	\N	วันหยุด
12808	7754	5	1	2568	2	3	t	f	\N	วันทำการ
12809	7755	5	1	2568	2	3	t	f	\N	วันทำการ
12810	7756	5	1	2568	2	3	t	f	\N	วันทำการ
12811	7757	5	1	2568	2	3	t	f	\N	วันทำการ
12812	7758	5	1	2568	2	3	f	t	วันพ่อแห่งชาติ	วันหยุดนักขัตฤกษ์
12813	7759	5	1	2568	2	3	f	f	\N	วันหยุด
12814	7760	5	1	2568	2	3	f	f	\N	วันหยุด
12815	7761	5	1	2568	2	4	t	f	\N	วันทำการ
12816	7762	5	1	2568	2	4	t	f	\N	วันทำการ
12817	7763	5	1	2568	2	4	f	t	วันรัฐธรรมนูญ	วันหยุดนักขัตฤกษ์
12818	7764	5	1	2568	2	4	t	f	\N	วันทำการ
12819	7765	5	1	2568	2	4	t	f	\N	วันทำการ
12820	7766	5	1	2568	2	4	f	f	\N	วันหยุด
12821	7767	5	1	2568	2	4	f	f	\N	วันหยุด
12822	7768	5	1	2568	2	5	t	f	\N	วันทำการ
12823	7769	5	1	2568	2	5	t	f	\N	วันทำการ
12824	7770	5	1	2568	2	5	t	f	\N	วันทำการ
12825	7771	5	1	2568	2	5	t	f	\N	วันทำการ
12826	7772	5	1	2568	2	5	t	f	\N	วันทำการ
12827	7773	5	1	2568	2	5	f	f	\N	วันหยุด
12828	7774	5	1	2568	2	5	f	f	\N	วันหยุด
12829	7775	5	1	2568	2	6	t	f	\N	วันทำการ
12830	7776	5	1	2568	2	6	t	f	\N	วันทำการ
12831	7777	5	1	2568	2	6	f	t	วันคริสต์มาสอีฟ	วันหยุดนักขัตฤกษ์
12832	7778	5	1	2568	2	6	f	t	วันคริสต์มาส	วันหยุดนักขัตฤกษ์
12833	7779	5	1	2568	2	6	t	f	\N	วันทำการ
12834	7780	5	1	2568	2	6	f	f	\N	วันหยุด
12835	7781	5	1	2568	2	6	f	f	\N	วันหยุด
12836	7782	5	1	2568	2	7	t	f	\N	วันทำการ
12837	7783	5	1	2568	2	7	t	f	\N	วันทำการ
12838	7784	5	1	2568	2	7	f	t	วันสิ้นปี	วันหยุดนักขัตฤกษ์
12839	7785	5	1	2568	2	7	f	t	วันขื้นปีใหม่	วันหยุดนักขัตฤกษ์
12840	7786	5	1	2568	2	7	f	t	วันหยุดราชการธันวาคม	วันหยุดนักขัตฤกษ์
12841	7787	5	1	2568	2	7	f	f	\N	วันหยุด
12842	7788	5	1	2568	2	7	f	f	\N	วันหยุด
12843	7789	5	1	2568	2	8	t	f	\N	วันทำการ
12844	7790	5	1	2568	2	8	t	f	\N	วันทำการ
12845	7791	5	1	2568	2	8	t	f	\N	วันทำการ
12846	7792	5	1	2568	2	8	t	f	\N	วันทำการ
12847	7793	5	1	2568	2	8	t	f	\N	วันทำการ
12848	7794	5	1	2568	2	8	f	f	\N	วันหยุด
12849	7795	5	1	2568	2	8	f	f	\N	วันหยุด
12850	7796	5	1	2568	2	9	t	f	\N	วันทำการ
12851	7797	5	1	2568	2	9	t	f	\N	วันทำการ
12852	7798	5	1	2568	2	9	t	f	\N	วันทำการ
12853	7799	5	1	2568	2	9	t	f	\N	วันทำการ
12854	7800	5	1	2568	2	9	t	f	\N	วันทำการ
12855	7801	5	1	2568	2	9	f	f	\N	วันหยุด
12856	7802	5	1	2568	2	9	f	f	\N	วันหยุด
12857	7803	5	1	2568	2	10	t	f	\N	วันทำการ
12858	7804	5	1	2568	2	10	t	f	\N	วันทำการ
12859	7805	5	1	2568	2	10	t	f	\N	วันทำการ
12860	7806	5	1	2568	2	10	t	f	\N	วันทำการ
12861	7807	5	1	2568	2	10	t	f	\N	วันทำการ
12862	7808	5	1	2568	2	10	f	f	\N	วันหยุด
12863	7809	5	1	2568	2	10	f	f	\N	วันหยุด
12864	7810	5	1	2568	2	11	t	f	\N	วันทำการ
12865	7811	5	1	2568	2	11	t	f	\N	วันทำการ
12866	7812	5	1	2568	2	11	t	f	\N	วันทำการ
12867	7813	5	1	2568	2	11	t	f	\N	วันทำการ
12868	7814	5	1	2568	2	11	t	f	\N	วันทำการ
12869	7815	5	1	2568	2	11	f	f	\N	วันหยุด
12870	7816	5	1	2568	2	11	f	t	วันมาฆบูชา	วันหยุดนักขัตฤกษ์
12871	7817	5	1	2568	2	12	t	f	\N	วันทำการ
12872	7818	5	1	2568	2	12	t	f	\N	วันทำการ
12873	7819	5	1	2568	2	12	t	f	\N	วันทำการ
12874	7820	5	1	2568	2	12	t	f	\N	วันทำการ
12875	7821	5	1	2568	2	12	t	f	\N	วันทำการ
12876	7822	5	1	2568	2	12	f	f	\N	วันหยุด
12877	7823	5	1	2568	2	12	f	f	\N	วันหยุด
12878	7824	5	1	2568	2	13	t	f	\N	วันทำการ
12879	7825	5	1	2568	2	13	t	f	\N	วันทำการ
12880	7826	5	1	2568	2	13	t	f	\N	วันทำการ
12881	7827	5	1	2568	2	13	t	f	\N	วันทำการ
12882	7828	5	1	2568	2	13	t	f	\N	วันทำการ
12883	7829	5	1	2568	2	13	f	t	วันวาเลนไทน์	วันหยุดนักขัตฤกษ์
12884	7830	5	1	2568	2	13	f	f	\N	วันหยุด
12885	7831	5	1	2568	2	14	t	f	\N	วันทำการ
12886	7832	5	1	2568	2	14	f	t	วันตรุษจีน	วันหยุดนักขัตฤกษ์
12887	7833	5	1	2568	2	14	f	t	วันตรุษจีน (วันที่ 2)	วันหยุดนักขัตฤกษ์
12888	7834	5	1	2568	2	14	f	t	วันตรุษจีน (วันที่ 3)	วันหยุดนักขัตฤกษ์
12889	7835	5	1	2568	2	14	t	f	\N	วันทำการ
12890	7836	5	1	2568	2	14	f	f	\N	วันหยุด
12891	7837	5	1	2568	2	14	f	f	\N	วันหยุด
12892	7838	5	1	2568	2	15	t	f	\N	วันทำการ
12893	7839	5	1	2568	2	15	t	f	\N	วันทำการ
12894	7840	5	1	2568	2	15	t	f	\N	วันทำการ
12895	7841	5	1	2568	2	15	t	f	\N	วันทำการ
12896	7842	5	1	2568	2	15	t	f	\N	วันทำการ
12897	7843	5	1	2568	2	15	f	f	\N	วันหยุด
12898	7844	5	1	2568	2	15	f	f	\N	วันหยุด
12899	7845	5	1	2568	2	16	t	f	\N	วันทำการ
12900	7846	5	1	2568	2	16	f	t	วันมาฆบูชา	วันหยุดนักขัตฤกษ์
12901	7847	5	1	2568	2	16	t	f	\N	วันทำการ
12902	7848	5	1	2568	2	16	t	f	\N	วันทำการ
12903	7849	5	1	2568	2	16	t	f	\N	วันทำการ
12904	7850	5	1	2568	2	16	f	f	\N	วันหยุด
12905	7851	5	1	2568	2	16	f	f	\N	วันหยุด
12906	7852	5	1	2568	2	17	t	f	\N	วันทำการ
12907	7853	5	1	2568	2	17	t	f	\N	วันทำการ
12908	7854	5	1	2568	2	17	t	f	\N	วันทำการ
12909	7855	5	1	2568	2	17	t	f	\N	วันทำการ
12910	7856	5	1	2568	2	17	t	f	\N	วันทำการ
12911	7857	5	1	2568	2	17	f	f	\N	วันหยุด
12912	7858	5	1	2568	2	17	f	f	\N	วันหยุด
12913	7859	5	1	2568	2	18	t	f	\N	วันทำการ
12914	7860	5	1	2568	2	18	t	f	\N	วันทำการ
12915	7861	5	1	2568	2	18	t	f	\N	วันทำการ
12916	7862	5	1	2568	2	18	t	f	\N	วันทำการ
12917	7863	5	1	2568	2	18	t	f	\N	วันทำการ
12918	7864	5	1	2568	2	18	f	f	\N	วันหยุด
12919	7865	5	1	2568	\N	\N	f	f	\N	วันหยุด
12920	7866	5	1	2568	\N	\N	f	f	\N	ปิดภาค
12921	7867	5	1	2568	\N	\N	f	f	\N	ปิดภาค
12922	7868	5	1	2568	\N	\N	f	f	\N	ปิดภาค
12923	7869	5	1	2568	\N	\N	f	f	\N	ปิดภาค
12924	7870	5	1	2568	\N	\N	f	f	\N	ปิดภาค
12925	7871	5	1	2568	\N	\N	f	f	\N	วันหยุด
12926	7872	5	1	2568	\N	\N	f	f	\N	วันหยุด
12927	7873	5	1	2568	\N	\N	f	f	\N	ปิดภาค
12928	7874	5	1	2568	\N	\N	f	f	\N	ปิดภาค
12929	7875	5	1	2568	\N	\N	f	f	\N	ปิดภาค
12930	7876	5	1	2568	\N	\N	f	f	\N	ปิดภาค
12931	7877	5	1	2568	\N	\N	f	f	\N	ปิดภาค
12932	7878	5	1	2568	\N	\N	f	f	\N	วันหยุด
12933	7879	5	1	2568	\N	\N	f	f	\N	วันหยุด
12934	7880	5	1	2568	\N	\N	f	t	วันจักรี	วันหยุดนักขัตฤกษ์
12935	7881	5	1	2568	\N	\N	f	f	\N	ปิดภาค
12936	7882	5	1	2568	\N	\N	f	f	\N	ปิดภาค
12937	7883	5	1	2568	\N	\N	f	f	\N	ปิดภาค
12938	7884	5	1	2568	\N	\N	f	f	\N	ปิดภาค
12939	7885	5	1	2568	\N	\N	f	f	\N	วันหยุด
12940	7886	5	1	2568	\N	\N	f	f	\N	วันหยุด
12941	7887	5	1	2568	\N	\N	f	t	วันสงกรานต์	วันหยุดนักขัตฤกษ์
12942	7888	5	1	2568	\N	\N	f	t	วันสงกรานต์	วันหยุดนักขัตฤกษ์
12943	7889	5	1	2568	\N	\N	f	t	วันสงกรานต์	วันหยุดนักขัตฤกษ์
12944	7890	5	1	2568	3	1	t	f	\N	วันทำการ
12945	7891	5	1	2568	3	1	t	f	\N	วันทำการ
12946	7892	5	1	2568	3	1	f	f	\N	วันหยุด
12947	7893	5	1	2568	3	1	f	f	\N	วันหยุด
12948	7894	5	1	2568	3	2	t	f	\N	วันทำการ
12949	7895	5	1	2568	3	2	t	f	\N	วันทำการ
12950	7896	5	1	2568	3	2	t	f	\N	วันทำการ
12951	7897	5	1	2568	3	2	t	f	\N	วันทำการ
12952	7898	5	1	2568	3	2	t	f	\N	วันทำการ
12953	7899	5	1	2568	3	2	f	f	\N	วันหยุด
12954	7900	5	1	2568	3	2	f	f	\N	วันหยุด
12955	7901	5	1	2568	3	3	t	f	\N	วันทำการ
12956	7902	5	1	2568	3	3	t	f	\N	วันทำการ
12957	7903	5	1	2568	3	3	t	f	\N	วันทำการ
12958	7904	5	1	2568	3	3	t	f	\N	วันทำการ
12959	7905	5	1	2568	3	3	f	t	วันแรงงานแห่งชาติ	วันหยุดนักขัตฤกษ์
12960	7906	5	1	2568	3	3	f	f	\N	วันหยุด
12961	7907	5	1	2568	3	3	f	f	\N	วันหยุด
12962	7908	5	1	2568	3	4	f	t	วันฉัตรมงคล	วันหยุดนักขัตฤกษ์
12963	7909	5	1	2568	3	4	t	f	\N	วันทำการ
12964	7910	5	1	2568	3	4	t	f	\N	วันทำการ
12965	7911	5	1	2568	3	4	t	f	\N	วันทำการ
12966	7912	5	1	2568	3	4	t	f	\N	วันทำการ
12967	7913	5	1	2568	3	4	f	f	\N	วันหยุด
12968	7914	5	1	2568	3	4	f	f	\N	วันหยุด
12969	7915	5	1	2568	3	5	f	t	วันพืชมงคล	วันหยุดนักขัตฤกษ์
12970	7916	5	1	2568	3	5	t	f	\N	วันทำการ
12971	7917	5	1	2568	3	5	t	f	\N	วันทำการ
12972	7918	5	1	2568	3	5	t	f	\N	วันทำการ
12973	7919	5	1	2568	3	5	t	f	\N	วันทำการ
12974	7920	5	1	2568	3	5	f	f	\N	วันหยุด
12975	7921	5	1	2568	3	5	f	f	\N	วันหยุด
12976	7922	5	1	2568	3	6	t	f	\N	วันทำการ
12977	7923	5	1	2568	3	6	t	f	\N	วันทำการ
12978	7924	5	1	2568	3	6	t	f	\N	วันทำการ
12979	7925	5	1	2568	3	6	t	f	\N	วันทำการ
12980	7926	5	1	2568	3	6	t	f	\N	วันทำการ
12981	7927	5	1	2568	3	6	f	f	\N	วันหยุด
12982	7928	5	1	2568	3	6	f	f	\N	วันหยุด
12983	7929	5	1	2568	3	7	t	f	\N	วันทำการ
12984	7930	5	1	2568	3	7	t	f	\N	วันทำการ
12985	7931	5	1	2568	3	7	t	f	\N	วันทำการ
12986	7932	5	1	2568	3	7	t	f	\N	วันทำการ
12987	7933	5	1	2568	3	7	t	f	\N	วันทำการ
12988	7934	5	1	2568	3	7	f	f	\N	วันหยุด
12989	7935	5	1	2568	3	7	f	t	วันวิสาขบูชา	วันหยุดนักขัตฤกษ์
12990	7936	5	1	2568	3	8	f	t	วันหยุดชดเชยวันวิสาขบูชา	วันหยุดนักขัตฤกษ์
12991	7937	5	1	2568	3	8	t	f	\N	วันทำการ
12992	7938	5	1	2568	3	8	f	t	วันเฉลิมพระชนมพรรษาสมเด็จพระนางเจ้าสุทิดา	วันหยุดนักขัตฤกษ์
12993	7939	5	1	2568	3	8	t	f	\N	วันทำการ
12994	7940	5	1	2568	3	8	t	f	\N	วันทำการ
12995	7941	5	1	2568	3	8	f	f	\N	วันหยุด
12996	7942	5	1	2568	3	8	f	f	\N	วันหยุด
12997	7593	6	1	2568	1	1	t	f	\N	วันทำการ
12998	7594	6	1	2568	1	1	t	f	\N	วันทำการ
12999	7595	6	1	2568	1	1	t	f	\N	วันทำการ
13000	7596	6	1	2568	1	1	t	f	\N	วันทำการ
13001	7597	6	1	2568	1	1	t	f	\N	วันทำการ
13002	7598	6	1	2568	1	1	f	f	\N	วันหยุด
13003	7599	6	1	2568	1	1	f	f	\N	วันหยุด
13004	7600	6	1	2568	1	2	t	f	\N	วันทำการ
13005	7601	6	1	2568	1	2	t	f	\N	วันทำการ
13006	7602	6	1	2568	1	2	t	f	\N	วันทำการ
13007	7603	6	1	2568	1	2	t	f	\N	วันทำการ
13008	7604	6	1	2568	1	2	t	f	\N	วันทำการ
13009	7605	6	1	2568	1	2	f	f	\N	วันหยุด
13010	7606	6	1	2568	1	2	f	f	\N	วันหยุด
13011	7607	6	1	2568	1	3	t	f	\N	วันทำการ
13012	7608	6	1	2568	1	3	t	f	\N	วันทำการ
13013	7609	6	1	2568	1	3	t	f	\N	วันทำการ
13091	7687	6	1	2568	1	14	t	f	\N	วันทำการ
13014	7610	6	1	2568	1	3	f	t	วันอาสาฬหบูชา	วันหยุดนักขัตฤกษ์
13015	7611	6	1	2568	1	3	f	t	วันเข้าพรรษา	วันหยุดนักขัตฤกษ์
13016	7612	6	1	2568	1	3	f	f	\N	วันหยุด
13017	7613	6	1	2568	1	3	f	f	\N	วันหยุด
13018	7614	6	1	2568	1	4	f	t	ชดเชยวันอาสาฬหบูชา	วันหยุดนักขัตฤกษ์
13019	7615	6	1	2568	1	4	t	f	\N	วันทำการ
13020	7616	6	1	2568	1	4	t	f	\N	วันทำการ
13021	7617	6	1	2568	1	4	t	f	\N	วันทำการ
13022	7618	6	1	2568	1	4	t	f	\N	วันทำการ
13023	7619	6	1	2568	1	4	f	f	\N	วันหยุด
13024	7620	6	1	2568	1	4	f	f	\N	วันหยุด
13025	7621	6	1	2568	1	5	t	f	\N	วันทำการ
13026	7622	6	1	2568	1	5	t	f	\N	วันทำการ
13027	7623	6	1	2568	1	5	t	f	\N	วันทำการ
13028	7624	6	1	2568	1	5	t	f	\N	วันทำการ
13029	7625	6	1	2568	1	5	t	f	\N	วันทำการ
13030	7626	6	1	2568	1	5	f	f	\N	วันหยุด
13031	7627	6	1	2568	1	5	f	f	\N	วันหยุด
13032	7628	6	1	2568	1	6	f	t	วันเฉลิมฯ ร.10	วันหยุดนักขัตฤกษ์
13033	7629	6	1	2568	1	6	t	f	\N	วันทำการ
13034	7630	6	1	2568	1	6	t	f	\N	วันทำการ
13035	7631	6	1	2568	1	6	t	f	\N	วันทำการ
13036	7632	6	1	2568	1	6	t	f	\N	วันทำการ
13037	7633	6	1	2568	1	6	f	f	\N	วันหยุด
13038	7634	6	1	2568	1	6	f	f	\N	วันหยุด
13039	7635	6	1	2568	1	7	t	f	\N	วันทำการ
13040	7636	6	1	2568	1	7	t	f	\N	วันทำการ
13041	7637	6	1	2568	1	7	t	f	\N	วันทำการ
13042	7638	6	1	2568	1	7	t	f	\N	วันทำการ
13043	7639	6	1	2568	1	7	t	f	\N	วันทำการ
13044	7640	6	1	2568	1	7	f	f	\N	วันหยุด
13045	7641	6	1	2568	1	7	f	f	\N	วันหยุด
13046	7642	6	1	2568	1	8	f	t	นักขัตฤกษ์	วันหยุดนักขัตฤกษ์
13047	7643	6	1	2568	1	8	f	t	วันแม่แห่งชาติ	วันหยุดนักขัตฤกษ์
13048	7644	6	1	2568	1	8	t	f	\N	วันทำการ
13049	7645	6	1	2568	1	8	t	f	\N	วันทำการ
13050	7646	6	1	2568	1	8	t	f	\N	วันทำการ
13051	7647	6	1	2568	1	8	f	f	\N	วันหยุด
13052	7648	6	1	2568	1	8	f	f	\N	วันหยุด
13053	7649	6	1	2568	1	9	t	f	\N	วันทำการ
13054	7650	6	1	2568	1	9	t	f	\N	วันทำการ
13055	7651	6	1	2568	1	9	t	f	\N	วันทำการ
13056	7652	6	1	2568	1	9	t	f	\N	วันทำการ
13057	7653	6	1	2568	1	9	t	f	\N	วันทำการ
13058	7654	6	1	2568	1	9	f	f	\N	วันหยุด
13059	7655	6	1	2568	1	9	f	f	\N	วันหยุด
13060	7656	6	1	2568	1	10	t	f	\N	วันทำการ
13061	7657	6	1	2568	1	10	t	f	\N	วันทำการ
13062	7658	6	1	2568	1	10	t	f	\N	วันทำการ
13063	7659	6	1	2568	1	10	t	f	\N	วันทำการ
13064	7660	6	1	2568	1	10	t	f	\N	วันทำการ
13065	7661	6	1	2568	1	10	f	f	\N	วันหยุด
13066	7662	6	1	2568	1	10	f	f	\N	วันหยุด
13067	7663	6	1	2568	1	11	t	f	\N	วันทำการ
13068	7664	6	1	2568	1	11	t	f	\N	วันทำการ
13069	7665	6	1	2568	1	11	t	f	\N	วันทำการ
13070	7666	6	1	2568	1	11	t	f	\N	วันทำการ
13071	7667	6	1	2568	1	11	t	f	\N	วันทำการ
13072	7668	6	1	2568	1	11	f	f	\N	วันหยุด
13073	7669	6	1	2568	1	11	f	f	\N	วันหยุด
13074	7670	6	1	2568	1	12	t	f	\N	วันทำการ
13075	7671	6	1	2568	1	12	t	f	\N	วันทำการ
13076	7672	6	1	2568	1	12	t	f	\N	วันทำการ
13077	7673	6	1	2568	1	12	t	f	\N	วันทำการ
13078	7674	6	1	2568	1	12	t	f	\N	วันทำการ
13079	7675	6	1	2568	1	12	f	f	\N	วันหยุด
13080	7676	6	1	2568	1	12	f	f	\N	วันหยุด
13081	7677	6	1	2568	1	13	t	f	\N	วันทำการ
13082	7678	6	1	2568	1	13	t	f	\N	วันทำการ
13083	7679	6	1	2568	1	13	t	f	\N	วันทำการ
13084	7680	6	1	2568	1	13	t	f	\N	วันทำการ
13085	7681	6	1	2568	1	13	t	f	\N	วันทำการ
13086	7682	6	1	2568	1	13	f	f	\N	วันหยุด
13087	7683	6	1	2568	1	13	f	f	\N	วันหยุด
13088	7684	6	1	2568	1	14	f	t	วันสงขลานครินทร์	วันหยุดนักขัตฤกษ์
13089	7685	6	1	2568	1	14	t	f	\N	วันทำการ
13090	7686	6	1	2568	1	14	t	f	\N	วันทำการ
13092	7688	6	1	2568	1	14	t	f	\N	วันทำการ
13093	7689	6	1	2568	1	14	f	f	\N	วันหยุด
13094	7690	6	1	2568	1	14	f	f	\N	วันหยุด
13095	7691	6	1	2568	1	15	t	f	\N	วันทำการ
13096	7692	6	1	2568	1	15	t	f	\N	วันทำการ
13097	7693	6	1	2568	1	15	t	f	\N	วันทำการ
13098	7694	6	1	2568	1	15	t	f	\N	วันทำการ
13099	7695	6	1	2568	1	15	t	f	\N	วันทำการ
13100	7696	6	1	2568	1	15	f	f	\N	วันหยุด
13101	7697	6	1	2568	1	15	f	f	\N	วันหยุด
13102	7698	6	1	2568	1	16	t	f	\N	วันทำการ
13103	7699	6	1	2568	1	16	t	f	\N	วันทำการ
13104	7700	6	1	2568	1	16	t	f	\N	วันทำการ
13105	7701	6	1	2568	1	16	t	f	\N	วันทำการ
13106	7702	6	1	2568	1	16	t	f	\N	วันทำการ
13107	7703	6	1	2568	1	16	f	f	\N	วันหยุด
13108	7704	6	1	2568	1	16	f	f	\N	วันหยุด
13109	7705	6	1	2568	1	17	f	t	วันนวมินทรมหาราช	วันหยุดนักขัตฤกษ์
13110	7706	6	1	2568	1	17	t	f	\N	วันทำการ
13111	7707	6	1	2568	1	17	t	f	\N	วันทำการ
13112	7708	6	1	2568	1	17	t	f	\N	วันทำการ
13113	7709	6	1	2568	1	17	t	f	\N	วันทำการ
13114	7710	6	1	2568	1	17	f	f	\N	วันหยุด
13115	7711	6	1	2568	1	17	f	f	\N	วันหยุด
13116	7712	6	1	2568	1	18	t	f	\N	วันทำการ
13117	7713	6	1	2568	1	18	t	f	\N	วันทำการ
13118	7714	6	1	2568	1	18	t	f	\N	วันทำการ
13119	7715	6	1	2568	1	18	f	t	วันปิยมหาราช	วันหยุดนักขัตฤกษ์
13120	7716	6	1	2568	1	18	t	f	\N	วันทำการ
13121	7717	6	1	2568	1	18	f	f	\N	วันหยุด
13122	7718	6	1	2568	1	18	f	f	\N	วันหยุด
13123	7719	6	1	2568	1	19	t	f	\N	วันทำการ
13124	7720	6	1	2568	\N	\N	f	f	\N	ปิดภาค
13125	7721	6	1	2568	\N	\N	f	f	\N	ปิดภาค
13126	7722	6	1	2568	\N	\N	f	f	\N	ปิดภาค
13127	7723	6	1	2568	\N	\N	f	f	\N	ปิดภาค
13128	7724	6	1	2568	\N	\N	f	f	\N	วันหยุด
13129	7725	6	1	2568	\N	\N	f	f	\N	วันหยุด
13130	7726	6	1	2568	\N	\N	f	f	\N	ปิดภาค
13131	7727	6	1	2568	\N	\N	f	f	\N	ปิดภาค
13132	7728	6	1	2568	\N	\N	f	f	\N	ปิดภาค
13133	7729	6	1	2568	\N	\N	f	f	\N	ปิดภาค
13134	7730	6	1	2568	\N	\N	f	f	\N	ปิดภาค
13135	7731	6	1	2568	\N	\N	f	f	\N	วันหยุด
13136	7732	6	1	2568	\N	\N	f	f	\N	วันหยุด
13137	7733	6	1	2568	\N	\N	f	f	\N	ปิดภาค
13138	7734	6	1	2568	\N	\N	f	f	\N	ปิดภาค
13139	7735	6	1	2568	\N	\N	f	f	\N	ปิดภาค
13140	7736	6	1	2568	\N	\N	f	f	\N	ปิดภาค
13141	7737	6	1	2568	\N	\N	f	f	\N	ปิดภาค
13142	7738	6	1	2568	\N	\N	f	f	\N	วันหยุด
13143	7739	6	1	2568	\N	\N	f	f	\N	วันหยุด
13144	7740	6	1	2568	2	1	t	f	\N	วันทำการ
13145	7741	6	1	2568	2	1	t	f	\N	วันทำการ
13146	7742	6	1	2568	2	1	t	f	\N	วันทำการ
13147	7743	6	1	2568	2	1	t	f	\N	วันทำการ
13148	7744	6	1	2568	2	1	t	f	\N	วันทำการ
13149	7745	6	1	2568	2	1	f	f	\N	วันหยุด
13150	7746	6	1	2568	2	1	f	f	\N	วันหยุด
13151	7747	6	1	2568	2	2	t	f	\N	วันทำการ
13152	7748	6	1	2568	2	2	t	f	\N	วันทำการ
13153	7749	6	1	2568	2	2	t	f	\N	วันทำการ
13154	7750	6	1	2568	2	2	t	f	\N	วันทำการ
13155	7751	6	1	2568	2	2	t	f	\N	วันทำการ
13156	7752	6	1	2568	2	2	f	f	\N	วันหยุด
13157	7753	6	1	2568	2	2	f	f	\N	วันหยุด
13158	7754	6	1	2568	2	3	t	f	\N	วันทำการ
13159	7755	6	1	2568	2	3	t	f	\N	วันทำการ
13160	7756	6	1	2568	2	3	t	f	\N	วันทำการ
13161	7757	6	1	2568	2	3	t	f	\N	วันทำการ
13162	7758	6	1	2568	2	3	f	t	วันพ่อแห่งชาติ	วันหยุดนักขัตฤกษ์
13163	7759	6	1	2568	2	3	f	f	\N	วันหยุด
13164	7760	6	1	2568	2	3	f	f	\N	วันหยุด
13165	7761	6	1	2568	2	4	t	f	\N	วันทำการ
13166	7762	6	1	2568	2	4	t	f	\N	วันทำการ
13167	7763	6	1	2568	2	4	f	t	วันรัฐธรรมนูญ	วันหยุดนักขัตฤกษ์
13168	7764	6	1	2568	2	4	t	f	\N	วันทำการ
13169	7765	6	1	2568	2	4	t	f	\N	วันทำการ
13170	7766	6	1	2568	2	4	f	f	\N	วันหยุด
13171	7767	6	1	2568	2	4	f	f	\N	วันหยุด
13172	7768	6	1	2568	2	5	t	f	\N	วันทำการ
13173	7769	6	1	2568	2	5	t	f	\N	วันทำการ
13174	7770	6	1	2568	2	5	t	f	\N	วันทำการ
13175	7771	6	1	2568	2	5	t	f	\N	วันทำการ
13176	7772	6	1	2568	2	5	t	f	\N	วันทำการ
13177	7773	6	1	2568	2	5	f	f	\N	วันหยุด
13178	7774	6	1	2568	2	5	f	f	\N	วันหยุด
13179	7775	6	1	2568	2	6	t	f	\N	วันทำการ
13180	7776	6	1	2568	2	6	t	f	\N	วันทำการ
13181	7777	6	1	2568	2	6	f	t	วันคริสต์มาสอีฟ	วันหยุดนักขัตฤกษ์
13182	7778	6	1	2568	2	6	f	t	วันคริสต์มาส	วันหยุดนักขัตฤกษ์
13183	7779	6	1	2568	2	6	t	f	\N	วันทำการ
13184	7780	6	1	2568	2	6	f	f	\N	วันหยุด
13185	7781	6	1	2568	2	6	f	f	\N	วันหยุด
13186	7782	6	1	2568	2	7	t	f	\N	วันทำการ
13187	7783	6	1	2568	2	7	t	f	\N	วันทำการ
13188	7784	6	1	2568	2	7	f	t	วันสิ้นปี	วันหยุดนักขัตฤกษ์
13189	7785	6	1	2568	2	7	f	t	วันขื้นปีใหม่	วันหยุดนักขัตฤกษ์
13190	7786	6	1	2568	2	7	f	t	วันหยุดราชการธันวาคม	วันหยุดนักขัตฤกษ์
13191	7787	6	1	2568	2	7	f	f	\N	วันหยุด
13192	7788	6	1	2568	2	7	f	f	\N	วันหยุด
13193	7789	6	1	2568	2	8	t	f	\N	วันทำการ
13194	7790	6	1	2568	2	8	t	f	\N	วันทำการ
13195	7791	6	1	2568	2	8	t	f	\N	วันทำการ
13196	7792	6	1	2568	2	8	t	f	\N	วันทำการ
13197	7793	6	1	2568	2	8	t	f	\N	วันทำการ
13198	7794	6	1	2568	2	8	f	f	\N	วันหยุด
13199	7795	6	1	2568	2	8	f	f	\N	วันหยุด
13200	7796	6	1	2568	2	9	t	f	\N	วันทำการ
13201	7797	6	1	2568	2	9	t	f	\N	วันทำการ
13202	7798	6	1	2568	2	9	t	f	\N	วันทำการ
13203	7799	6	1	2568	2	9	t	f	\N	วันทำการ
13204	7800	6	1	2568	2	9	t	f	\N	วันทำการ
13205	7801	6	1	2568	2	9	f	f	\N	วันหยุด
13206	7802	6	1	2568	2	9	f	f	\N	วันหยุด
13207	7803	6	1	2568	2	10	t	f	\N	วันทำการ
13208	7804	6	1	2568	2	10	t	f	\N	วันทำการ
13209	7805	6	1	2568	2	10	t	f	\N	วันทำการ
13210	7806	6	1	2568	2	10	t	f	\N	วันทำการ
13211	7807	6	1	2568	2	10	t	f	\N	วันทำการ
13212	7808	6	1	2568	2	10	f	f	\N	วันหยุด
13213	7809	6	1	2568	2	10	f	f	\N	วันหยุด
13214	7810	6	1	2568	2	11	t	f	\N	วันทำการ
13215	7811	6	1	2568	2	11	t	f	\N	วันทำการ
13216	7812	6	1	2568	2	11	t	f	\N	วันทำการ
13217	7813	6	1	2568	2	11	t	f	\N	วันทำการ
13218	7814	6	1	2568	2	11	t	f	\N	วันทำการ
13219	7815	6	1	2568	2	11	f	f	\N	วันหยุด
13220	7816	6	1	2568	2	11	f	t	วันมาฆบูชา	วันหยุดนักขัตฤกษ์
13221	7817	6	1	2568	2	12	t	f	\N	วันทำการ
13222	7818	6	1	2568	2	12	t	f	\N	วันทำการ
13223	7819	6	1	2568	2	12	t	f	\N	วันทำการ
13224	7820	6	1	2568	2	12	t	f	\N	วันทำการ
13225	7821	6	1	2568	2	12	t	f	\N	วันทำการ
13226	7822	6	1	2568	2	12	f	f	\N	วันหยุด
13227	7823	6	1	2568	2	12	f	f	\N	วันหยุด
13228	7824	6	1	2568	2	13	t	f	\N	วันทำการ
13229	7825	6	1	2568	2	13	t	f	\N	วันทำการ
13230	7826	6	1	2568	2	13	t	f	\N	วันทำการ
13231	7827	6	1	2568	2	13	t	f	\N	วันทำการ
13232	7828	6	1	2568	2	13	t	f	\N	วันทำการ
13233	7829	6	1	2568	2	13	f	t	วันวาเลนไทน์	วันหยุดนักขัตฤกษ์
13234	7830	6	1	2568	2	13	f	f	\N	วันหยุด
13235	7831	6	1	2568	2	14	t	f	\N	วันทำการ
13236	7832	6	1	2568	2	14	f	t	วันตรุษจีน	วันหยุดนักขัตฤกษ์
13237	7833	6	1	2568	2	14	f	t	วันตรุษจีน (วันที่ 2)	วันหยุดนักขัตฤกษ์
13238	7834	6	1	2568	2	14	f	t	วันตรุษจีน (วันที่ 3)	วันหยุดนักขัตฤกษ์
13239	7835	6	1	2568	2	14	t	f	\N	วันทำการ
13240	7836	6	1	2568	2	14	f	f	\N	วันหยุด
13241	7837	6	1	2568	2	14	f	f	\N	วันหยุด
13242	7838	6	1	2568	2	15	t	f	\N	วันทำการ
13243	7839	6	1	2568	2	15	t	f	\N	วันทำการ
13244	7840	6	1	2568	2	15	t	f	\N	วันทำการ
13245	7841	6	1	2568	2	15	t	f	\N	วันทำการ
13246	7842	6	1	2568	2	15	t	f	\N	วันทำการ
13247	7843	6	1	2568	2	15	f	f	\N	วันหยุด
13248	7844	6	1	2568	2	15	f	f	\N	วันหยุด
13249	7845	6	1	2568	2	16	t	f	\N	วันทำการ
13250	7846	6	1	2568	2	16	f	t	วันมาฆบูชา	วันหยุดนักขัตฤกษ์
13251	7847	6	1	2568	2	16	t	f	\N	วันทำการ
13252	7848	6	1	2568	2	16	t	f	\N	วันทำการ
13253	7849	6	1	2568	2	16	t	f	\N	วันทำการ
13254	7850	6	1	2568	2	16	f	f	\N	วันหยุด
13255	7851	6	1	2568	2	16	f	f	\N	วันหยุด
13256	7852	6	1	2568	2	17	t	f	\N	วันทำการ
13257	7853	6	1	2568	2	17	t	f	\N	วันทำการ
13258	7854	6	1	2568	2	17	t	f	\N	วันทำการ
13259	7855	6	1	2568	2	17	t	f	\N	วันทำการ
13260	7856	6	1	2568	2	17	t	f	\N	วันทำการ
13261	7857	6	1	2568	2	17	f	f	\N	วันหยุด
13262	7858	6	1	2568	2	17	f	f	\N	วันหยุด
13263	7859	6	1	2568	2	18	t	f	\N	วันทำการ
13264	7860	6	1	2568	2	18	t	f	\N	วันทำการ
13265	7861	6	1	2568	2	18	t	f	\N	วันทำการ
13266	7862	6	1	2568	2	18	t	f	\N	วันทำการ
13267	7863	6	1	2568	2	18	t	f	\N	วันทำการ
13268	7864	6	1	2568	2	18	f	f	\N	วันหยุด
13269	7865	6	1	2568	\N	\N	f	f	\N	วันหยุด
13270	7866	6	1	2568	\N	\N	f	f	\N	ปิดภาค
13271	7867	6	1	2568	\N	\N	f	f	\N	ปิดภาค
13272	7868	6	1	2568	\N	\N	f	f	\N	ปิดภาค
13273	7869	6	1	2568	\N	\N	f	f	\N	ปิดภาค
13274	7870	6	1	2568	\N	\N	f	f	\N	ปิดภาค
13275	7871	6	1	2568	\N	\N	f	f	\N	วันหยุด
13276	7872	6	1	2568	\N	\N	f	f	\N	วันหยุด
13277	7873	6	1	2568	\N	\N	f	f	\N	ปิดภาค
13278	7874	6	1	2568	\N	\N	f	f	\N	ปิดภาค
13279	7875	6	1	2568	\N	\N	f	f	\N	ปิดภาค
13280	7876	6	1	2568	\N	\N	f	f	\N	ปิดภาค
13281	7877	6	1	2568	\N	\N	f	f	\N	ปิดภาค
13282	7878	6	1	2568	\N	\N	f	f	\N	วันหยุด
13283	7879	6	1	2568	\N	\N	f	f	\N	วันหยุด
13284	7880	6	1	2568	\N	\N	f	t	วันจักรี	วันหยุดนักขัตฤกษ์
13285	7881	6	1	2568	\N	\N	f	f	\N	ปิดภาค
13286	7882	6	1	2568	\N	\N	f	f	\N	ปิดภาค
13287	7883	6	1	2568	\N	\N	f	f	\N	ปิดภาค
13288	7884	6	1	2568	\N	\N	f	f	\N	ปิดภาค
13289	7885	6	1	2568	\N	\N	f	f	\N	วันหยุด
13290	7886	6	1	2568	\N	\N	f	f	\N	วันหยุด
13291	7887	6	1	2568	\N	\N	f	t	วันสงกรานต์	วันหยุดนักขัตฤกษ์
13292	7888	6	1	2568	\N	\N	f	t	วันสงกรานต์	วันหยุดนักขัตฤกษ์
13293	7889	6	1	2568	\N	\N	f	t	วันสงกรานต์	วันหยุดนักขัตฤกษ์
13294	7890	6	1	2568	3	1	t	f	\N	วันทำการ
13295	7891	6	1	2568	3	1	t	f	\N	วันทำการ
13296	7892	6	1	2568	3	1	f	f	\N	วันหยุด
13297	7893	6	1	2568	3	1	f	f	\N	วันหยุด
13298	7894	6	1	2568	3	2	t	f	\N	วันทำการ
13299	7895	6	1	2568	3	2	t	f	\N	วันทำการ
13300	7896	6	1	2568	3	2	t	f	\N	วันทำการ
13301	7897	6	1	2568	3	2	t	f	\N	วันทำการ
13302	7898	6	1	2568	3	2	t	f	\N	วันทำการ
13303	7899	6	1	2568	3	2	f	f	\N	วันหยุด
13304	7900	6	1	2568	3	2	f	f	\N	วันหยุด
13305	7901	6	1	2568	3	3	t	f	\N	วันทำการ
13306	7902	6	1	2568	3	3	t	f	\N	วันทำการ
13307	7903	6	1	2568	3	3	t	f	\N	วันทำการ
13308	7904	6	1	2568	3	3	t	f	\N	วันทำการ
13309	7905	6	1	2568	3	3	f	t	วันแรงงานแห่งชาติ	วันหยุดนักขัตฤกษ์
13310	7906	6	1	2568	3	3	f	f	\N	วันหยุด
13311	7907	6	1	2568	3	3	f	f	\N	วันหยุด
13312	7908	6	1	2568	3	4	f	t	วันฉัตรมงคล	วันหยุดนักขัตฤกษ์
13313	7909	6	1	2568	3	4	t	f	\N	วันทำการ
13314	7910	6	1	2568	3	4	t	f	\N	วันทำการ
13315	7911	6	1	2568	3	4	t	f	\N	วันทำการ
13316	7912	6	1	2568	3	4	t	f	\N	วันทำการ
13317	7913	6	1	2568	3	4	f	f	\N	วันหยุด
13318	7914	6	1	2568	3	4	f	f	\N	วันหยุด
13319	7915	6	1	2568	3	5	f	t	วันพืชมงคล	วันหยุดนักขัตฤกษ์
13320	7916	6	1	2568	3	5	t	f	\N	วันทำการ
13321	7917	6	1	2568	3	5	t	f	\N	วันทำการ
13322	7918	6	1	2568	3	5	t	f	\N	วันทำการ
13323	7919	6	1	2568	3	5	t	f	\N	วันทำการ
13324	7920	6	1	2568	3	5	f	f	\N	วันหยุด
13325	7921	6	1	2568	3	5	f	f	\N	วันหยุด
13326	7922	6	1	2568	3	6	t	f	\N	วันทำการ
13327	7923	6	1	2568	3	6	t	f	\N	วันทำการ
13328	7924	6	1	2568	3	6	t	f	\N	วันทำการ
13329	7925	6	1	2568	3	6	t	f	\N	วันทำการ
13330	7926	6	1	2568	3	6	t	f	\N	วันทำการ
13331	7927	6	1	2568	3	6	f	f	\N	วันหยุด
13332	7928	6	1	2568	3	6	f	f	\N	วันหยุด
13333	7929	6	1	2568	3	7	t	f	\N	วันทำการ
13334	7930	6	1	2568	3	7	t	f	\N	วันทำการ
13335	7931	6	1	2568	3	7	t	f	\N	วันทำการ
13336	7932	6	1	2568	3	7	t	f	\N	วันทำการ
13337	7933	6	1	2568	3	7	t	f	\N	วันทำการ
13338	7934	6	1	2568	3	7	f	f	\N	วันหยุด
13339	7935	6	1	2568	3	7	f	t	วันวิสาขบูชา	วันหยุดนักขัตฤกษ์
13340	7936	6	1	2568	3	8	f	t	วันหยุดชดเชยวันวิสาขบูชา	วันหยุดนักขัตฤกษ์
13341	7937	6	1	2568	3	8	t	f	\N	วันทำการ
13342	7938	6	1	2568	3	8	f	t	วันเฉลิมพระชนมพรรษาสมเด็จพระนางเจ้าสุทิดา	วันหยุดนักขัตฤกษ์
13343	7939	6	1	2568	3	8	t	f	\N	วันทำการ
13344	7940	6	1	2568	3	8	t	f	\N	วันทำการ
13345	7941	6	1	2568	3	8	f	f	\N	วันหยุด
13346	7942	6	1	2568	3	8	f	f	\N	วันหยุด
13347	7593	7	1	2568	1	1	t	f	\N	วันทำการ
13348	7594	7	1	2568	1	1	t	f	\N	วันทำการ
13349	7595	7	1	2568	1	1	t	f	\N	วันทำการ
13350	7596	7	1	2568	1	1	t	f	\N	วันทำการ
13351	7597	7	1	2568	1	1	t	f	\N	วันทำการ
13352	7598	7	1	2568	1	1	f	f	\N	วันหยุด
13353	7599	7	1	2568	1	1	f	f	\N	วันหยุด
13354	7600	7	1	2568	1	2	t	f	\N	วันทำการ
13355	7601	7	1	2568	1	2	t	f	\N	วันทำการ
13356	7602	7	1	2568	1	2	t	f	\N	วันทำการ
13357	7603	7	1	2568	1	2	t	f	\N	วันทำการ
13358	7604	7	1	2568	1	2	t	f	\N	วันทำการ
13359	7605	7	1	2568	1	2	f	f	\N	วันหยุด
13360	7606	7	1	2568	1	2	f	f	\N	วันหยุด
13361	7607	7	1	2568	1	3	t	f	\N	วันทำการ
13362	7608	7	1	2568	1	3	t	f	\N	วันทำการ
13363	7609	7	1	2568	1	3	t	f	\N	วันทำการ
13364	7610	7	1	2568	1	3	f	t	วันอาสาฬหบูชา	วันหยุดนักขัตฤกษ์
13365	7611	7	1	2568	1	3	f	t	วันเข้าพรรษา	วันหยุดนักขัตฤกษ์
13366	7612	7	1	2568	1	3	f	f	\N	วันหยุด
13367	7613	7	1	2568	1	3	f	f	\N	วันหยุด
13368	7614	7	1	2568	1	4	f	t	ชดเชยวันอาสาฬหบูชา	วันหยุดนักขัตฤกษ์
13369	7615	7	1	2568	1	4	t	f	\N	วันทำการ
13370	7616	7	1	2568	1	4	t	f	\N	วันทำการ
13371	7617	7	1	2568	1	4	t	f	\N	วันทำการ
13372	7618	7	1	2568	1	4	t	f	\N	วันทำการ
13373	7619	7	1	2568	1	4	f	f	\N	วันหยุด
13374	7620	7	1	2568	1	4	f	f	\N	วันหยุด
13375	7621	7	1	2568	1	5	t	f	\N	วันทำการ
13376	7622	7	1	2568	1	5	t	f	\N	วันทำการ
13377	7623	7	1	2568	1	5	t	f	\N	วันทำการ
13378	7624	7	1	2568	1	5	t	f	\N	วันทำการ
13379	7625	7	1	2568	1	5	t	f	\N	วันทำการ
13380	7626	7	1	2568	1	5	f	f	\N	วันหยุด
13381	7627	7	1	2568	1	5	f	f	\N	วันหยุด
13382	7628	7	1	2568	1	6	f	t	วันเฉลิมฯ ร.10	วันหยุดนักขัตฤกษ์
13383	7629	7	1	2568	1	6	t	f	\N	วันทำการ
13384	7630	7	1	2568	1	6	t	f	\N	วันทำการ
13385	7631	7	1	2568	1	6	t	f	\N	วันทำการ
13386	7632	7	1	2568	1	6	t	f	\N	วันทำการ
13387	7633	7	1	2568	1	6	f	f	\N	วันหยุด
13388	7634	7	1	2568	1	6	f	f	\N	วันหยุด
13389	7635	7	1	2568	1	7	t	f	\N	วันทำการ
13390	7636	7	1	2568	1	7	t	f	\N	วันทำการ
13391	7637	7	1	2568	1	7	t	f	\N	วันทำการ
13392	7638	7	1	2568	1	7	t	f	\N	วันทำการ
13393	7639	7	1	2568	1	7	t	f	\N	วันทำการ
13394	7640	7	1	2568	1	7	f	f	\N	วันหยุด
13395	7641	7	1	2568	1	7	f	f	\N	วันหยุด
13396	7642	7	1	2568	1	8	f	t	นักขัตฤกษ์	วันหยุดนักขัตฤกษ์
13397	7643	7	1	2568	1	8	f	t	วันแม่แห่งชาติ	วันหยุดนักขัตฤกษ์
13398	7644	7	1	2568	1	8	t	f	\N	วันทำการ
13399	7645	7	1	2568	1	8	t	f	\N	วันทำการ
13400	7646	7	1	2568	1	8	t	f	\N	วันทำการ
13401	7647	7	1	2568	1	8	f	f	\N	วันหยุด
13402	7648	7	1	2568	1	8	f	f	\N	วันหยุด
13403	7649	7	1	2568	1	9	t	f	\N	วันทำการ
13404	7650	7	1	2568	1	9	t	f	\N	วันทำการ
13405	7651	7	1	2568	1	9	t	f	\N	วันทำการ
13406	7652	7	1	2568	1	9	t	f	\N	วันทำการ
13407	7653	7	1	2568	1	9	t	f	\N	วันทำการ
13408	7654	7	1	2568	1	9	f	f	\N	วันหยุด
13409	7655	7	1	2568	1	9	f	f	\N	วันหยุด
13410	7656	7	1	2568	1	10	t	f	\N	วันทำการ
13411	7657	7	1	2568	1	10	t	f	\N	วันทำการ
13412	7658	7	1	2568	1	10	t	f	\N	วันทำการ
13413	7659	7	1	2568	1	10	t	f	\N	วันทำการ
13414	7660	7	1	2568	1	10	t	f	\N	วันทำการ
13415	7661	7	1	2568	1	10	f	f	\N	วันหยุด
13416	7662	7	1	2568	1	10	f	f	\N	วันหยุด
13417	7663	7	1	2568	1	11	t	f	\N	วันทำการ
13418	7664	7	1	2568	1	11	t	f	\N	วันทำการ
13419	7665	7	1	2568	1	11	t	f	\N	วันทำการ
13420	7666	7	1	2568	1	11	t	f	\N	วันทำการ
13421	7667	7	1	2568	1	11	t	f	\N	วันทำการ
13422	7668	7	1	2568	1	11	f	f	\N	วันหยุด
13423	7669	7	1	2568	1	11	f	f	\N	วันหยุด
13424	7670	7	1	2568	1	12	t	f	\N	วันทำการ
13425	7671	7	1	2568	1	12	t	f	\N	วันทำการ
13426	7672	7	1	2568	1	12	t	f	\N	วันทำการ
13427	7673	7	1	2568	1	12	t	f	\N	วันทำการ
13428	7674	7	1	2568	1	12	t	f	\N	วันทำการ
13429	7675	7	1	2568	1	12	f	f	\N	วันหยุด
13430	7676	7	1	2568	1	12	f	f	\N	วันหยุด
13431	7677	7	1	2568	1	13	t	f	\N	วันทำการ
13432	7678	7	1	2568	1	13	t	f	\N	วันทำการ
13433	7679	7	1	2568	1	13	t	f	\N	วันทำการ
13434	7680	7	1	2568	1	13	t	f	\N	วันทำการ
13435	7681	7	1	2568	1	13	t	f	\N	วันทำการ
13436	7682	7	1	2568	1	13	f	f	\N	วันหยุด
13437	7683	7	1	2568	1	13	f	f	\N	วันหยุด
13438	7684	7	1	2568	1	14	f	t	วันสงขลานครินทร์	วันหยุดนักขัตฤกษ์
13439	7685	7	1	2568	1	14	t	f	\N	วันทำการ
13440	7686	7	1	2568	1	14	t	f	\N	วันทำการ
13441	7687	7	1	2568	1	14	t	f	\N	วันทำการ
13442	7688	7	1	2568	1	14	t	f	\N	วันทำการ
13443	7689	7	1	2568	1	14	f	f	\N	วันหยุด
13444	7690	7	1	2568	1	14	f	f	\N	วันหยุด
13445	7691	7	1	2568	1	15	t	f	\N	วันทำการ
13446	7692	7	1	2568	1	15	t	f	\N	วันทำการ
13447	7693	7	1	2568	1	15	t	f	\N	วันทำการ
13448	7694	7	1	2568	1	15	t	f	\N	วันทำการ
13449	7695	7	1	2568	1	15	t	f	\N	วันทำการ
13450	7696	7	1	2568	1	15	f	f	\N	วันหยุด
13451	7697	7	1	2568	1	15	f	f	\N	วันหยุด
13452	7698	7	1	2568	1	16	t	f	\N	วันทำการ
13453	7699	7	1	2568	1	16	t	f	\N	วันทำการ
13454	7700	7	1	2568	1	16	t	f	\N	วันทำการ
13455	7701	7	1	2568	1	16	t	f	\N	วันทำการ
13456	7702	7	1	2568	1	16	t	f	\N	วันทำการ
13457	7703	7	1	2568	1	16	f	f	\N	วันหยุด
13458	7704	7	1	2568	1	16	f	f	\N	วันหยุด
13459	7705	7	1	2568	1	17	f	t	วันนวมินทรมหาราช	วันหยุดนักขัตฤกษ์
13460	7706	7	1	2568	1	17	t	f	\N	วันทำการ
13461	7707	7	1	2568	1	17	t	f	\N	วันทำการ
13462	7708	7	1	2568	1	17	t	f	\N	วันทำการ
13463	7709	7	1	2568	1	17	t	f	\N	วันทำการ
13464	7710	7	1	2568	1	17	f	f	\N	วันหยุด
13465	7711	7	1	2568	1	17	f	f	\N	วันหยุด
13466	7712	7	1	2568	1	18	t	f	\N	วันทำการ
13467	7713	7	1	2568	1	18	t	f	\N	วันทำการ
13468	7714	7	1	2568	1	18	t	f	\N	วันทำการ
13469	7715	7	1	2568	1	18	f	t	วันปิยมหาราช	วันหยุดนักขัตฤกษ์
13470	7716	7	1	2568	1	18	t	f	\N	วันทำการ
13471	7717	7	1	2568	1	18	f	f	\N	วันหยุด
13472	7718	7	1	2568	1	18	f	f	\N	วันหยุด
13473	7719	7	1	2568	1	19	t	f	\N	วันทำการ
13474	7720	7	1	2568	\N	\N	f	f	\N	ปิดภาค
13475	7721	7	1	2568	\N	\N	f	f	\N	ปิดภาค
13476	7722	7	1	2568	\N	\N	f	f	\N	ปิดภาค
13477	7723	7	1	2568	\N	\N	f	f	\N	ปิดภาค
13478	7724	7	1	2568	\N	\N	f	f	\N	วันหยุด
13479	7725	7	1	2568	\N	\N	f	f	\N	วันหยุด
13480	7726	7	1	2568	\N	\N	f	f	\N	ปิดภาค
13481	7727	7	1	2568	\N	\N	f	f	\N	ปิดภาค
13482	7728	7	1	2568	\N	\N	f	f	\N	ปิดภาค
13483	7729	7	1	2568	\N	\N	f	f	\N	ปิดภาค
13484	7730	7	1	2568	\N	\N	f	f	\N	ปิดภาค
13485	7731	7	1	2568	\N	\N	f	f	\N	วันหยุด
13486	7732	7	1	2568	\N	\N	f	f	\N	วันหยุด
13487	7733	7	1	2568	\N	\N	f	f	\N	ปิดภาค
13488	7734	7	1	2568	\N	\N	f	f	\N	ปิดภาค
13489	7735	7	1	2568	\N	\N	f	f	\N	ปิดภาค
13490	7736	7	1	2568	\N	\N	f	f	\N	ปิดภาค
13491	7737	7	1	2568	\N	\N	f	f	\N	ปิดภาค
13492	7738	7	1	2568	\N	\N	f	f	\N	วันหยุด
13493	7739	7	1	2568	\N	\N	f	f	\N	วันหยุด
13494	7740	7	1	2568	2	1	t	f	\N	วันทำการ
13495	7741	7	1	2568	2	1	t	f	\N	วันทำการ
13496	7742	7	1	2568	2	1	t	f	\N	วันทำการ
13497	7743	7	1	2568	2	1	t	f	\N	วันทำการ
13498	7744	7	1	2568	2	1	t	f	\N	วันทำการ
13499	7745	7	1	2568	2	1	f	f	\N	วันหยุด
13500	7746	7	1	2568	2	1	f	f	\N	วันหยุด
13501	7747	7	1	2568	2	2	t	f	\N	วันทำการ
13502	7748	7	1	2568	2	2	t	f	\N	วันทำการ
13503	7749	7	1	2568	2	2	t	f	\N	วันทำการ
13504	7750	7	1	2568	2	2	t	f	\N	วันทำการ
13505	7751	7	1	2568	2	2	t	f	\N	วันทำการ
13506	7752	7	1	2568	2	2	f	f	\N	วันหยุด
13507	7753	7	1	2568	2	2	f	f	\N	วันหยุด
13508	7754	7	1	2568	2	3	t	f	\N	วันทำการ
13509	7755	7	1	2568	2	3	t	f	\N	วันทำการ
13510	7756	7	1	2568	2	3	t	f	\N	วันทำการ
13511	7757	7	1	2568	2	3	t	f	\N	วันทำการ
13512	7758	7	1	2568	2	3	f	t	วันพ่อแห่งชาติ	วันหยุดนักขัตฤกษ์
13513	7759	7	1	2568	2	3	f	f	\N	วันหยุด
13514	7760	7	1	2568	2	3	f	f	\N	วันหยุด
13515	7761	7	1	2568	2	4	t	f	\N	วันทำการ
13516	7762	7	1	2568	2	4	t	f	\N	วันทำการ
13517	7763	7	1	2568	2	4	f	t	วันรัฐธรรมนูญ	วันหยุดนักขัตฤกษ์
13518	7764	7	1	2568	2	4	t	f	\N	วันทำการ
13519	7765	7	1	2568	2	4	t	f	\N	วันทำการ
13520	7766	7	1	2568	2	4	f	f	\N	วันหยุด
13521	7767	7	1	2568	2	4	f	f	\N	วันหยุด
13522	7768	7	1	2568	2	5	t	f	\N	วันทำการ
13523	7769	7	1	2568	2	5	t	f	\N	วันทำการ
13524	7770	7	1	2568	2	5	t	f	\N	วันทำการ
13525	7771	7	1	2568	2	5	t	f	\N	วันทำการ
13526	7772	7	1	2568	2	5	t	f	\N	วันทำการ
13527	7773	7	1	2568	2	5	f	f	\N	วันหยุด
13528	7774	7	1	2568	2	5	f	f	\N	วันหยุด
13529	7775	7	1	2568	2	6	t	f	\N	วันทำการ
13530	7776	7	1	2568	2	6	t	f	\N	วันทำการ
13531	7777	7	1	2568	2	6	f	t	วันคริสต์มาสอีฟ	วันหยุดนักขัตฤกษ์
13532	7778	7	1	2568	2	6	f	t	วันคริสต์มาส	วันหยุดนักขัตฤกษ์
13533	7779	7	1	2568	2	6	t	f	\N	วันทำการ
13534	7780	7	1	2568	2	6	f	f	\N	วันหยุด
13535	7781	7	1	2568	2	6	f	f	\N	วันหยุด
13536	7782	7	1	2568	2	7	t	f	\N	วันทำการ
13537	7783	7	1	2568	2	7	t	f	\N	วันทำการ
13538	7784	7	1	2568	2	7	f	t	วันสิ้นปี	วันหยุดนักขัตฤกษ์
13539	7785	7	1	2568	2	7	f	t	วันขื้นปีใหม่	วันหยุดนักขัตฤกษ์
13540	7786	7	1	2568	2	7	f	t	วันหยุดราชการธันวาคม	วันหยุดนักขัตฤกษ์
13541	7787	7	1	2568	2	7	f	f	\N	วันหยุด
13542	7788	7	1	2568	2	7	f	f	\N	วันหยุด
13543	7789	7	1	2568	2	8	t	f	\N	วันทำการ
13544	7790	7	1	2568	2	8	t	f	\N	วันทำการ
13545	7791	7	1	2568	2	8	t	f	\N	วันทำการ
13546	7792	7	1	2568	2	8	t	f	\N	วันทำการ
13547	7793	7	1	2568	2	8	t	f	\N	วันทำการ
13548	7794	7	1	2568	2	8	f	f	\N	วันหยุด
13549	7795	7	1	2568	2	8	f	f	\N	วันหยุด
13550	7796	7	1	2568	2	9	t	f	\N	วันทำการ
13551	7797	7	1	2568	2	9	t	f	\N	วันทำการ
13552	7798	7	1	2568	2	9	t	f	\N	วันทำการ
13553	7799	7	1	2568	2	9	t	f	\N	วันทำการ
13554	7800	7	1	2568	2	9	t	f	\N	วันทำการ
13555	7801	7	1	2568	2	9	f	f	\N	วันหยุด
13556	7802	7	1	2568	2	9	f	f	\N	วันหยุด
13557	7803	7	1	2568	2	10	t	f	\N	วันทำการ
13558	7804	7	1	2568	2	10	t	f	\N	วันทำการ
13559	7805	7	1	2568	2	10	t	f	\N	วันทำการ
13560	7806	7	1	2568	2	10	t	f	\N	วันทำการ
13561	7807	7	1	2568	2	10	t	f	\N	วันทำการ
13562	7808	7	1	2568	2	10	f	f	\N	วันหยุด
13563	7809	7	1	2568	2	10	f	f	\N	วันหยุด
13564	7810	7	1	2568	2	11	t	f	\N	วันทำการ
13565	7811	7	1	2568	2	11	t	f	\N	วันทำการ
13566	7812	7	1	2568	2	11	t	f	\N	วันทำการ
13567	7813	7	1	2568	2	11	t	f	\N	วันทำการ
13568	7814	7	1	2568	2	11	t	f	\N	วันทำการ
13569	7815	7	1	2568	2	11	f	f	\N	วันหยุด
13570	7816	7	1	2568	2	11	f	t	วันมาฆบูชา	วันหยุดนักขัตฤกษ์
13571	7817	7	1	2568	2	12	t	f	\N	วันทำการ
13572	7818	7	1	2568	2	12	t	f	\N	วันทำการ
13573	7819	7	1	2568	2	12	t	f	\N	วันทำการ
13574	7820	7	1	2568	2	12	t	f	\N	วันทำการ
13575	7821	7	1	2568	2	12	t	f	\N	วันทำการ
13576	7822	7	1	2568	2	12	f	f	\N	วันหยุด
13577	7823	7	1	2568	2	12	f	f	\N	วันหยุด
13578	7824	7	1	2568	2	13	t	f	\N	วันทำการ
13579	7825	7	1	2568	2	13	t	f	\N	วันทำการ
13580	7826	7	1	2568	2	13	t	f	\N	วันทำการ
13581	7827	7	1	2568	2	13	t	f	\N	วันทำการ
13582	7828	7	1	2568	2	13	t	f	\N	วันทำการ
13583	7829	7	1	2568	2	13	f	t	วันวาเลนไทน์	วันหยุดนักขัตฤกษ์
13584	7830	7	1	2568	2	13	f	f	\N	วันหยุด
13585	7831	7	1	2568	2	14	t	f	\N	วันทำการ
13586	7832	7	1	2568	2	14	f	t	วันตรุษจีน	วันหยุดนักขัตฤกษ์
13587	7833	7	1	2568	2	14	f	t	วันตรุษจีน (วันที่ 2)	วันหยุดนักขัตฤกษ์
13588	7834	7	1	2568	2	14	f	t	วันตรุษจีน (วันที่ 3)	วันหยุดนักขัตฤกษ์
13589	7835	7	1	2568	2	14	t	f	\N	วันทำการ
13590	7836	7	1	2568	2	14	f	f	\N	วันหยุด
13591	7837	7	1	2568	2	14	f	f	\N	วันหยุด
13592	7838	7	1	2568	2	15	t	f	\N	วันทำการ
13593	7839	7	1	2568	2	15	t	f	\N	วันทำการ
13594	7840	7	1	2568	2	15	t	f	\N	วันทำการ
13595	7841	7	1	2568	2	15	t	f	\N	วันทำการ
13596	7842	7	1	2568	2	15	t	f	\N	วันทำการ
13597	7843	7	1	2568	2	15	f	f	\N	วันหยุด
13598	7844	7	1	2568	2	15	f	f	\N	วันหยุด
13599	7845	7	1	2568	2	16	t	f	\N	วันทำการ
13600	7846	7	1	2568	2	16	f	t	วันมาฆบูชา	วันหยุดนักขัตฤกษ์
13601	7847	7	1	2568	2	16	t	f	\N	วันทำการ
13602	7848	7	1	2568	2	16	t	f	\N	วันทำการ
13603	7849	7	1	2568	2	16	t	f	\N	วันทำการ
13604	7850	7	1	2568	2	16	f	f	\N	วันหยุด
13605	7851	7	1	2568	2	16	f	f	\N	วันหยุด
13606	7852	7	1	2568	2	17	t	f	\N	วันทำการ
13607	7853	7	1	2568	2	17	t	f	\N	วันทำการ
13608	7854	7	1	2568	2	17	t	f	\N	วันทำการ
13609	7855	7	1	2568	2	17	t	f	\N	วันทำการ
13610	7856	7	1	2568	2	17	t	f	\N	วันทำการ
13611	7857	7	1	2568	2	17	f	f	\N	วันหยุด
13612	7858	7	1	2568	2	17	f	f	\N	วันหยุด
13613	7859	7	1	2568	2	18	t	f	\N	วันทำการ
13614	7860	7	1	2568	2	18	t	f	\N	วันทำการ
13615	7861	7	1	2568	2	18	t	f	\N	วันทำการ
13616	7862	7	1	2568	2	18	t	f	\N	วันทำการ
13617	7863	7	1	2568	2	18	t	f	\N	วันทำการ
13618	7864	7	1	2568	2	18	f	f	\N	วันหยุด
13619	7865	7	1	2568	\N	\N	f	f	\N	วันหยุด
13620	7866	7	1	2568	\N	\N	f	f	\N	ปิดภาค
13621	7867	7	1	2568	\N	\N	f	f	\N	ปิดภาค
13622	7868	7	1	2568	\N	\N	f	f	\N	ปิดภาค
13623	7869	7	1	2568	\N	\N	f	f	\N	ปิดภาค
13624	7870	7	1	2568	\N	\N	f	f	\N	ปิดภาค
13625	7871	7	1	2568	\N	\N	f	f	\N	วันหยุด
13626	7872	7	1	2568	\N	\N	f	f	\N	วันหยุด
13627	7873	7	1	2568	\N	\N	f	f	\N	ปิดภาค
13628	7874	7	1	2568	\N	\N	f	f	\N	ปิดภาค
13629	7875	7	1	2568	\N	\N	f	f	\N	ปิดภาค
13630	7876	7	1	2568	\N	\N	f	f	\N	ปิดภาค
13631	7877	7	1	2568	\N	\N	f	f	\N	ปิดภาค
13632	7878	7	1	2568	\N	\N	f	f	\N	วันหยุด
13633	7879	7	1	2568	\N	\N	f	f	\N	วันหยุด
13634	7880	7	1	2568	\N	\N	f	t	วันจักรี	วันหยุดนักขัตฤกษ์
13635	7881	7	1	2568	\N	\N	f	f	\N	ปิดภาค
13636	7882	7	1	2568	\N	\N	f	f	\N	ปิดภาค
13637	7883	7	1	2568	\N	\N	f	f	\N	ปิดภาค
13638	7884	7	1	2568	\N	\N	f	f	\N	ปิดภาค
13639	7885	7	1	2568	\N	\N	f	f	\N	วันหยุด
13640	7886	7	1	2568	\N	\N	f	f	\N	วันหยุด
13641	7887	7	1	2568	\N	\N	f	t	วันสงกรานต์	วันหยุดนักขัตฤกษ์
13642	7888	7	1	2568	\N	\N	f	t	วันสงกรานต์	วันหยุดนักขัตฤกษ์
13643	7889	7	1	2568	\N	\N	f	t	วันสงกรานต์	วันหยุดนักขัตฤกษ์
13644	7890	7	1	2568	3	1	t	f	\N	วันทำการ
13645	7891	7	1	2568	3	1	t	f	\N	วันทำการ
13646	7892	7	1	2568	3	1	f	f	\N	วันหยุด
13647	7893	7	1	2568	3	1	f	f	\N	วันหยุด
13648	7894	7	1	2568	3	2	t	f	\N	วันทำการ
13649	7895	7	1	2568	3	2	t	f	\N	วันทำการ
13650	7896	7	1	2568	3	2	t	f	\N	วันทำการ
13651	7897	7	1	2568	3	2	t	f	\N	วันทำการ
13652	7898	7	1	2568	3	2	t	f	\N	วันทำการ
13653	7899	7	1	2568	3	2	f	f	\N	วันหยุด
13654	7900	7	1	2568	3	2	f	f	\N	วันหยุด
13655	7901	7	1	2568	3	3	t	f	\N	วันทำการ
13656	7902	7	1	2568	3	3	t	f	\N	วันทำการ
13657	7903	7	1	2568	3	3	t	f	\N	วันทำการ
13658	7904	7	1	2568	3	3	t	f	\N	วันทำการ
13659	7905	7	1	2568	3	3	f	t	วันแรงงานแห่งชาติ	วันหยุดนักขัตฤกษ์
13660	7906	7	1	2568	3	3	f	f	\N	วันหยุด
13661	7907	7	1	2568	3	3	f	f	\N	วันหยุด
13662	7908	7	1	2568	3	4	f	t	วันฉัตรมงคล	วันหยุดนักขัตฤกษ์
13663	7909	7	1	2568	3	4	t	f	\N	วันทำการ
13664	7910	7	1	2568	3	4	t	f	\N	วันทำการ
13665	7911	7	1	2568	3	4	t	f	\N	วันทำการ
13666	7912	7	1	2568	3	4	t	f	\N	วันทำการ
13667	7913	7	1	2568	3	4	f	f	\N	วันหยุด
13668	7914	7	1	2568	3	4	f	f	\N	วันหยุด
13669	7915	7	1	2568	3	5	f	t	วันพืชมงคล	วันหยุดนักขัตฤกษ์
13670	7916	7	1	2568	3	5	t	f	\N	วันทำการ
13671	7917	7	1	2568	3	5	t	f	\N	วันทำการ
13672	7918	7	1	2568	3	5	t	f	\N	วันทำการ
13673	7919	7	1	2568	3	5	t	f	\N	วันทำการ
13674	7920	7	1	2568	3	5	f	f	\N	วันหยุด
13675	7921	7	1	2568	3	5	f	f	\N	วันหยุด
13676	7922	7	1	2568	3	6	t	f	\N	วันทำการ
13677	7923	7	1	2568	3	6	t	f	\N	วันทำการ
13678	7924	7	1	2568	3	6	t	f	\N	วันทำการ
13679	7925	7	1	2568	3	6	t	f	\N	วันทำการ
13680	7926	7	1	2568	3	6	t	f	\N	วันทำการ
13681	7927	7	1	2568	3	6	f	f	\N	วันหยุด
13682	7928	7	1	2568	3	6	f	f	\N	วันหยุด
13683	7929	7	1	2568	3	7	t	f	\N	วันทำการ
13684	7930	7	1	2568	3	7	t	f	\N	วันทำการ
13685	7931	7	1	2568	3	7	t	f	\N	วันทำการ
13686	7932	7	1	2568	3	7	t	f	\N	วันทำการ
13687	7933	7	1	2568	3	7	t	f	\N	วันทำการ
13688	7934	7	1	2568	3	7	f	f	\N	วันหยุด
13689	7935	7	1	2568	3	7	f	t	วันวิสาขบูชา	วันหยุดนักขัตฤกษ์
13690	7936	7	1	2568	3	8	f	t	วันหยุดชดเชยวันวิสาขบูชา	วันหยุดนักขัตฤกษ์
13691	7937	7	1	2568	3	8	t	f	\N	วันทำการ
13692	7938	7	1	2568	3	8	f	t	วันเฉลิมพระชนมพรรษาสมเด็จพระนางเจ้าสุทิดา	วันหยุดนักขัตฤกษ์
13693	7939	7	1	2568	3	8	t	f	\N	วันทำการ
13694	7940	7	1	2568	3	8	t	f	\N	วันทำการ
13695	7941	7	1	2568	3	8	f	f	\N	วันหยุด
13696	7942	7	1	2568	3	8	f	f	\N	วันหยุด
\.


--
-- Name: dim_campus_id_seq; Type: SEQUENCE SET; Schema: public; Owner: admin
--

SELECT pg_catalog.setval('public.dim_campus_id_seq', 53, true);


--
-- Name: dim_date_id_seq; Type: SEQUENCE SET; Schema: public; Owner: admin
--

SELECT pg_catalog.setval('public.dim_date_id_seq', 10998, true);


--
-- Name: dim_faculty_id_seq; Type: SEQUENCE SET; Schema: public; Owner: admin
--

SELECT pg_catalog.setval('public.dim_faculty_id_seq', 53, true);


--
-- Name: fact_academic_calendar_id_seq; Type: SEQUENCE SET; Schema: public; Owner: admin
--

SELECT pg_catalog.setval('public.fact_academic_calendar_id_seq', 13696, true);


--
-- Name: dim_campus dim_campus_campus_code_key; Type: CONSTRAINT; Schema: public; Owner: admin
--

ALTER TABLE ONLY public.dim_campus
    ADD CONSTRAINT dim_campus_campus_code_key UNIQUE (campus_code);


--
-- Name: dim_campus dim_campus_pkey; Type: CONSTRAINT; Schema: public; Owner: admin
--

ALTER TABLE ONLY public.dim_campus
    ADD CONSTRAINT dim_campus_pkey PRIMARY KEY (id);


--
-- Name: dim_date dim_date_date_actual_key; Type: CONSTRAINT; Schema: public; Owner: admin
--

ALTER TABLE ONLY public.dim_date
    ADD CONSTRAINT dim_date_date_actual_key UNIQUE (date_actual);


--
-- Name: dim_date dim_date_pkey; Type: CONSTRAINT; Schema: public; Owner: admin
--

ALTER TABLE ONLY public.dim_date
    ADD CONSTRAINT dim_date_pkey PRIMARY KEY (id);


--
-- Name: dim_faculty dim_faculty_faculty_code_key; Type: CONSTRAINT; Schema: public; Owner: admin
--

ALTER TABLE ONLY public.dim_faculty
    ADD CONSTRAINT dim_faculty_faculty_code_key UNIQUE (faculty_code);


--
-- Name: dim_faculty dim_faculty_pkey; Type: CONSTRAINT; Schema: public; Owner: admin
--

ALTER TABLE ONLY public.dim_faculty
    ADD CONSTRAINT dim_faculty_pkey PRIMARY KEY (id);


--
-- Name: fact_academic_calendar fact_academic_calendar_date_id_campus_id_faculty_id_key; Type: CONSTRAINT; Schema: public; Owner: admin
--

ALTER TABLE ONLY public.fact_academic_calendar
    ADD CONSTRAINT fact_academic_calendar_date_id_campus_id_faculty_id_key UNIQUE (date_id, campus_id, faculty_id);


--
-- Name: fact_academic_calendar fact_academic_calendar_pkey; Type: CONSTRAINT; Schema: public; Owner: admin
--

ALTER TABLE ONLY public.fact_academic_calendar
    ADD CONSTRAINT fact_academic_calendar_pkey PRIMARY KEY (id);


--
-- Name: fact_academic_calendar fact_academic_calendar_campus_id_fkey; Type: FK CONSTRAINT; Schema: public; Owner: admin
--

ALTER TABLE ONLY public.fact_academic_calendar
    ADD CONSTRAINT fact_academic_calendar_campus_id_fkey FOREIGN KEY (campus_id) REFERENCES public.dim_campus(id);


--
-- Name: fact_academic_calendar fact_academic_calendar_date_id_fkey; Type: FK CONSTRAINT; Schema: public; Owner: admin
--

ALTER TABLE ONLY public.fact_academic_calendar
    ADD CONSTRAINT fact_academic_calendar_date_id_fkey FOREIGN KEY (date_id) REFERENCES public.dim_date(id);


--
-- Name: fact_academic_calendar fact_academic_calendar_faculty_id_fkey; Type: FK CONSTRAINT; Schema: public; Owner: admin
--

ALTER TABLE ONLY public.fact_academic_calendar
    ADD CONSTRAINT fact_academic_calendar_faculty_id_fkey FOREIGN KEY (faculty_id) REFERENCES public.dim_faculty(id);


--
-- PostgreSQL database dump complete
--

\unrestrict 9gzRY4pjJgFgOwxeyFuFTy4cRnvHrgShKW9YKfLHkhrY0Tj5DgVmt1unkOMsqLO

